{
  "notice_publication_id": "133697-2024",
  "buyer": {
    "official_name": "Department of Justice",
    "email": "cpu@justice.ie",
    "legal_type": "body-pl-cga",
    "activity": "gen-pub",
    "address": {
      "street": "51 St Stephen's Green",
      "city": "Dublin",
      "postal_code": "D02 HK52",
      "country": "IRL"
    },
    "website": "https://www.gov.ie/en/organisation/department-of-justice/",
    "company_id": "Department of Justice",
    "phone": "016028202"
  },
  "procedure": {
    "title": "CFT Recruitment support services for the Department of Justice/Gambling Regulatory Authority of Ireland (GRAI)",
    "description": "**Title: CFT Recruitment Support Services for the Department of Justice/Gambling Regulatory Authority of Ireland (GRAI)**\n\n**Description:**\nThe Department of Justice, in collaboration with the Gambling Regulatory Authority of Ireland (GRAI), is seeking a recruitment agency to provide comprehensive recruitment support services. Initially, the Department of Justice will be the Contracting Authority, but responsibility will novate to GRAI upon its establishment, subject to the enactment of the proposed Gambling Regulation Bill. Once established, GRAI will be the new statutory body responsible for licensing and regulating betting, gaming, certain lotteries, and related products or services in Ireland. GRAI will operate independently, focusing on public safety and wellbeing, covering both online and in-person gambling activities. It will also have powers to regulate advertising, gambling websites, and apps.\n\nThe key objectives for this procurement include working with a recruitment agency that can proactively and successfully execute targeted talent sourcing and attraction strategies. The agency should be able to recruit and place the best candidates into various roles at GRAI at administrative, executive, middle, and senior management levels. The successful bidder will need to demonstrate expertise in managing complex recruitment processes, ensuring diversity and inclusion in candidate selection, and providing ongoing support to GRAI as it establishes its operational framework.\n\n**Key Requirements:**\n- **Proactive Talent Sourcing:** The ability to identify and attract top talent from diverse backgrounds.\n- **Complex Recruitment Management:** Experience in managing multi-level recruitment processes for administrative, executive, middle, and senior management roles.\n- **Diversity and Inclusion:** A commitment to ensuring diversity and inclusion in the candidate selection process.\n- **Ongoing Support:** The capacity to provide continuous support as GRAI establishes its operational framework and begins its regulatory functions.\n- **Regulatory Compliance:** Familiarity with Irish regulatory requirements and the ability to ensure compliance in all recruitment activities.\n- **Public Safety Focus:** Understanding of the importance of public safety and wellbeing in the context of gambling regulation.\n\nBy partnering with a capable and experienced recruitment agency, GRAI aims to build a robust workforce that supports its mission of promoting public safety and wellbeing in the gambling sector. The successful bidder will play a crucial role in helping GRAI achieve its vision of a safe, fair, and inclusive Ireland.",
    "identifier": "f4e6bccc-5125-4598-8cb7-a2ed59b53831",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-04-05+00:00",
    "deadline_time": "17:00:00+00:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "79600000",
    "additional_classifications": [
      "79610000",
      "79610000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "140000",
    "currency": "",
    "maximum_value": "140000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "false",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-04-05+00:00",
    "open_tender_time": "17:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3183911"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "CFT Recruitment support services for the Department of Justice/Gambling Regulatory Authority of Ireland (GRAI)",
      "description": "The Contracting Authority responsible for this procurement will initially be the Department of Justice, however, responsibility will novate to the Gambling Regulatory Authority of Ireland (GRAI) upon establishment which is subject to the enactment of the proposed Gambling Regulation Bill . Once established the GRAI will be the new statutory body responsible for the licensing and regulation of betting, gaming, certain lotteries and the supply of products or services related to gambling in Ireland. The GRAI will be independent in the performance of its functions and will focus on public safety and wellbeing, covering gambling online and in person, and will have powers to regulate advertising, gambling, websites, and apps. One of GRAI’s key objectives for this procurement is to work with a recruitment agency that can proactively and successfully execute targeted talent sourcing and attraction strategies and tactics that will lead to the recruitment and placement of the best candidates into a range of roles at the Gambling Authority of Ireland (GRAI) at administrative, executive, middle and senior management levels.",
      "main_nature": "services",
      "main_classification": "79600000",
      "additional_classifications": [
        "79610000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "140000",
        "currency": "",
        "maximum_value": "140000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "false",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3183911"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/133697-2024/pdf"
}