{
  "notice_publication_id": "151916-2024",
  "buyer": {
    "official_name": "Health Service Executive",
    "email": "patrick.monahan@hse.ie",
    "legal_type": "body-pl-cga",
    "activity": "health",
    "address": {
      "street": "Oak House Millennium Park Naas Co Kildare",
      "city": "Naas",
      "postal_code": "W91 KDC2",
      "country": "IRL"
    },
    "website": "www.hse.ie",
    "company_id": "0043024G",
    "phone": "0874866561"
  },
  "procedure": {
    "title": "Suicide Prevention Training Service for CHO 8 Mental Health Louth and Meath",
    "description": "**Title:** Suicide Prevention Training Service for CHO 8 Mental Health Louth and Meath\n\n**Description:**\nThe Health Service Executive (HSE) Community Healthcare Louth and Meath – Mental Health is inviting applications from suitably qualified organisations to submit a tender proposal demonstrating their suitability to co-ordinate and support access to and delivery of suicide prevention-related training across the region, both online and face-to-face. The successful bidder will be responsible for ensuring that the training is evidence-based, culturally sensitive, and tailored to meet the diverse needs of the community. The training should be designed to enhance the skills of healthcare professionals, community workers, and other stakeholders in identifying and managing individuals at risk of suicide. The proposal should include details on the bidder's experience in delivering similar training programs, their ability to engage with local communities, and their capacity to provide ongoing support and evaluation of the training initiatives. The HSE is committed to improving mental health services and reducing suicide rates in the region, and the selected bidder will play a crucial role in achieving these goals. The tender process aims to identify a partner that can collaborate effectively with local health services, community organizations, and other stakeholders to ensure comprehensive and impactful suicide prevention training.\n\n**Key Requirements:**\n1. **Experience in Suicide Prevention Training:** The bidder should have a proven track record in delivering evidence-based suicide prevention training programs.\n2. **Cultural Sensitivity:** The training should be culturally sensitive and adaptable to the diverse needs of the local community.\n3. **Online and Face-to-Face Delivery:** The bidder should be capable of delivering training both online and face-to-face to cater to different learning preferences.\n4. **Community Engagement:** The bidder should demonstrate the ability to engage effectively with local communities, including healthcare providers, community workers, and other stakeholders.\n5. **Ongoing Support and Evaluation:** The bidder should provide ongoing support and evaluation mechanisms to ensure the effectiveness of the training initiatives.\n6. **Collaboration with Local Health Services:** The bidder should be able to collaborate effectively with local health services and community organizations to ensure comprehensive coverage.\n7. **Evidence-Based Approach:** The training should be grounded in the latest research and evidence-based practices in suicide prevention.\n\nBy submitting a comprehensive proposal that addresses these key requirements, bidders can effectively demonstrate their suitability to support the HSE in its mission to improve mental health services and reduce suicide rates in CHO 8 Mental Health Louth and Meath.",
    "identifier": "79e40917-7085-41ca-b40a-0b319fc0c6a5",
    "type": "open",
    "accelerated": "",
    "deadline_date": "2024-04-16+00:00",
    "deadline_time": "12:00:00+00:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "80510000",
    "additional_classifications": [
      "80500000",
      "80420000",
      "80500000",
      "80420000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "1",
    "currency": "",
    "maximum_value": "1"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "",
    "electronic_ordering": "",
    "electronic_payment": ""
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "",
    "open_tender_date": "2024-04-16+00:00",
    "open_tender_time": "12:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3235749"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Suicide Prevention Training Service for CHO 8 Mental Health Louth and Meath",
      "description": "**Title: Suicide Prevention Training Service for CHO 8 Mental Health Louth and Meath**\n\n**Description:**\nThe Health Service Executive (HSE) Community Healthcare Louth and Meath – Mental Health is inviting applications from suitably qualified organizations to submit a tender proposal demonstrating their suitability to co-ordinate and support access to and delivery of suicide prevention-related training across the region, both online and face-to-face. The successful bidder will be responsible for ensuring that the training is evidence-based, culturally sensitive, and tailored to meet the diverse needs of the local community. The service should include:\n\n- **Training Coordination:** Effective coordination of training sessions, ensuring timely delivery and minimal disruptions.\n- **Training Delivery:** Provision of high-quality, engaging, and interactive training sessions that cater to both online and face-to-face formats.\n- **Accessibility:** Ensuring that the training is accessible to all stakeholders, including healthcare professionals, community groups, and individuals at risk.\n- **Evaluation:** Conducting regular evaluations to assess the effectiveness of the training and making necessary improvements.\n- **Collaboration:** Collaborating with local mental health services, community organizations, and other relevant stakeholders to ensure a comprehensive approach to suicide prevention.\n- **Reporting:** Providing regular reports on the training activities, including participant feedback and outcomes.\n- **Compliance:** Adhering to all relevant health and safety guidelines, as well as any specific regulations related to mental health services.\n\nThe HSE is committed to improving mental health services and reducing the incidence of suicide in the region. The selected bidder will play a crucial role in this initiative by providing effective and accessible suicide prevention training. The proposal should include detailed information about the bidder's experience in delivering similar services, their methodology for ensuring the quality and impact of the training, and any additional resources they can bring to support this initiative.\n\n**Additional Requirements:**\n- **Qualifications:** The bidder should have relevant qualifications and experience in mental health training, particularly in the area of suicide prevention.\n- **Certifications:** Any relevant certifications or accreditations that demonstrate the bidder's expertise in delivering high-quality mental health training.\n- **Case Studies:** Submission of case studies or testimonials from previous clients that highlight the bidder's success in delivering effective mental health training.\n- **Budget and Cost Structure:** A detailed breakdown of the costs associated with delivering the training, including any additional resources or personnel required.\n- **Timeline:** A clear timeline for the delivery of the training, including milestones and deadlines.\n\nThe HSE encourages all interested and qualified organizations to submit their proposals, ensuring that they meet the specified criteria and requirements outlined above. The successful bidder will be selected based on their ability to deliver high-quality, accessible, and effective suicide prevention training services.",
      "main_nature": "services",
      "main_classification": "80510000",
      "additional_classifications": [
        "80500000",
        "80420000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "1",
        "currency": "",
        "maximum_value": "1"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "sui-act",
        "variant_submissions": "",
        "electronic_invoicing": "",
        "electronic_ordering": "",
        "electronic_payment": ""
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3235749"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/151916-2024/pdf"
}