{
  "notice_publication_id": "152474-2024",
  "buyer": {
    "official_name": "Raidió Teilifís Éireann ( RTÉ )",
    "email": "purchasingdl@rte.ie",
    "legal_type": "body-pl",
    "activity": "rcr",
    "address": {
      "street": "Donnybrook",
      "city": "Dublin",
      "postal_code": "Dublin 4",
      "country": "IRL"
    },
    "website": "https://www.rte.ie",
    "company_id": "IE8T50578M",
    "phone": "012083111"
  },
  "procedure": {
    "title": "RTÉ Consultancy Frameworks",
    "description": "RTÉ, Ireland's national public service media, is seeking to establish frameworks of consultancy firms to assist with general consultancy and a range of strategic projects. These projects will include but are not limited to Corporate Strategy, Finance, Tax (excluding annual Tax and Audit services), Change Management, Business Transformation, and Enterprise Risk Management. The consultancy frameworks will be used to address the challenges and opportunities arising in these areas. Specifically, RTÉ is looking for firms with expertise in:\n\n- **Corporate Business Management Consultancy**: Firms with experience in corporate strategy, financial management, and organizational transformation.\n- **Media Industry Expertise and Media Regulatory Management Consultancy**: Firms with deep understanding of the media industry, regulatory compliance, and strategic planning.\n\nSuitable bidders should have a proven track record in delivering high-quality consultancy services, particularly in the public service broadcasting sector. The estimated cost for the potential duration of the contract should be clearly outlined in the proposal. All responses must include zipped files containing the necessary documentation. RTÉ is committed to impartiality and transparency in its procurement processes, ensuring that the selected consultancy frameworks will support the organization's mission to provide high-quality programming and services to the Irish public.",
    "identifier": "84f3b886-3e8a-4d42-a912-8e2652ae7ffd",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-04-12+00:00",
    "deadline_time": "13:00:00+00:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "79411000",
    "additional_classifications": [
      "79412000",
      "66171000",
      "72221000",
      "79411100",
      "79400000",
      "79410000",
      "79412000",
      "66171000",
      "72221000",
      "79411100",
      "79400000",
      "79410000",
      "79412000",
      "66171000",
      "72221000",
      "79411100",
      "79400000",
      "79410000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "1500000",
    "currency": "",
    "maximum_value": "1500000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-04-12+00:00",
    "open_tender_time": "13:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3230659"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Corporate Business Management Consultancy",
      "description": "RTÉ, Ireland's national public service media, is seeking to establish frameworks of consultancy firms to assist with general consultancy and a range of strategic projects. These projects will include but are not limited to Corporate Strategy, Finance, Tax (excluding annual Tax and Audit services, which is a separate engagement), Change Management, Business Transformation, and Enterprise Risk Management. The consultancy services are required to address the challenges and opportunities arising within RTÉ, a statutory body overseen by a board appointed by the Government of Ireland. The organization operates 25 radio, television, online, and mobile services, including four main TV channels (RTÉ One, RTÉ2, RTÉjr, and RTÉ News), FM radio stations (RTÉ Radio 1, RTÉ 2FM, RTÉ Lyric FM, and RTÉ RnaG), and digital radio services. RTÉ is regulated by Coimisiún na Meán and is financed by the television licence fee and through advertising. The consultancy firms should have expertise in media industry consultancy and media regulatory management to support RTÉ's operations effectively. The estimated cost for the potential duration of the contract should be clearly outlined, and all responses should include zipped files containing relevant documentation.",
      "main_nature": "services",
      "main_classification": "79411000",
      "additional_classifications": [
        "79412000",
        "66171000",
        "72221000",
        "79411100",
        "79400000",
        "79410000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "1000000",
        "currency": "",
        "maximum_value": "1500000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "fa-wo-rc",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    },
    {
      "lot": "LOT-0002",
      "title": "Media Industry Expertise and Media Regulatory Management Consultancy",
      "description": "RTÉ, Ireland's national public service broadcaster, is seeking to establish frameworks of consultancy firms to assist with general consultancy and a range of strategic projects. These projects will include but are not limited to:\n\n- **Corporate Strategy**: Developing and implementing strategic plans to align with RTÉ's mission and goals.\n- **Finance**: Providing financial advisory services to ensure the organization's financial stability and compliance with regulatory requirements.\n- **Tax (Excluding annual Tax and Audit services)**: Offering tax advisory services to optimize RTÉ's tax position and ensure compliance with all relevant tax laws.\n- **Change Management**: Facilitating organizational change by assessing, planning, and implementing changes to improve efficiency and effectiveness.\n- **Business Transformation**: Helping RTÉ to transform its business operations through strategic planning, process improvement, and innovation.\n- **Enterprise Risk Management**: Identifying, assessing, and mitigating risks to ensure the organization's stability and resilience.\n\nRTÉ operates 25 radio, television, online, and mobile services, making it one of the oldest continuously operating public service broadcasters in the world. The organization is headquartered in Dublin and is overseen by a board appointed by the Government of Ireland. RTÉ is regulated by Coimisiún na Meán and is financed by the television licence fee and through advertising.\n\nThe estimated cost for the potential duration of the contract should be clearly outlined in the proposal. Bidders should ensure they attach zipped files containing all necessary documentation when responding to the tender. The consultancy firms should have expertise in the media industry and experience in media regulatory management to effectively address the challenges and opportunities arising in RTÉ's operations.",
      "main_nature": "services",
      "main_classification": "79411000",
      "additional_classifications": [
        "79412000",
        "66171000",
        "72221000",
        "79411100",
        "79400000",
        "79410000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "500000",
        "currency": "",
        "maximum_value": "500000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "fa-wo-rc",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3230659",
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3230659"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/152474-2024/pdf"
}