{
  "notice_publication_id": "156940-2024",
  "buyer": {
    "official_name": "IDA Ireland",
    "email": "procurement.ida@ida.ie",
    "legal_type": "body-pl-cga",
    "activity": "econ-aff",
    "address": {
      "street": "3 Park Place, Hatch Street Upper",
      "city": "Dublin",
      "postal_code": "Dublin 2",
      "country": "IRL"
    },
    "website": "https://www.idaireland.com",
    "company_id": "Not applicable",
    "phone": "+353 1 6034000"
  },
  "procedure": {
    "title": "221161 Public Lighting Upgrade Works at IDA Purcellsinch Business, Co. Kilkenny",
    "description": "**Title: 221161 Public Lighting Upgrade Works at IDA Purcellsinch Business, Co. Kilkenny**\n\n**Description:**\nUpgrade works of the existing public lighting network in IDA Business Park Purcellsinch, Co. Kilkenny. The project includes the replacement of 2No. lighting columns, installation of 1No. new lighting column, replacement of new LED fittings throughout as specified. Additionally, the works involve the removal and disconnection of 3No. existing ESB mini pillars, supply and installation of 2No. new metered pillars, ESB cable chamber, distribution board, and switchgear. The scope also includes labelling of all columns, installation of new cabling and ducting throughout, installation of submains cabling to new mini pillars as specified, earthing as specified, and all works to be tested, certified, and commissioned on completion. All certification and technical documentation must be submitted on completion of the works. The project requires allowance for a traffic management system for the duration of the works, interfacing and liaison with ESB and security personnel, hoist hire for the duration of the works, circuit identification charts at distribution locations, and a survey of grounds before any civil excavations commence.\n\n**Key Requirements:**\n- **Technical Expertise:** Bidders must demonstrate expertise in electrical engineering, particularly in public lighting systems and infrastructure upgrades.\n- **Project Management:** The ability to manage complex projects with multiple stakeholders, including ESB and security personnel, is crucial.\n- **Safety Protocols:** Bidders must ensure compliance with all safety protocols and regulations, including those related to electrical work and site safety.\n- **Quality Assurance:** The bidder must provide a comprehensive quality assurance plan to ensure that all works are tested, certified, and commissioned to the highest standards.\n- **Documentation:** Detailed technical documentation and certification must be submitted upon completion of the project.\n- **Traffic Management:** The bidder must propose a robust traffic management plan to minimize disruptions during the project.\n- **Interfacing with Stakeholders:** Effective communication and liaison with ESB, security personnel, and other stakeholders are essential.\n- **Hoist Hire:** The bidder must arrange for hoist hire if required for the duration of the works.\n- **Circuit Identification:** The bidder must provide circuit identification charts at distribution locations.\n- **Ground Survey:** A thorough ground survey must be conducted before any civil excavations commence.\n\n**Evaluation Criteria:**\n1. **Technical Competence:** The bidder's experience and expertise in similar public lighting upgrade projects.\n2. **Project Management Plan:** The effectiveness of the project management plan in ensuring timely completion and minimal disruptions.\n3. **Safety Record:** The bidder's safety record and compliance with relevant regulations.\n4. **Quality Assurance Plan:** The comprehensiveness of the quality assurance plan and its alignment with industry standards.\n5. **Documentation and Certification:** The thoroughness of the technical documentation and certification process.\n6. **Traffic Management Plan:** The robustness of the traffic management plan proposed.\n7. **Interfacing with Stakeholders:** The effectiveness of the proposed communication and liaison plan with ESB, security personnel, and other stakeholders.\n8. **Hoist Hire Arrangement:** The bidder's plan for hoist hire and its impact on project timelines.\n9. **Circuit Identification Charts:** The clarity and completeness of circuit identification charts proposed.\n10. **Ground Survey Plan:** The thoroughness of the ground survey plan before civil excavations commence.\n\nBy evaluating bidders based on these criteria, IDA Ireland can ensure that the public lighting upgrade works at IDA Purcellsinch Business, Co. Kilkenny, are executed efficiently, safely, and to the highest standards.",
    "identifier": "4c84024a-d887-4c85-8e2a-bfe97b88813a",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-04-18+00:00",
    "deadline_time": "12:00:00+00:00"
  },
  "purpose": {
    "main_nature": "works",
    "main_classification": "45316110",
    "additional_classifications": [],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "235000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "not-allowed",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-04-19+00:00",
    "open_tender_time": "00:00:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3238971"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "221161 Public Lighting Upgrade Works at IDA Purcellsinch Business, Co. Kilkenny",
      "description": "**Title: 221161 Public Lighting Upgrade Works at IDA Purcellsinch Business, Co. Kilkenny**\n\n**Description:**\nUpgrade works of the existing public lighting network in IDA Business Park Purcellsinch, Co. Kilkenny. The scope of works includes:\n- **Replacement of 2No. lighting columns** to ensure modern and efficient illumination.\n- **Installation of 1No. new lighting column** to enhance the overall lighting infrastructure.\n- **Replacement of new LED fittings throughout as specified** to optimize energy efficiency and reduce maintenance needs.\n- **Removal and disconnection of 3No. existing ESB mini pillars** to facilitate the installation of new metered pillars.\n- **Supply and installation of 2No. new metered pillars** to improve the reliability and monitoring of the lighting system.\n- **ESB cable chamber, distribution board, and switchgear installation** to ensure a robust electrical infrastructure.\n- **Labelling of all columns** for easy identification and maintenance.\n- **Installation of new cabling and ducting throughout** to support the upgraded lighting system.\n- **Installation of submains cabling to new mini pillars as specified** for efficient power distribution.\n- **Earthing as specified** to ensure safety and compliance with electrical standards.\n- **All works to be tested, certified, and commissioned on completion** to guarantee the functionality and safety of the upgraded system.\n- **Submission of all certification and technical documentation on completion** for record-keeping and compliance purposes.\n- **Allowance for traffic management system for the duration of the works** to minimize disruptions and ensure public safety.\n- **Interfacing and liaison with ESB and security personnel** to coordinate the upgrade process effectively.\n- **Hoist hire for the duration of the works** to facilitate safe and efficient installation of equipment.\n- **Circuit identification charts at distribution locations** for easy troubleshooting and maintenance.\n- **Survey of grounds before the commencement of any civil excavations** to identify potential hazards and ensure safe execution of the project.\n\nThis tender is issued by IDA Ireland, the Irish Government's inward investment promotion agency, which has been helping companies set up and expand strategic international operations in Ireland for over 70 years. IDA Ireland operates with a global team of over 250 people, providing comprehensive support to companies, including market research, site selection, introductions to industry networks, and guidance on legal and regulatory requirements. The agency is committed to ensuring that companies have all the resources and support they need to successfully expand their operations to Ireland.\n\nIDA Ireland has offices in North America, Europe, Asia-Pacific, Africa, and the Middle East, as well as a network on the ground in Ireland. The agency assigns two client relationship managers to each company: one based in Ireland and one at the overseas location. This personalized support continues long after the investment decision has been made, with ongoing advice on how to enrich the Irish experience through top-level connections and advocacy with key stakeholders.\n\nBy bidding on this tender, you will be contributing to the enhancement of IDA Business Park Purcellsinch, Co. Kilkenny, which is part of Ireland's efforts to attract and support foreign direct investment. Your expertise and commitment will help in creating a safer, more efficient, and sustainable public lighting system that aligns with Ireland's commitment to economic development and environmental sustainability.",
      "main_nature": "works",
      "main_classification": "45316110",
      "additional_classifications": [],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "235000",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "tp-abil",
        "variant_submissions": "",
        "electronic_invoicing": "not-allowed",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3238971"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/156940-2024/pdf"
}