{
  "notice_publication_id": "170319-2024",
  "buyer": {
    "official_name": "Peter McVerry Trust_121127",
    "email": "epena@pmvtrust.ie",
    "legal_type": "body-pl",
    "activity": "health",
    "address": {
      "street": "29 Mountjoy Square E, Mountjoy, Dublin",
      "city": "Dublin",
      "postal_code": "D01 C2N4",
      "country": "IRL"
    },
    "website": "https://pmvtrust.ie",
    "company_id": "98934",
    "phone": "018230776"
  },
  "procedure": {
    "title": "Tender for Peter McVerry Trust CLG Annual Audit 2023 – 2025",
    "description": "**Enhanced Proposal Description:**\n\n**Title:** Tender for Peter McVerry Trust CLG Annual Audit 2023 – 2025\n\n**Description:**\n\nThe Peter McVerry Trust is Ireland's largest provider of Housing First services, dedicated to tackling homelessness, drug misuse, and social disadvantage. Established in 1983 by Fr. Peter McVerry, the charity has been at the forefront of addressing these critical issues, with a focus on providing secure accommodation and intensive support services to vulnerable individuals.\n\nThe successful bidder for this tender will be responsible for conducting a comprehensive annual audit of the Peter McVerry Trust's financial management, processes, and controls. The audit should provide assurance that the organization's financial practices are robust and compliant with recognized audit standards issued by the auditing practices board. Key requirements include:\n\n1. **Full Audit of Financial Books and Accounting Practices:** Conduct a thorough examination of the organization's financial records to ensure compliance with established policies, plans, and procedures. In the absence of such policies, recommend necessary guidelines to improve financial management.\n\n2. **Compliance Assessment:** Evaluate the organization's adherence to established policies, plans, and procedures. Identify any gaps and recommend improvements where necessary.\n\n3. **Preparation of Financial Statements:** Prepare the financial statements in accordance with FRS 102, Charities SORP (FRS102), and the Companies Act 2014.\n\n4. **Review of Financial Statement Disclosures:** Ensure that financial statement disclosures comply with FRS 102, Companies Act 2014, Charities SORP (FRS102), DPER Circular 13/2014, and specific funder requirements.\n\n5. **Review of SLAs and Agreements:** Assess compliance with statutory funders' requirements and ensure full income recovery from SLAs and other agreements.\n\n6. **Compliance with Statutory Procurement and Expenditure Codes:** Review the organization's adherence to statutory procurement and expenditure codes, including DPER requirements.\n\n7. **Governance Code Compliance:** Evaluate the organization's compliance with the CRA governance code and AHBRA codes and guidance as required.\n\n8. **Meetings with Finance, Audit, and Governance Committee:** Present detailed financial statements to the Finance, Audit, and Governance committee and the Board as required.\n\n9. **Going Concern and Sustainability Assessment:** Provide an assessment of the organization's financial health from a going concern and sustainability perspective.\n\nThe ideal bidder should have extensive experience in auditing non-profit organizations, particularly those involved in housing and social services. They should be familiar with Irish charity regulations and have a proven track record in ensuring compliance with relevant standards and codes. The bidder should also demonstrate strong communication skills to effectively present audit findings to the Finance, Audit, and Governance committee and the Board.\n\nBy selecting a suitable auditor, the Peter McVerry Trust aims to maintain transparency and accountability in its financial operations, ensuring that resources are effectively managed to support its mission of reducing homelessness and addressing social disadvantage.",
    "identifier": "6deedc8e-cd5c-4ca5-ae45-6a08a5499863",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-04-15+00:00",
    "deadline_time": "16:00:00+00:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "79200000",
    "additional_classifications": [
      "79210000",
      "79211000",
      "79212500",
      "79210000",
      "79211000",
      "79212500"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "150000",
    "currency": "",
    "maximum_value": "150000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "false",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-04-15+00:00",
    "open_tender_time": "16:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3263168"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Tender for Peter McVerry Trust CLG Annual Audit 2023 – 2025",
      "description": "**Tender for Peter McVerry Trust CLG Annual Audit 2023 – 2025**\n\n**Description:**\nThe Peter McVerry Trust, Ireland's largest provider of Housing First services, is seeking a qualified auditor to conduct the annual audit of their financial statements for the period 2023-2025. The successful bidder will be responsible for ensuring the robustness of the organization's financial management, processes, and controls. Key requirements include:\n\n1. **Full Audit of Financial Statements:** Conduct a comprehensive audit of the Peter McVerry Trust's books and accounting practices, adhering to recognized audit standards issued by the auditing practices board. The audit should provide assurance that the organization's financial management, processes, and controls are robust.\n\n2. **Compliance Assessment:** Assess compliance with established policies, plans, and procedures. In the absence of such policies, recommend necessary policies, plans, and procedures. Additionally, evaluate the reliability of management information and suggest operating improvements where required.\n\n3. **Financial Statement Preparation:** Prepare the financial statements in accordance with FRS 102, Charities SORP (FRS102), and the Companies Act 2014.\n\n4. **Disclosure Review:** Review financial statement disclosures for compliance with FRS 102, Companies Act 2014, Charities SORP (FRS102), DPER Circular 13/2014, and specific funder requirements.\n\n5. **SLA and Agreement Review:** Review Service Level Agreements (SLAs) and other agreements with statutory funders to ensure compliance and full income recovery.\n\n6. **Statutory Compliance Review:** Review compliance with statutory procurement and expenditure codes, including DPER requirements.\n\n7. **Governance Code Compliance:** Assess the organization’s own assessment of compliance with the CRA governance code and AHBRA codes and guidance as required.\n\n8. **Board Presentations:** Meet with the Finance, Audit, and Governance committee and the Board as required, including a detailed presentation of the Financial Statements.\n\n9. **Going Concern and Sustainability Assessment:** Provide the Board with an assessment of the organization from a going concern and sustainability point of view.\n\n**Background:**\nPeter McVerry Trust is a national housing and homeless charity established in 1983 by Fr Peter McVerry to tackle homelessness, drug misuse, and social disadvantage. The organization is committed to reducing homelessness and the harm caused by substance misuse and social disadvantage. Since 2020, it has been responsible for 61% of the Housing First services delivered under the National Housing First Implementation Plan. The charity operates across various locations in Ireland, including Dublin, Kildare, Louth, Limerick, and Galway, providing intensive and specialized support services to vulnerable individuals. \n\n**Key Skills and Experience:**\nThe ideal bidder should possess extensive experience in auditing non-profit organizations, particularly those in the charitable sector. They should be familiar with recognized audit standards, FRS 102, Charities SORP (FRS102), and the Companies Act 2014. The bidder should also have a strong understanding of compliance with statutory procurement and expenditure codes, including DPER requirements. Additionally, they should be able to assess governance compliance with the CRA governance code and AHBRA codes and guidance. Strong communication skills are essential for presenting detailed financial statements to the Board and committees. \n\n**Submission Requirements:**\nBidders should submit their proposals detailing their experience in auditing similar organizations, their understanding of the specific requirements outlined above, and any relevant certifications or qualifications. The proposal should also include a detailed methodology for conducting the audit, timelines for completion, and any additional services they can offer to support the organization's financial management and governance.",
      "main_nature": "services",
      "main_classification": "79200000",
      "additional_classifications": [
        "79210000",
        "79211000",
        "79212500"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "150000",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "sui-act",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "false",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3263168"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/170319-2024/pdf"
}