{
  "notice_publication_id": "214645-2024",
  "buyer": {
    "official_name": "Derreen Sports Company Limited",
    "email": "derreensportsclg@gmail.com",
    "legal_type": "org-sub-la",
    "activity": "rcr",
    "address": {
      "street": "2 Lios na Greine, Lissyvigeen, Killarney, Co Kerry.",
      "city": "Killarney",
      "postal_code": "V93 V8X7",
      "country": "IRL"
    },
    "website": "https://www.derreeensportsclg.com",
    "company_id": "747076",
    "phone": "0873528411"
  },
  "procedure": {
    "title": "Derreen Sports Company Ltd",
    "description": "**Title: Derreen Sports Company Ltd**\n\n**Description:**\nDerreen Sports Company Ltd, a non-profit community organization registered as Derreen Sports CLG, is tendering for the construction of a shell and core sports hall. This project is part of their initiative to develop a comprehensive sports facility in Killarney, Ireland. The tender is specifically seeking a main contractor who will manage all aspects of the construction, excluding the steel frame and cladding. The main contractor will be responsible for overseeing the nominated steel fabricator/erector and cladding specialist to ensure the project's timely and quality completion. The successful bidder will demonstrate expertise in managing complex construction projects, particularly in the context of community-driven initiatives. They should have a proven track record of collaborating with specialized subcontractors and ensuring compliance with local building regulations. The project's location is on council-owned land situated between the Killarney Celtic soccer club and the Legion GAA club in Derreen, Killarney. The successful contractor will contribute to the development of a state-of-the-art sports facility that will benefit the local community.",
    "identifier": "4a29435b-3bd6-433b-a442-5694cdf3f1b9",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-05-23+01:00",
    "deadline_time": "17:00:00+01:00"
  },
  "purpose": {
    "main_nature": "works",
    "main_classification": "45000000",
    "additional_classifications": [],
    "place_of_performance": "anyw-cou"
  },
  "value": {
    "estimated_value": "2000000",
    "currency": "",
    "maximum_value": "2000000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-05-23+01:00",
    "open_tender_time": "17:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3379021"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "true",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": "false"
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Derreen Sports Company Ltd",
      "description": "**Title: Derreen Sports Company Ltd**\n\n**Description:**\nDerreen Sports Company Ltd, a newly established company incorporated on August 21, 2023, and registered as a Company Limited by Guarantee, is tendering for the construction of a shell and core sports hall. This project involves selecting a main contractor to manage the construction of all elements except for the steel frame and cladding. The main contractor will be responsible for overseeing the nominated steel fabricator/erector and cladding specialist. The project is located on council-owned land in Derreen, Killarney, Kerry, Ireland, and is part of a larger development aimed at enhancing sports facilities in the area. The successful bidder will need to demonstrate expertise in managing complex construction projects, ensuring timely completion, and maintaining high standards of quality. The company is committed to supporting local businesses and fostering community development through this initiative.\n\n**Key Requirements:**\n- **Construction Experience:** Proven track record in constructing sports facilities or similar large-scale projects.\n- **Project Management:** Ability to manage multiple subcontractors, including steel fabricators and cladding specialists.\n- **Quality Assurance:** Commitment to maintaining high standards of quality and safety throughout the project.\n- **Timeliness:** Demonstrated ability to complete projects on time and within budget.\n- **Community Engagement:** Willingness to engage with local stakeholders and support community development initiatives.\n- **Financial Stability:** Strong financial standing to ensure the project's completion without delays.\n\n**Additional Information:**\n- The project site is situated between the Killarney Celtic soccer club and the Legion GAA club in Derreen, Killarney.\n- The company is registered at 2 Lios Na Greine, Lissyvigeen, Killarney, Kerry, Ireland.\n- The company has 6 directors who have also been involved in 44 other Irish companies, with 7 of those companies now closed.\n\nBy focusing on these key requirements and additional information, potential bidders can effectively tailor their proposals to meet the needs of Derreen Sports Company Ltd and enhance their chances of securing this significant public tender.",
      "main_nature": "works",
      "main_classification": "45000000",
      "additional_classifications": [],
      "place_of_performance": "anyw-cou",
      "country": "IRL",
      "value": {
        "estimated_value": "2000000",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3379021",
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3379021"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/214645-2024/pdf"
}