{
  "notice_publication_id": "221268-2024",
  "buyer": {
    "official_name": "Coimisiún na Meán",
    "email": "skennedy@bai.ie",
    "legal_type": "body-pl-cga",
    "activity": "gen-pub",
    "address": {
      "street": "2-5  Warrington Place, Dublin, D02 XP29",
      "city": "Dublin",
      "postal_code": "D02 XP29",
      "country": "IRL"
    },
    "website": "https://www.cnam.ie",
    "company_id": "Not applicable",
    "phone": "+3536441200"
  },
  "procedure": {
    "title": "Establishment of a single party framework for the supply, delivery and installation of office furniture for Coimisiún na Meán",
    "description": "**Title: Establishment of a Single Party Framework for the Supply, Delivery, and Installation of Office Furniture for Coimisiún na Meán**\n\n**Description:**\nCoimisiún na Meán, Ireland's newly established media regulator, is seeking to establish a single party framework for the supply, delivery, and installation of office furniture. This framework will cover the temporary premises at One Shelbourne Buildings, Dublin 4, as well as any future premises of Coimisiún na Meán. The furniture is intended for long-term use and must be of good quality and durability. An initial tranche of furniture is required upon award of the contract, with details available in Appendix 1. Further furniture may be required over the course of the contract via call-offs.\n\n**Key Considerations:**\n- **Quality and Durability:** The furniture must be of high quality and durable to meet the long-term needs of Coimisiún na Meán.\n- **Initial Tranche:** An initial set of furniture is required immediately upon contract award, with specific details outlined in Appendix 1.\n- **Future Requirements:** The framework should accommodate potential future needs for additional furniture, allowing for call-offs as necessary.\n- **Regulatory Environment:** Coimisiún na Meán is responsible for developing and regulating a thriving, diverse, creative, safe, and trusted media landscape. Bidders should be aware of the organization's mission and the importance of maintaining a professional and functional workspace.\n- **Location:** The furniture will be installed at One Shelbourne Buildings, Dublin 4, and any future premises of Coimisiún na Meán.\n\nBy establishing this single party framework, Coimisiún na Meán aims to ensure a well-equipped and efficient workspace that supports its mission to promote a safe and diverse online and media landscape.",
    "identifier": "7852abcc-5d79-41d9-abf3-a28cba0a34b8",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-05-17+01:00",
    "deadline_time": "12:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "39130000",
    "additional_classifications": [
      "79934000",
      "39000000",
      "39100000",
      "39153000",
      "79934000",
      "39000000",
      "39100000",
      "39153000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "2000000",
    "currency": "",
    "maximum_value": "2000000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-05-17+01:00",
    "open_tender_time": "12:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3397967"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Establishment of a single party framework for the supply, delivery and installation of office furniture for Coimisiún na Meán",
      "description": "**Title: Establishment of a Single Party Framework for the Supply, Delivery, and Installation of Office Furniture for Coimisiún na Meán**\n\n**Description:**\nCoimisiún na Meán, Ireland's media regulator established under the Online Safety and Media Regulation Act 2022, is seeking to establish a single party framework for the supply, delivery, and installation of office furniture. This framework will cover the temporary premises at One Shelbourne Buildings, Dublin 4, and any future premises of Coimisiún na Meán. The furniture is intended for long-term use and must be of good quality and durability. An initial tranche of furniture is required upon contract award, with details available in Appendix 1. Further furniture may be required over the course of the contract via call-offs.\n\n**Key Considerations:**\n- **Quality and Durability:** The supplied furniture must be of high quality and durable to meet the long-term needs of Coimisiún na Meán.\n- **Temporary and Future Premises:** The framework should accommodate both the temporary and any future premises of Coimisiún na Meán.\n- **Initial Tranche and Call-Offs:** An initial tranche of furniture is required upon contract award, with the possibility of additional furniture being required through call-offs.\n- **Regulatory Environment:** Coimisiún na Meán operates in a regulatory environment focused on developing and maintaining a thriving, diverse, creative, safe, and trusted media landscape. Bidders should be aware of this context and ensure their proposals align with these goals.\n- **Sustainability:** As a public sector organization, Coimisiún na Meán may prioritize sustainable and environmentally friendly solutions for office furniture.\n\n**Eligibility Criteria:**\n- **Experience:** Bidders should have a proven track record in supplying, delivering, and installing high-quality office furniture.\n- **Quality Assurance:** Suppliers must demonstrate a commitment to quality assurance and durability.\n- **Sustainability:** Preference may be given to suppliers who can provide sustainable and environmentally friendly office furniture solutions.\n- **Customer Service:** Bidders should be able to provide excellent customer service, ensuring timely delivery and installation of the furniture.\n\n**Evaluation Criteria:**\n- **Quality of Furniture:** The quality and durability of the proposed furniture.\n- **Experience and Track Record:** The bidder's experience in supplying similar office furniture solutions.\n- **Sustainability and Environmental Impact:** The bidder's ability to provide sustainable and environmentally friendly solutions.\n- **Customer Service and Support:** The bidder's commitment to excellent customer service and support.\n- **Price and Value for Money:** The overall price and value for money offered by the bidder.\n\nBy considering these key aspects, bidders can effectively tailor their proposals to meet the specific needs of Coimisiún na Meán, ensuring a successful partnership in establishing a high-quality office furniture framework.",
      "main_nature": "supplies",
      "main_classification": "39130000",
      "additional_classifications": [
        "79934000",
        "39000000",
        "39100000",
        "39153000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "2000000",
        "currency": "",
        "maximum_value": "2000000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "tp-abil",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "fa-mix",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3397967"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/221268-2024/pdf"
}