{
  "notice_publication_id": "226522-2024",
  "buyer": {
    "official_name": "An Garda Síochána_1192",
    "email": "tenderoffice@garda.ie",
    "legal_type": "body-pl",
    "activity": "pub-os",
    "address": {
      "street": "Finance Department, Garda Headquarters, Phoenix Park, Dublin 8",
      "city": "Dublin",
      "postal_code": "D08 HN3X",
      "country": "IRL"
    },
    "website": "https://www.garda.ie/en/",
    "company_id": "0000",
    "phone": "01-6662173"
  },
  "procedure": {
    "title": "Tenders for the provision of Dell Enterprise Hardware for An Garda Síochána",
    "description": "**Title: Tenders for the Provision of Dell Enterprise Hardware for An Garda Síochána**\n\n**Description:**\nAn Garda Síochána, Ireland's national police service, is seeking bidders for the provision of Dell Enterprise Hardware to enhance its computational and data storage resources. The contract involves the integration of OEM components into the existing Dell VxBlock Environment. The successful bidder will be responsible for delivering high-performance, reliable, and secure hardware solutions to support the operational needs of An Garda Síochána.\n\n**Key Requirements:**\n1. **Enterprise Solutions:** The bidder must provide comprehensive enterprise solutions that include computational and data storage resources.\n2. **Integration:** All components must be integrated seamlessly into the existing Dell VxBlock Environment.\n3. **OEM Components:** Only original equipment manufacturer (OEM) components will be eligible for this tender.\n4. **Confidential Information:** The Contracting Authority reserves the right to double the quantities outlined in the specification over the life of the contract to meet ongoing demands. Details of Appendix 1 are considered confidential and will only be accessible to tenderers who agree to the terms of the Tender Confidentiality Undertaking (Attachment 1).\n\n**Evaluation Criteria:**\n- **Technical Capability:** The bidder's ability to provide high-performance, reliable, and secure hardware solutions.\n- **Integration Expertise:** The bidder's experience in integrating OEM components into existing Dell VxBlock Environments.\n- **Security Compliance:** The bidder's adherence to stringent security standards required by An Garda Síochána.\n- **Cost Efficiency:** The overall cost of the proposed solution, including any potential for future upgrades or expansions.\n- **Customer Support:** The level of customer support and maintenance services offered by the bidder.\n\n**Submission Requirements:**\nTenderers must submit their proposals in accordance with the specified format and guidelines. The proposal should include detailed technical specifications, a comprehensive project plan, and any additional documentation required by the Contracting Authority. Tenderers must also agree to the terms of the Tender Confidentiality Undertaking (Attachment 1) to access confidential information.\n\n**Timeline:**\nThe tender process will follow a structured timeline, including a period for submission of proposals, evaluation, and negotiation. The exact timeline will be provided in the tender documents.\n\nBy responding to this tender, bidders will contribute to enhancing the operational efficiency and security of An Garda Síochána's IT infrastructure, supporting the organization's mission to maintain public safety and order in Ireland.",
    "identifier": "1d022219-209e-4ad0-901f-d86b8492bacc",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-05-10+01:00",
    "deadline_time": "15:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "30230000",
    "additional_classifications": [
      "30200000",
      "30000000",
      "30200000",
      "30000000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "20000000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-05-10+01:00",
    "open_tender_time": "15:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3265433"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "180",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Tenders for the provision of Dell Enterprise Hardware for An Garda Síochána",
      "description": "**Title: Tenders for the Provision of Dell Enterprise Hardware for An Garda Síochána**\n\n**Description:**\n\nAn Garda Síochána, the national police service of Ireland, is seeking bidders for the provision of Dell Enterprise Hardware to enhance its computational and data storage resources. The contract involves the integration of all components into the existing Dell VxBlock Environment, ensuring seamless operation with the current system. Only Original Equipment Manufacturer (OEM) components will be eligible for this tender.\n\nThe scope of the project includes:\n\n1. **Enterprise Solutions:**\n   - Provision of computational resources to support An Garda Síochána's operations.\n   - Enhancement of data storage capabilities to ensure efficient management and security of sensitive information.\n\n2. **Dell VxBlock Environment:**\n   - Integration of all hardware components into the existing VxBlock Environment to maintain system integrity and performance.\n   - Utilization of Dell's advanced technology to optimize resource allocation and data processing.\n\n3. **Ongoing Demands:**\n   - The Contracting Authority reserves the right to double the quantities outlined in the specification over the life of the contract to meet ongoing demands and future needs.\n\n4. **Confidential Information:**\n   - The details of Appendix 1 are considered confidential and will only be accessible to tenderers who agree to the terms of the Tender Confidentiality Undertaking (Attachment 1).\n\n**Key Requirements:**\n\n- **Eligibility:** Only OEM components from Dell are eligible for this tender.\n- **Integration:** All components must be integrated into the existing Dell VxBlock Environment.\n- **Performance:** The system must maintain high performance and reliability standards.\n- **Security:** The data storage solutions must ensure the security and integrity of sensitive information.\n\n**Evaluation Criteria:**\n\n- **Technical Competence:** The bidder's ability to provide suitable enterprise solutions and integrate them seamlessly into the existing system.\n- **Quality of Components:** The quality and reliability of the OEM components provided by Dell.\n- **Cost Effectiveness:** The overall cost of the solution, including any potential future upgrades or additional requirements.\n- **Service and Support:** The level of service and support provided by the bidder, including warranty and maintenance options.\n\n**Submission Requirements:**\n\n- **Tender Documents:** Bidders must submit their proposals in accordance with the tender documents provided.\n- **Confidentiality Undertaking:** Bidders must agree to the terms of the Tender Confidentiality Undertaking (Attachment 1) to access confidential information.\n- **Proposal Format:** Proposals should include detailed technical specifications, cost breakdowns, and service and support details.\n\nBy responding to this tender, bidders will be contributing to the enhancement of An Garda Síochána's technological infrastructure, ensuring the continued efficiency and effectiveness of their operations.",
      "main_nature": "supplies",
      "main_classification": "30230000",
      "additional_classifications": [
        "30200000",
        "30000000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "20000000",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3265433"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/226522-2024/pdf"
}