{
  "notice_publication_id": "233588-2024",
  "buyer": {
    "official_name": "Tipperary County Council",
    "email": "secretary@tipperarycoco.ie",
    "legal_type": "la",
    "activity": "gen-pub",
    "address": {
      "street": "Civic Offices Clonmel,  Civic Offices Nenagh",
      "city": "Clonmel, Nenagh",
      "postal_code": "E91N512 E45A099",
      "country": "IRL"
    },
    "website": "https://www.tipperarycoco.ie",
    "company_id": "32452",
    "phone": "+353 818065000"
  },
  "procedure": {
    "title": "Ballaghveny landfill sale of void space 2024",
    "description": "**Title:** Ballaghveny Landfill Sale of Void Space 2024\n\n**Description:**\nTipperary County Council’s (TCC) Environment and Climate Action Section, under its waste management function, is issuing a public tender for the pre-purchase of empty space at Ballaghveny landfill. This competitive process aims to establish a multi-operator framework agreement for the disposal of non-hazardous waste, including municipal and commercial waste (MSW), construction and demolition (CnD) waste, and other similar types.\n\n**Key Details:**\n- **Available Space:** Up to 49,000 tonnes per annum (t/a) of available space will be made available to the market.\n- **Unit Size:** The available space will be sold in units of a minimum of 500t per unit per annum.\n- **Pre-Payment:** Units must be pre-paid prior to the acceptance of waste into the landfill.\n- **Payment Terms:** The concessionaire will be required to pay in advance for all units purchased, irrespective of the tonnage of waste that is accepted at the landfill.\n- **Framework Agreement:** The acceptance onto the framework and the pre-purchase of some or all of the concession will not automatically guarantee the acceptance by TCC of waste into the landfill.\n- **Annual Tonnage:** It is TCC's intent to accept the full annual tonnage authorized under its licence in each calendar year until the landfill is full.\n- **Comprehensive Details:** Comprehensive details of requirements will be provided at Stage 2 of the process.\n\n**Eligibility:**\nThis tender is open to interested economic operators within the waste and construction sectors. The successful bidder(s) will be required to operate under licence W0078-03 from the Environmental Protection Agency (EPA), which allows for the acceptance of up to 49,000 tonnes per annum of non-hazardous waste.\n\n**Objective:**\nThe objective is to engage in a competitive process for the establishment of a multi-operator framework agreement that will enable TCC to manage and fill the available space within the landfill as quickly as possible.",
    "identifier": "d6953c0b-8c17-4609-805c-1b8a0ea485b0",
    "type": "",
    "accelerated": "",
    "deadline_date": "2024-05-20+01:00",
    "deadline_time": "14:00:00+01:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "90522200",
    "additional_classifications": [
      "90522000",
      "90732200",
      "90500000",
      "90510000",
      "90513000",
      "90513100",
      "90513200",
      "14200000",
      "45112200",
      "45112210",
      "45112340",
      "90522000",
      "90732200",
      "90500000",
      "90510000",
      "90513000",
      "90513100",
      "90513200",
      "14200000",
      "45112200",
      "45112210",
      "45112340"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "9800000",
    "currency": "",
    "maximum_value": ""
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "",
    "electronic_ordering": "",
    "electronic_payment": ""
  },
  "tendering_process": {
    "procedure_code": "",
    "submission_method": "required",
    "government_agreement_constraint": "false",
    "open_tender_date": "",
    "open_tender_time": "",
    "open_tender_location": ""
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Ballaghveny landfill sale of void space 2024",
      "description": "**Enhanced Proposal Description:**\n\nTipperary County Council’s (TCC) Environment and Climate Action Section, under its waste management function within the county, is issuing this call to interested economic operators within the waste and construction sectors for competition to pre-purchase empty space for their disposal of waste(s) at Ballaghveny landfill, on a ‘pay-and-put’ basis. TCC, as the Contracting Authority, proposes to engage in a competitive process for the establishment of a multi-operator framework agreement. This framework agreement will establish overall terms and conditions under which individual contracts may or not be awarded.\n\nThe landfill operates under licence W0078-03 from the Environmental Protection Agency (EPA), allowing for the acceptance of up to 49,000 tonnes per annum (t/a) of non-hazardous waste, including municipal and commercial waste (MSW), construction and demolition (CnD) waste, and other suitable materials. Up to 49,000t/a of available space will be made available to the market for waste disposal.\n\nThis competition will sell available space (i.e., tonnage) in units, with each unit being a minimum of 500t per annum. The units must be pre-paid prior to the acceptance of waste into the landfill. The concessionaire will be required to pay in advance for all units purchased, irrespective of the tonnage of waste that is accepted at the landfill, including any rejected waste.\n\nIt is important to note that acceptance onto the framework and pre-purchase of some or all of the concession does not automatically guarantee the acceptance by TCC of waste into the landfill. However, it is TCC's intent to accept the full annual tonnage authorized under its licence in each calendar year until the landfill is full, aiming to fill the available space within the landfill as quickly as possible.\n\nComprehensive details of requirements will be provided at Stage 2 of the process. Suitable bidders should have experience in waste management, particularly in handling non-hazardous waste types such as municipal and commercial waste, construction and demolition waste, and other materials specified in the licence. They should also have a proven track record in managing landfill operations and adhering to environmental regulations.\n\nBidders should be prepared to provide detailed financial information, operational plans, and environmental impact assessments as part of their submission. The ability to pre-purchase and manage large quantities of waste space efficiently, while ensuring compliance with environmental regulations, is crucial for this tender. \n\nBy engaging in this competitive process, TCC aims to establish a robust and efficient waste management system that aligns with its environmental goals and ensures sustainable landfill operations.",
      "main_nature": "services",
      "main_classification": "90522200",
      "additional_classifications": [
        "90522000",
        "90732200",
        "90500000",
        "90510000",
        "90513000",
        "90513100",
        "90513200",
        "14200000",
        "45112200",
        "45112210",
        "45112340"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "",
        "currency": "",
        "maximum_value": ""
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "tp-abil",
        "variant_submissions": "",
        "electronic_invoicing": "",
        "electronic_ordering": "",
        "electronic_payment": ""
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "",
        "dps_usage": "",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3414560"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/233588-2024/pdf"
}