{
  "notice_publication_id": "238720-2024",
  "buyer": {
    "official_name": "Met Eireann",
    "email": "shay.greene@met.ie",
    "legal_type": "body-pl",
    "activity": "gen-pub",
    "address": {
      "street": "Met Éireann Meteorological Centre, 65/67 Glasnevin Hill",
      "city": "Dublin 9",
      "postal_code": "D09 Y921",
      "country": "IRL"
    },
    "website": "https://www.met.ie",
    "company_id": "0000",
    "phone": "+353 1 806 4200"
  },
  "procedure": {
    "title": "Request for Tenders for the provision of the hosting, maintenance, management, development and 24/7/365 support of Met Éireann's Web Services.",
    "description": "**Title: Request for Tenders for the Provision of Hosting, Maintenance, Management, Development, and 24/7/365 Support of Met Éireann's Web Services**\n\n**Description:**\nMet Éireann, the Irish National Meteorological Service, is seeking a reliable and efficient provider to manage the hosting, maintenance, management, development, and 24/7/365 support of its web services. The successful bidder will be responsible for ensuring the continuous availability and reliability of Met Éireann's digital systems, which are critical for providing accurate and timely weather information to the public.\n\n**Key Requirements:**\n1. **Hosting and Maintenance of Digital System:**\n   - Ensure the stability and performance of Met Éireann's digital infrastructure.\n   - Implement robust backup and disaster recovery procedures to minimize downtime.\n\n2. **Provision, Maintenance, and Management of Cloud-Based Servers:**\n   - Provide a suite of cloud-based servers with varying specifications to serve products to the digital system.\n   - Ensure high availability and resilience of the data transfer facility.\n\n3. **Continued Use of Existing WordPress Content Management System (CMS) Platform:**\n   - Maintain and update the existing WordPress CMS platform to ensure seamless functionality.\n   - Integrate with the existing Freshdesk account for customer service emails.\n\n4. **Domain Registration and DNS Management:**\n   - Manage domain registrations and DNS settings for the web-based system.\n   - Ensure smooth domain name resolution and minimal downtime.\n\n5. **Backup and Disaster Recovery Management:**\n   - Develop and implement comprehensive backup strategies to ensure data integrity.\n   - Establish robust disaster recovery procedures to quickly restore services in case of an outage.\n\n6. **Test Environment and Development App:**\n   - Set up a test environment for met.ie to facilitate testing and quality assurance.\n   - Develop a development app on iOS and Android platforms for mobile accessibility.\n\n7. **Data Transfer Facility:**\n   - Provide a highly available and resilient data transfer facility.\n   - Integrate associated monitoring tools to ensure real-time monitoring and performance optimization.\n\n8. **Integration with Weather Warning System:**\n   - Ensure seamless integration with Met Éireann's Weather Warning System.\n   - Facilitate the migration of Met Éireann’s web services to the new infrastructure.\n\n9. **Technical Support:**\n   - Provide technical support for all services, including out-of-hours support.\n   - Ensure response times are met on a 24/7/365 basis to maintain service continuity.\n\n10. **Website/App Design and Development:**\n    - Design and develop the website and mobile app based on a prioritized roadmap.\n    - Provide proactive suggestions for new and improved user experiences of web products and services.\n\n**Evaluation Criteria:**\n- Technical capability to manage complex web services.\n- Experience in hosting and maintaining large-scale digital systems.\n- Proven track record in providing 24/7/365 support.\n- Ability to integrate with existing systems seamlessly.\n- Robust backup and disaster recovery strategies.\n- High availability and resilience of data transfer facilities.\n- Expertise in WordPress CMS and Freshdesk integration.\n- Domain registration and DNS management expertise.\n- Mobile app development capabilities.\n- Ability to provide proactive suggestions for improving user experience.\n\nBy selecting a bidder who meets these criteria, Met Éireann aims to ensure the continued reliability and efficiency of its web services, thereby maintaining its position as the leading provider of weather information and related services for Ireland.",
    "identifier": "1b9ec4e6-2547-4dee-b783-e24de3f24ea7",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-05-10+01:00",
    "deadline_time": "17:00:00+01:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "72000000",
    "additional_classifications": [
      "72200000",
      "72200000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "1000000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-05-10+01:00",
    "open_tender_time": "17:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3125026"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Request for Tenders for the provision of the hosting, maintenance, management, development and 24/7/365 support of Met Éireann's Web Services.",
      "description": "In summary, the Services comprise: the hosting, maintenance, management, development and 24/7/365 support of Met Éireann’s Web Services. The solution provided must satisfy all the requirements described in the Tender documents including: hosting and maintenance of Met Éireann’s Digital System; provision, maintenance and management of a suite of cloud-based servers of varying specification to serve products to our Digital System; continued use of the existing WordPress™ Content Management System platform and the existing Met Éireann Freshdesk™ account for customer service emails; domain registration and DNS management for the web based system; backup and disaster recovery management; a test environment for met.ie, and a development app on iOS and Android; a data transfer facility which should be highly-available, resilient and provision of associated monitoring tools; integration with the Weather Warning System and migration of Met Éireann’s Web Services; technical support for all of the above services, with provision for out of hours technical support and response times on a 24/7/365 basis; website/app design and development during the Contract Term based on prioritized roadmap items with proactive suggestions for new and improved user experience of our web products and services.",
      "main_nature": "services",
      "main_classification": "72000000",
      "additional_classifications": [
        "72200000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "1000000",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3125026"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/238720-2024/pdf"
}