{
  "notice_publication_id": "257280-2024",
  "buyer": {
    "official_name": "Louth and Meath Education and Training Board 1384",
    "email": "fsmith@lmetb.ie",
    "legal_type": "body-pl-cga",
    "activity": "education",
    "address": {
      "street": "Abbey Road",
      "city": "Navan",
      "postal_code": "C15 N6 7E",
      "country": "IRL"
    },
    "website": "https://www.lmetb.ie",
    "company_id": "3185062NH",
    "phone": "+353 46 9068200"
  },
  "procedure": {
    "title": "Establishment of Single Party Framework Agreement for the supply of Van to AMTCE",
    "description": "**Title:** Establishment of Single Party Framework Agreement for the Supply of Van to AMTCE\n\n**Description:**\nThe Louth Meath Education and Training Board (LMETB) proposes to engage in a competitive process for the establishment of a single party framework agreement for the supply of 1 x Mercedes Benz Sprinter Van 519 LWB or equivalent. The Advanced Manufacturing Training Centre of Excellence (AMTCE), which is part of LMETB, will use the van to transport state-of-the-art equipment from their premises in Dundalk to national shows and exhibitions. This agreement is crucial for the centre's operations, as it supports the transition of Irish companies to industry 4.0 based operations by providing training on cutting-edge equipment and processes.\n\nTenderers must confirm that all prices quoted in their Tender response will remain valid for 3 months commencing from the effective date of contract. Following expiry of this period, LMETB will draw down from the framework on a request for quote basis on market values at the time of order. The successful bidder will be expected to provide a reliable and efficient transportation solution that meets the specific needs of the AMTCE, ensuring timely delivery of equipment to various national events.\n\n**Key Considerations:**\n- **Reliability:** The van must be in excellent condition and capable of transporting heavy equipment safely.\n- **Efficiency:** The transportation process should be streamlined to minimize downtime and ensure continuous operation of the AMTCE.\n- **Cost Stability:** Prices quoted must remain stable for 3 months, with flexibility to adjust based on market values after this period.\n- **Customer Service:** The bidder should demonstrate a commitment to customer service, ensuring prompt responses and reliable communication.\n- **Industry Expertise:** The bidder should have experience in supplying vehicles to similar industries or educational institutions, highlighting their understanding of the specific requirements of the AMTCE.\n\nBy engaging a reliable and efficient supplier, LMETB aims to support the continued excellence and innovation in the education and training of young people and adults in the Louth and Meath region.",
    "identifier": "fe9b763a-3f1f-47e7-a9d7-c80ca807dffd",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-05-17+01:00",
    "deadline_time": "12:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "34113000",
    "additional_classifications": [
      "34113200",
      "34100000",
      "34130000",
      "34113200",
      "34100000",
      "34130000"
    ],
    "place_of_performance": "anyw-cou"
  },
  "value": {
    "estimated_value": "220000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-05-17+01:00",
    "open_tender_time": "12:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3484898"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Establishment of Single Party Framework Agreement for the supply of Van to AMTCE",
      "description": "**Title: Establishment of Single Party Framework Agreement for the Supply of Van to AMTCE**\n\n**Description:**\nThe Louth Meath Education and Training Board (LMETB) proposes to engage in a competitive process for the establishment of a single party framework agreement for the supply of 1 x Mercedes Benz Sprinter Van 519 LWB or equivalent. The Advanced Manufacturing Training Centre of Excellence (AMTCE), which is part of LMETB, will use the van to move state-of-the-art equipment from their premises in Dundalk to national shows and exhibitions. This agreement is crucial for the centre's operations, as it supports the transition of Irish companies to industry 4.0 based operations by providing dynamic training courses tuned to industry needs, delivered by leading industry training practitioners.\n\nTenderers must confirm that all prices quoted in their Tender response will remain valid for 3 months commencing from the effective date of contract. Following the expiry of this period, LMETB will draw down from the framework on a request for quote basis on market values at the time of order. LMETB is committed to excellence and innovation in education and training, serving over 30,000 students and learners annually across Louth and Meath. The successful bidder will be expected to provide reliable, high-quality vehicles that meet the specific needs of the AMTCE, ensuring seamless logistics support for their training activities.\n\n**Key Requirements:**\n- **Vehicle Specifications:** Mercedes Benz Sprinter Van 519 LWB or equivalent.\n- **Usage:** Moving equipment from Dundalk premises to national shows and exhibitions.\n- **Price Validity:** Prices must remain valid for 3 months from the effective date of contract.\n- **Post-Contract Pricing:** Drawn down on a request for quote basis on market values at the time of order.\n- **Reliability and Quality:** High-quality vehicles that meet the specific needs of the AMTCE.\n- **Industry Experience:** Proven experience in supplying vehicles for similar logistical requirements.\n\nBy engaging with LMETB, bidders will be contributing to the advancement of Ireland's education and training sector, particularly in the field of advanced manufacturing and industry 4.0. The successful bidder will be part of a significant initiative aimed at enhancing Ireland's industrial capabilities through cutting-edge training programs.",
      "main_nature": "supplies",
      "main_classification": "34113000",
      "additional_classifications": [
        "34113200",
        "34100000",
        "34130000"
      ],
      "place_of_performance": "anyw-cou",
      "country": "IRL",
      "value": {
        "estimated_value": "220000",
        "currency": "",
        "maximum_value": "220000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "fa-wo-rc",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3484898"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/257280-2024/pdf"
}