{
  "notice_publication_id": "263128-2024",
  "buyer": {
    "official_name": "Mater Misericordiae University Hospital Ltd",
    "email": "spriest@mater.ie",
    "legal_type": "body-pl",
    "activity": "health",
    "address": {
      "street": "Eccles Street",
      "city": "Dublin",
      "postal_code": "D07 R2WY",
      "country": "IRL"
    },
    "website": "http://www.mater.ie",
    "company_id": "123",
    "phone": "018034078"
  },
  "procedure": {
    "title": "Request for Tenders for the Supply of an automated autoimmunity and automated allergy immunoassay analytical systems to the Mater Misericordiae University Hospital",
    "description": "**Title: Request for Tenders for the Supply of Automated Autoimmunity and Automated Allergy Immunoassay Analytical Systems to the Mater Misericordiae University Hospital**\n\n**Description:**\nThe Mater Misericordiae University Hospital (MMUH), a major teaching hospital based at Eccles Street, Phibsborough, Dublin, Ireland, is seeking a reliable and technologically advanced supplier to provide, install, maintain, and support Automated Autoimmunity and Automated Allergy Immunoassay analytical systems. The hospital, which is managed by Ireland East Hospital Group and serves as a national center for various medical services, requires these systems to enhance its diagnostic capabilities and improve patient care.\n\n**Key Requirements:**\n1. **Supply:** The bidder must provide the specified Automated Autoimmunity and Automated Allergy Immunoassay analytical systems, ensuring they meet the highest standards of medical technology and accuracy.\n2. **Installation:** The bidder must ensure seamless installation of the systems, ensuring minimal disruption to ongoing medical operations.\n3. **Maintenance:** The bidder must provide comprehensive maintenance services, including regular software updates, hardware checks, and troubleshooting to ensure the systems remain operational at all times.\n4. **Support:** The bidder must offer dedicated technical support to the hospital's staff, providing training and assistance as needed to maximize the use of the systems.\n5. **Reagents and Consumables:** The bidder must supply all necessary reagents and consumables required for the operation of the immunoassay systems, ensuring continuous diagnostic capabilities.\n\n**Additional Considerations:**\n- **Clinical Integration:** The bidder should demonstrate how their systems can be integrated into the hospital's existing clinical workflows, ensuring smooth operation and minimal disruption.\n- **Quality Assurance:** The bidder must provide documentation of quality assurance processes, including certification from relevant regulatory bodies.\n- **Customer Support:** The bidder should outline their customer support policies, including response times and availability of technical support staff.\n- **Training and Education:** The bidder should detail their training programs for hospital staff, ensuring that users are fully equipped to operate the systems effectively.\n- **Data Security:** The bidder must ensure that the systems comply with all relevant data security standards, protecting patient data and maintaining confidentiality.\n\n**Evaluation Criteria:**\nThe tender will be evaluated based on the following criteria:\n1. Technical Competence\n2. Quality of Systems\n3. Maintenance and Support Services\n4. Pricing\n5. Customer Support and Training\n6. Data Security Measures\n7. Previous Experience in Similar Projects\n\nBy selecting a bidder who meets these criteria, the Mater Misericordiae University Hospital aims to enhance its diagnostic capabilities, improve patient care, and maintain its position as a leading teaching hospital in Ireland.",
    "identifier": "3d50a29b-510a-47bb-afca-2560a4bd0843",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-06-07+01:00",
    "deadline_time": "12:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "33696500",
    "additional_classifications": [
      "51430000",
      "71900000",
      "38000000",
      "51430000",
      "71900000",
      "38000000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "1856950",
    "currency": "",
    "maximum_value": "1856950"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-06-10+01:00",
    "open_tender_time": "00:00:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3509643"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Request for Tenders for the Supply of an automated autoimmunity and automated allergy immunoassay analytical systems to the Mater Misericordiae University Hospital",
      "description": "**Request for Tenders for the Supply of Automated Autoimmunity and Automated Allergy Immunoassay Analytical Systems to the Mater Misericordiae University Hospital**\n\nThe Mater Misericordiae University Hospital (MMUH) is a leading healthcare institution in Dublin, Ireland, renowned for its commitment to delivering world-class patient care. As a tertiary referral hospital, MMUH provides comprehensive medical services, including emergency care, specialized diagnostics, and advanced treatments. The hospital is equipped with state-of-the-art facilities and operates under the highest standards of clinical excellence.\n\nMMUH is currently seeking a reliable and experienced supplier to provide the following services:\n\n1. **Supply**: The successful bidder must supply high-quality Automated Autoimmunity and Automated Allergy immunoassay analytical systems. These systems should be capable of performing accurate and efficient tests, ensuring timely diagnosis and treatment for patients.\n\n2. **Installation**: The bidder must ensure the smooth installation of the supplied systems, ensuring minimal disruption to ongoing hospital operations. The installation process should be carried out by experienced technicians who are familiar with the specific requirements of a tertiary care hospital.\n\n3. **Maintenance**: The bidder is expected to provide comprehensive maintenance services for the supplied systems. This includes regular software updates, hardware maintenance, and troubleshooting to ensure the systems remain operational at all times.\n\n4. **Support**: The bidder must offer dedicated support services to the hospital's staff, including training, technical assistance, and ongoing support to ensure that the systems are utilized to their full potential.\n\n5. **Reagents and Consumables**: The bidder must provide a continuous supply of reagents and consumables necessary for the operation of the Automated Autoimmunity and Automated Allergy immunoassay systems. These supplies should be of high quality and meet the stringent standards required for diagnostic accuracy.\n\nThe Mater Misericordiae University Hospital is committed to providing the best possible care to its patients. The successful bidder will be expected to demonstrate a strong track record of delivering reliable, efficient, and high-quality diagnostic solutions. The hospital values transparency, professionalism, and excellent customer service, and the bidder should reflect these values in their proposal.\n\n**Key Evaluation Criteria:**\n- **Technical Competence**: The bidder's ability to supply systems that meet the specified requirements and standards.\n- **Installation and Maintenance**: The bidder's experience in installing and maintaining similar systems in healthcare settings.\n- **Support Services**: The quality and comprehensiveness of the support services offered, including training and technical assistance.\n- **Reagent and Consumable Quality**: The quality and reliability of the reagents and consumables provided.\n- **Cost and Value for Money**: The overall cost of the proposal, including any additional services or support, in relation to the value provided.\n\nThe Mater Misericordiae University Hospital is eager to collaborate with a reliable and experienced bidder who can deliver high-quality Automated Autoimmunity and Automated Allergy immunoassay analytical systems. The successful bidder will be expected to provide a comprehensive proposal that addresses all the above criteria and demonstrates a clear understanding of the hospital's needs and expectations.",
      "main_nature": "supplies",
      "main_classification": "33696500",
      "additional_classifications": [
        "51430000",
        "71900000",
        "38000000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "1856950",
        "currency": "",
        "maximum_value": "1856950"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3509643"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/263128-2024/pdf"
}