{
  "notice_publication_id": "272869-2024",
  "buyer": {
    "official_name": "HEAnet CLG",
    "email": "tenders@heanet.ie",
    "legal_type": "body-pl",
    "activity": "education",
    "address": {
      "street": "3rd Floor, North Dock 2, 93/94 North Wall Quay,",
      "city": "Dublin",
      "postal_code": "D01V8Y6",
      "country": "IRL"
    },
    "website": "https://www.heanet.ie",
    "company_id": "275301",
    "phone": "016609040"
  },
  "procedure": {
    "title": "Cybersecurity eLearning Platform, Support and Associated Services",
    "description": "**Title: Cybersecurity eLearning Platform, Support and Associated Services**\n\n**Description:**\nThe Services comprise of the provision of Cybersecurity eLearning with HEAnet CLG as the Managed Service Provider (MSP). The purpose of this framework agreement is to allow HEAnet CLG ICT Security Services to purchase Cybersecurity eLearning as an MSP to distribute amongst staff of multiple educational institutions around Ireland. HEAnet ICT Security Services require the ability to upload their own in-house generated content to the Learning Management System (LMS) to distribute in the same manner as eLearning that is provided by the tender. Cloud/Managed hosted solutions are sought. The framework should support seamless integration with existing educational networks, ensuring high availability and robust security measures. It is intended to be a single supplier framework.\n\n**Key Requirements:**\n1. **Cybersecurity eLearning Content:** The platform must offer comprehensive and up-to-date cybersecurity training modules tailored for educational staff.\n2. **Custom Content Upload:** The ability to upload in-house generated content to the LMS is crucial, ensuring that specific institutional needs can be met.\n3. **Cloud/Managed Hosted Solutions:** The solution should be cloud-based or managed hosted to ensure scalability, reliability, and ease of maintenance.\n4. **Integration with Educational Networks:** Seamless integration with HEAnet’s national education network is essential, ensuring high-speed connectivity and robust security.\n5. **User Management:** The platform should provide robust user management features to manage access and permissions for multiple educational institutions.\n6. **Reporting and Analytics:** Detailed reporting and analytics tools are required to monitor user engagement, course completion rates, and other relevant metrics.\n7. **Compliance and Security:** The solution must adhere to stringent security standards and comply with relevant data protection regulations, such as GDPR.\n\n**Additional Considerations:**\n- **Scalability:** The platform should be scalable to accommodate the needs of multiple educational institutions.\n- **User Experience:** The platform should offer an intuitive user interface, ensuring that staff can easily access and complete cybersecurity training modules.\n- **Support and Maintenance:** The supplier should provide comprehensive support and maintenance services, including regular updates and technical assistance.\n\n**Evaluation Criteria:**\n- **Technical Capabilities:** The ability of the platform to meet the technical requirements outlined above.\n- **Security Measures:** The robustness of the security measures in place to protect user data and ensure compliance with data protection regulations.\n- **User Experience:** The ease of use and intuitive design of the platform.\n- **Scalability:** The ability of the platform to scale to meet the needs of multiple educational institutions.\n- **Support and Maintenance:** The quality of support and maintenance services provided by the supplier.\n\n**Submission Requirements:**\nPlease submit your proposal in accordance with the guidelines provided in the CfT Documents area. The proposal should include detailed information on how your solution meets the requirements outlined above, along with any additional information you believe is relevant to your bid. There are 12 tender documents available in the CfT Documents area for your reference.\n\nBy selecting a suitable bidder, HEAnet aims to enhance the cybersecurity awareness and skills of educational staff across Ireland, thereby contributing to a safer and more secure educational environment.",
    "identifier": "e766341c-bb37-42ae-920a-2e8720075aca",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-06-06+01:00",
    "deadline_time": "16:00:00+01:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "72000000",
    "additional_classifications": [
      "48000000",
      "48000000"
    ],
    "place_of_performance": "anyw-cou"
  },
  "value": {
    "estimated_value": "450000",
    "currency": "",
    "maximum_value": "450000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "not-allowed",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-06-06+01:00",
    "open_tender_time": "16:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3305389"
  },
  "tendering_terms": {
    "variant_constraint": "not-allowed",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Cybersecurity eLearning Platform, Support and Associated Services",
      "description": "**Title: Cybersecurity eLearning Platform, Support and Associated Services**\n\n**Description:**\n\nHEAnet CLG, Ireland's National Research and Education Network, is seeking a Cybersecurity eLearning Platform and associated services to enhance the digital security awareness of its staff and the broader educational community in Ireland. As the Managed Service Provider (MSP), HEAnet CLG requires a robust and scalable solution that can accommodate the diverse needs of multiple educational institutions.\n\nThe services should include the provision of a comprehensive Cybersecurity eLearning platform that allows for the upload and distribution of in-house generated content, as well as pre-existing eLearning materials. The platform must be cloud/managed hosted to ensure high availability, scalability, and robust security measures.\n\nKey requirements include:\n\n- **Customization:** The ability to upload and distribute in-house generated content seamlessly alongside pre-existing eLearning materials.\n- **Scalability:** The platform should be able to accommodate the needs of over one million users, including students, researchers, and staff across various educational institutions.\n- **Security:** High-level security measures to protect sensitive information and ensure compliance with stringent data protection regulations.\n- **User Experience:** An intuitive interface that facilitates easy navigation and engagement for users of varying technical proficiency.\n- **Integration:** Compatibility with existing Learning Management Systems (LMS) to ensure smooth integration and minimal disruption to current workflows.\n- **Support:** Comprehensive support services, including training, technical assistance, and ongoing maintenance to ensure the platform remains up-to-date and effective.\n\nThis framework agreement aims to establish a single supplier relationship to ensure consistency and efficiency in the delivery of Cybersecurity eLearning services. The selected bidder will be responsible for providing a robust, scalable, and secure solution that meets the evolving needs of Ireland's educational sector.\n\n**Please note there are 12 tender documents in the CfT Documents area.**",
      "main_nature": "services",
      "main_classification": "72000000",
      "additional_classifications": [
        "48000000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "450000",
        "currency": "",
        "maximum_value": "450000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "not-allowed",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "fa-mix",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3305389"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/272869-2024/pdf"
}