{
  "notice_publication_id": "289900-2024",
  "buyer": {
    "official_name": "Office of Public Works (OPW)",
    "email": "liam.oculbaird@opw.ie",
    "legal_type": "cga",
    "activity": "gen-pub",
    "address": {
      "street": "Jonathan Swift Street",
      "city": "Trim",
      "postal_code": "C15 NX36",
      "country": "IRL"
    },
    "website": "https://www.opw.ie",
    "company_id": "1",
    "phone": "353 46 9422287"
  },
  "procedure": {
    "title": "The Development of the National Library of Ireland, Kildare Street, Dublin 2, for The Commisioners of Public Works",
    "description": "**Title:** The Development of the National Library of Ireland, Kildare Street, Dublin 2, for The Commissioners of Public Works\n\n**Description:**\nThe development will consist of the redevelopment, refurbishment, and extension of the National Library of Ireland West Wing, a building listed as a Protected Structure and on the Record of Monuments and Places. This project includes the refurbishment of the main Reading Room and ancillary spaces, as well as the repurposing of the existing Exhibition Space. The overall Gross Floor Area of the existing and new buildings is 2710m².\n\n**Objective:**\nTo identify and appoint a suitable contractor who can manage this complex project effectively, ensuring that the historical and architectural integrity of the building is preserved while meeting modern standards of functionality and sustainability.\n\n**Selection Criteria:**\n- **Suitability Assessment Questionnaires (SAQs):** Interested parties will be required to submit completed SAQs. The top 5 scoring applicants, subject to the quality and number of SAQs received, will be invited to tender.\n- **Tender Evaluation:** Applicants selected for inclusion on the tender list will receive a formal Invitation to Tender Document. Submissions will be assessed based on the rules, criteria, and weightings set out in the document.\n- **Award Criteria:** The successful tenderer will be identified as the one who is fully in conformance with the tender documentation and submits the most economically advantageous tender under the award criteria contained in the Instructions to Tenderers.\n\n**Key Considerations:**\n- **Historical Preservation:** The project requires a deep understanding of historical preservation and restoration techniques to ensure that the building's architectural and cultural significance are maintained.\n- **Sustainability:** The contractor should demonstrate a commitment to sustainable practices and energy-efficient solutions to minimize the project's environmental impact.\n- **Project Management:** The ability to manage a complex project with multiple stakeholders, including heritage experts, architects, and local authorities, is crucial.\n- **Technical Expertise:** The contractor should possess the necessary technical expertise in construction, heritage conservation, and project management.\n\n**Required Qualifications and Experience:**\n- **Heritage Conservation:** Proven experience in heritage conservation and restoration projects.\n- **Construction Management:** Demonstrated ability to manage large-scale construction projects.\n- **Sustainability Practices:** Commitment to sustainable practices and energy-efficient solutions.\n- **Project Coordination:** Experience in coordinating multiple stakeholders and ensuring project timelines are met.\n\n**Submission Requirements:**\nApplicants must submit a detailed tender proposal that includes:\n1. **Company Profile:** Overview of the company's experience, qualifications, and relevant projects.\n2. **Project Plan:** Detailed project plan outlining the methodology, timelines, and resource allocation.\n3. **Technical Proposal:** Technical details of the proposed works, including materials, methods, and any innovative solutions.\n4. **Cost Estimate:** Comprehensive cost estimate for the project, including all associated costs and contingencies.\n5. **Risk Assessment:** Risk assessment and mitigation plan for potential project risks.\n\nBy selecting a contractor who meets these criteria, the Commissioners of Public Works aim to ensure that the National Library of Ireland West Wing is redeveloped into a modern, functional, and historically preserved space that serves the needs of the public and the cultural community.",
    "identifier": "947e02bc-cbf2-4a9d-9efb-76c8f112f775",
    "type": "restricted",
    "accelerated": "false",
    "deadline_date": "2024-06-14+01:00",
    "deadline_time": "12:00:00+01:00"
  },
  "purpose": {
    "main_nature": "works",
    "main_classification": "45212000",
    "additional_classifications": [
      "45000000",
      "45212314",
      "45212310",
      "45212350",
      "45453100",
      "45454100",
      "45000000",
      "45212314",
      "45212310",
      "45212350",
      "45453100",
      "45454100"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "41000000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "false",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "restricted",
    "submission_method": "required",
    "government_agreement_constraint": "false",
    "open_tender_date": "",
    "open_tender_time": "",
    "open_tender_location": ""
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "eu-funds",
    "recurring_procurement": "false",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "180",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "The Development of the National Library of Ireland, Kildare Street, Dublin 2, for The Commisioners of Public Works",
      "description": "**Title: The Development of the National Library of Ireland, Kildare Street, Dublin 2, for The Commissioners of Public Works**\n\n**Description:**\nThe development will consist of the redevelopment, refurbishment, and extension of the National Library of Ireland West Wing, a building listed as a Protected Structure and on the Record of Monuments and Places. The project includes the refurbishment of the main Reading Room and ancillary spaces, as well as the repurposing of the existing Exhibition Space. The overall Gross Floor Area of the existing and new buildings is 2710m².\n\n**Objective:**\nThe primary objective is to transform the National Library of Ireland West Wing into a modern, functional, and accessible space that preserves its historical significance while enhancing its usability for the public. The project aims to create a sustainable and energy-efficient environment that aligns with the Office of Public Works' (OPW) commitment to environmental sustainability and heritage preservation.\n\n**Key Requirements:**\n1. **Heritage Preservation:** The successful bidder must demonstrate expertise in preserving and restoring historic buildings, ensuring that the original architectural and historical integrity of the West Wing is maintained.\n2. **Sustainability:** The redevelopment must incorporate sustainable design principles, including energy-efficient systems, green technologies, and materials that minimize environmental impact.\n3. **Accessibility:** The refurbished spaces must be fully accessible for all users, adhering to current accessibility standards.\n4. **Project Management:** The bidder should have a proven track record in managing complex projects involving heritage sites, ensuring timely completion and adherence to budget constraints.\n5. **Community Engagement:** The successful bidder should be able to engage effectively with the local community, stakeholders, and heritage experts to ensure that the project meets the needs of all parties involved.\n\n**Evaluation Criteria:**\n1. **Technical Competence:** The bidder's experience in heritage preservation, sustainable design, and project management will be assessed.\n2. **Financial Viability:** The bidder's ability to manage the project within budget constraints and deliver value for money will be evaluated.\n3. **Environmental Impact:** The bidder's commitment to sustainability and reducing the project's environmental footprint will be assessed.\n4. **Community Engagement:** The bidder's ability to engage with the community and stakeholders will be evaluated.\n5. **Quality of Submission:** The clarity, completeness, and overall quality of the tender submission will be assessed.\n\n**Selection Process:**\n1. **Stage 1:** Following the receipt and evaluation of completed Suitability Assessment Questionnaires (SAQs) from interested parties, the top 5 scoring applicants (subject to the quality and number of SAQs received) who also meet the minimum criteria and rules for selection will be invited to tender.\n2. **Stage 2:** Applicants who are selected for inclusion on the tender list will be issued a formal Invitation to Tender Document (inclusive of the award criteria) and will be asked to respond with a tender submission. Submissions received will be assessed on the basis of the rules, criteria, and weightings set out in the Invitation to Tender Document in order to make an award decision.\n\nThe successful tenderer will be identified as the bidder who is fully in conformance with the tender documentation and submits the most economically advantageous tender under the award criteria contained in the Instructions to Tenderers. The appointment of the successful tenderer is subject to the approval of the contracting authorities.\n\n**Contact Information:**\nFor further information or clarification regarding this tender, please contact the Office of Public Works at [OPW Contact Information].",
      "main_nature": "works",
      "main_classification": "45212000",
      "additional_classifications": [
        "45000000",
        "45212314",
        "45212310",
        "45212350",
        "45453100",
        "45454100"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "41000000",
        "currency": "",
        "maximum_value": "1"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "sui-act",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "false",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": "true"
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3572451"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/289900-2024/pdf"
}