{
  "notice_publication_id": "29517-2024",
  "buyer": {
    "official_name": "Atlantic Technological University",
    "email": "procurement@atu.ie",
    "legal_type": "body-pl",
    "activity": "education",
    "address": {
      "street": "Port Road",
      "city": "Letterkenny",
      "postal_code": "F94 DV52",
      "country": "IRL"
    },
    "website": "https://www.atu.ie",
    "company_id": "3926731JH",
    "phone": "074 9186000"
  },
  "procedure": {
    "title": "Single Party Framework Agreement for ATU General Furniture Supply, Delivery, Installation and Repair 2024",
    "description": "Atlantic Technological University (ATU) is a multi-campus technological university in the west and northwest of Ireland, established on 1 April 2022 through the merger of Galway-Mayo IT, IT Sligo, and Letterkenny IT. ATU offers a rich combination of academic and research excellence, quality of life, and opportunity. The university is committed to delivering high-quality education and research across various disciplines, including business, engineering, science, computing, and more.\n\nThe successful bidder for the Single Party Framework Agreement for ATU General Furniture Supply, Delivery, Installation, and Repair 2024 will be responsible for providing comprehensive furniture solutions to all ATU locations. These locations include:\n\n- **ATU Galway City**: The administrative headquarters with four Schools of study: Business, Engineering, Science & Computing, and Galway International Hotel School.\n- **ATU Mayo Campus**: Located in Castlebar, offering degree courses in business, engineering, humanities, nursing, and social care, along with Lifelong Learning courses and an Innovation Hub.\n- **ATU Connemara Campus**: The National Centre of Excellence for Furniture Design and Wood Technology, offering degree courses in furniture design and manufacture, furniture and wood technology, and teacher education.\n- **ATU Sligo**: Located in Ash Lane, Sligo town, with St. Angela's College, Sligo, which became part of the university in 2023.\n- **ATU Donegal (Letterkenny and Killybegs Campuses)**: Offering a wide range of programs including computing, engineering, design, science, business, veterinary practice, nursing, and law.\n\nThe framework agreement will establish overall terms and conditions for the supply, delivery, installation, and repair of furniture across all these locations. The successful operator must accept full responsibility for the delivery of goods/services to all ATU locations, ensuring that the furniture meets the highest standards of quality and functionality to support the academic and research activities of the university.\n\nThe bidder should have a proven track record in providing comprehensive furniture solutions to educational institutions, demonstrating expertise in managing large-scale projects, ensuring timely delivery, and providing excellent customer service. The ability to customize furniture solutions to meet the specific needs of various departments within the university is also essential. Additionally, the bidder should have a strong commitment to sustainability and environmental responsibility, aligning with ATU's values and goals.\n\nBy selecting a suitable bidder, ATU aims to establish a long-term partnership that will support the continued growth and development of the university, ensuring that all campuses are equipped with high-quality furniture that enhances the learning environment and promotes academic excellence.",
    "identifier": "4447a193-3fbb-41a0-8dab-789bcbe8d23b",
    "type": "restricted",
    "accelerated": "false",
    "deadline_date": "2024-02-13+00:00",
    "deadline_time": "12:00:00+00:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "39100000",
    "additional_classifications": [
      "39150000",
      "39160000",
      "39143200",
      "44521140",
      "39130000",
      "79934000",
      "45421153",
      "50850000",
      "39134000",
      "39153000",
      "39151000",
      "39156000",
      "39000000",
      "39151300",
      "39180000",
      "39157000",
      "39155000",
      "39150000",
      "39160000",
      "39143200",
      "44521140",
      "39130000",
      "79934000",
      "45421153",
      "50850000",
      "39134000",
      "39153000",
      "39151000",
      "39156000",
      "39000000",
      "39151300",
      "39180000",
      "39157000",
      "39155000"
    ],
    "place_of_performance": "anyw-cou"
  },
  "value": {
    "estimated_value": "3500000",
    "currency": "",
    "maximum_value": "3500000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "not-allowed",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "restricted",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "",
    "open_tender_time": "",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=2943295"
  },
  "tendering_terms": {
    "variant_constraint": "not-allowed",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "false",
    "multiple_tenders": "allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "12",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Single Party Framework Agreement for ATU General Furniture Supply, Delivery, Installation and Repair 2024",
      "description": "Atlantic Technological University (ATU) invites Prequalification Applications for the establishment of a single party framework agreement for the supply, delivery, installation, and repair of furniture across all its locations. The successful operator will accept full responsibility for the delivery of goods and services to the following campuses:\n\n- **ATU Galway City**: Located on the Dublin Road in Galway city, this campus serves as the administrative headquarters and houses four Schools of study: the School of Business, the School of Engineering, the School of Science & Computing, and the Galway International Hotel School. Additionally, it features the Innovation Hub, the Lifelong Learning Centre, and the Research, Development & Innovation Centre.\n  \n- **ATU Mayo Campus**: Situated in Castlebar on approximately 20 hectares of land, this campus offers degree courses in business, engineering, humanities, nursing, and social care. It also provides a wide range of Lifelong Learning courses and has an Innovation Hub to support entrepreneurs and start-up businesses.\n\n- **ATU Connemara Campus**: Located in Letterfrack, this campus is the National Centre of Excellence for Furniture Design and Wood Technology. It offers degree courses in furniture design and manufacture, furniture and wood technology, and teacher education (construction studies and DCG).\n\n- **ATU Sligo**: Based in Ash Lane, Sligo town, this campus includes St. Angela's College, Sligo, which was formally gifted to the university by the Ursuline Order of Nuns. The campus features a Business Innovation Centre, a sports centre, and a library.\n\n- **ATU Donegal (Letterkenny and Killybegs Campuses)**: The Letterkenny Campus is located on the Lower Port Road in Letterkenny, offering a wide range of undergraduate and postgraduate courses. The Killybegs Campus houses the School of Tourism and offers courses in culinary arts, hospitality, and tourism disciplines.\n\nThe framework agreement will establish overall terms and conditions for a specified duration, allowing for individual contracts to be awarded as needed. The successful bidder must demonstrate the ability to supply, deliver, install, and repair furniture to meet the diverse needs of these campuses. The bidder should have experience in managing large-scale furniture supply and installation projects, ensuring timely delivery and high-quality service. Additionally, they should have a proven track record of maintaining and repairing furniture across multiple locations. The prequalification application should include detailed information about the bidder's experience, capabilities, and references.",
      "main_nature": "supplies",
      "main_classification": "39100000",
      "additional_classifications": [
        "39150000",
        "39160000",
        "39143200",
        "44521140",
        "39130000",
        "79934000",
        "45421153",
        "50850000",
        "39134000",
        "39153000",
        "39151000",
        "39156000",
        "39000000",
        "39151300",
        "39180000",
        "39157000",
        "39155000"
      ],
      "place_of_performance": "anyw-cou",
      "country": "IRL",
      "value": {
        "estimated_value": "3500000",
        "currency": "",
        "maximum_value": "3500000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "not-allowed",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "false",
        "framework_agreement": "fa-wo-rc",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=2943295"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/29517-2024/pdf"
}