{
  "notice_publication_id": "298895-2024",
  "buyer": {
    "official_name": "Education Procurement Service (EPS)",
    "email": "Info@educationprocurmentservice.ie",
    "legal_type": "body-pl",
    "activity": "health",
    "address": {
      "street": "Castletroy Limerick",
      "city": "Limerick",
      "postal_code": "V94 DK53",
      "country": "IRL"
    },
    "website": "https://www.educationprocurementservice.ie/",
    "company_id": "IE 6609370 G",
    "phone": "061233715"
  },
  "procedure": {
    "title": "LI2660F – HSE Request for Tenders under Open Procedure (OJEU) To Establish a Multi Supplier Framework Agreement for the Supply of Electronic Journal Collections and On-Demand Electronic Journal Access",
    "description": "The Education Procurement Service (EPS) is the Department of Education & Skills (DES) sector sourcing hub and operates as a shared service for the DES, its agencies, the schools sector, Education and Training Boards, and the Higher Education Sector. EPS is responsible for procuring goods and services on behalf of these entities, ensuring compliance with national procurement regulations. Specifically, EPS has published a public tender notice (LI2660F) on behalf of the Health Service Executive (HSE) to establish a multi-supplier framework agreement for the supply of electronic journal collections and on-demand electronic journal access. The tender aims to procure these services for HSE Library Services, providing access to all members and other authorized users. Suitable bidders should have experience in providing electronic journal collections and on-demand access, with a proven track record in managing large-scale digital library services. They should also be able to demonstrate compliance with relevant EU procurement regulations (OJEU) and have the necessary infrastructure to support the diverse needs of the HSE Library Services. Additionally, bidders should be able to provide detailed information about their service offerings, technical capabilities, and any relevant certifications or standards they adhere to. The successful bidder will be expected to maintain a robust and secure system for accessing electronic journals, ensuring high availability and reliability.",
    "identifier": "f989c966-5403-474c-95de-81ff682bdd93",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-06-07+01:00",
    "deadline_time": "14:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "39155100",
    "additional_classifications": [
      "48612000",
      "48611000",
      "48610000",
      "48600000",
      "72212610",
      "72212600",
      "72321000",
      "72320000",
      "22211000",
      "22211100",
      "92500000",
      "22200000",
      "92510000",
      "92511000",
      "22113000",
      "30238000",
      "79995000",
      "48160000",
      "48161000",
      "72212160",
      "48612000",
      "48611000",
      "48610000",
      "48600000",
      "72212610",
      "72212600",
      "72321000",
      "72320000",
      "22211000",
      "22211100",
      "92500000",
      "22200000",
      "92510000",
      "92511000",
      "22113000",
      "30238000",
      "79995000",
      "48160000",
      "48161000",
      "72212160",
      "48612000",
      "48611000",
      "48610000",
      "48600000",
      "72212610",
      "72212600",
      "72321000",
      "72320000",
      "22211000",
      "22211100",
      "92500000",
      "22200000",
      "92510000",
      "92511000",
      "22113000",
      "30238000",
      "79995000",
      "48160000",
      "48161000",
      "72212160"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "4680000",
    "currency": "",
    "maximum_value": "4680000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-06-07+01:00",
    "open_tender_time": "14:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3492511"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Electronic Journal Collections",
      "description": "The Education Procurement Service (EPS) is the Department of Education & Skills (DES) sector sourcing hub, operating as a shared service for the DES, its agencies, the schools sector, Education and Training Boards, and the Higher Education Sector. EPS is one of the four sector-specific procurement functions comprising Education, Health, Defence, and Local Government, and it operates together with the Office of Government Procurement (OGP) under the national procurement model as part of the Government’s Public Service Reform agenda.\n\nFor the public tender notice titled \"Electronic Journal Collections,\" EPS invites tenders from economic operators to procure Electronic Journal Collections and On-Demand Electronic Journal Access for Health Service Executive (HSE) Library Services. The HSE requires these services for access by all its members and other authorized users. The successful bidder will need to demonstrate expertise in providing comprehensive electronic journal collections and on-demand access, ensuring seamless integration with existing library systems and robust security measures to protect sensitive information.\n\nKey considerations for the tender include:\n\n- **Technical Capabilities**: The bidder must have a proven track record of providing high-quality electronic journal collections and on-demand access.\n- **Integration**: The solution should seamlessly integrate with the HSE's existing library systems to ensure smooth access for all users.\n- **Security**: The bidder must provide robust security measures to protect sensitive information and ensure compliance with relevant data protection regulations.\n- **User Access**: The system should allow for easy access by all HSE members and other authorized users.\n- **Customer Support**: The bidder should offer reliable customer support to address any technical issues promptly.\n- **Cost-Effectiveness**: The proposal should include a detailed breakdown of costs, ensuring value for money while meeting all the specified requirements.\n\nBy focusing on these key areas, the bidder can effectively meet the needs of the HSE and provide a comprehensive solution for electronic journal collections and on-demand access.",
      "main_nature": "supplies",
      "main_classification": "39155100",
      "additional_classifications": [
        "48612000",
        "48611000",
        "48610000",
        "48600000",
        "72212610",
        "72212600",
        "72321000",
        "72320000",
        "22211000",
        "22211100",
        "92500000",
        "22200000",
        "92510000",
        "92511000",
        "22113000",
        "30238000",
        "79995000",
        "48160000",
        "48161000",
        "72212160"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "4680000",
        "currency": "",
        "maximum_value": "4680000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "fa-wo-rc",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    },
    {
      "lot": "LOT-0002",
      "title": "On-Demand Electronic Journal Access",
      "description": "The Education Procurement Service (EPS) is the Department of Education & Skills (DES) sector sourcing hub and operates as a shared service for the DES, its agencies, the schools sector, Education and Training Boards, and the Higher Education Sector. EPS is one of the four sector-specific procurement functions comprising Education, Health, Defence, and Local Government. They operate together with the Office of Government Procurement (OGP) under the national procurement model as part of the Government’s Public Service Reform agenda.\n\nThe EPS is responsible for managing procurement processes for various educational institutions and health services, ensuring efficient and transparent sourcing of goods and services. Given their role in managing complex procurement processes, they require tenderers with expertise in the following areas:\n\n- **Electronic Journal Collections**: The ability to provide comprehensive and up-to-date electronic journal collections that meet the diverse needs of the Health Service Executive (HSE) Library Services.\n- **On-Demand Electronic Journal Access**: The capacity to offer flexible and reliable on-demand access to electronic journals, ensuring seamless integration with existing library systems.\n- **Technical Expertise**: Proficiency in managing digital content, ensuring high availability, and maintaining robust security measures to protect sensitive information.\n- **User Accessibility**: The ability to provide user-friendly interfaces that cater to the needs of all members and authorized users within the HSE.\n- **Compliance**: Familiarity with relevant regulations and standards in the healthcare sector, ensuring compliance with data protection and information security requirements.\n- **Customer Support**: A commitment to providing excellent customer support, including training and technical assistance to ensure smooth operation of the electronic journal access system.\n\nTenderers should have a proven track record in providing similar services to large-scale organizations, demonstrating their ability to handle complex procurement requirements. They should also possess strong project management skills, ensuring timely delivery and effective implementation of the electronic journal access system. The EPS is seeking a reliable and innovative partner capable of delivering high-quality services that meet the evolving needs of the HSE Library Services.",
      "main_nature": "supplies",
      "main_classification": "39155100",
      "additional_classifications": [
        "48612000",
        "48611000",
        "48610000",
        "48600000",
        "72212610",
        "72212600",
        "72321000",
        "72320000",
        "22211000",
        "22211100",
        "92500000",
        "22200000",
        "92510000",
        "92511000",
        "22113000",
        "30238000",
        "79995000",
        "48160000",
        "48161000",
        "72212160"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "4680000",
        "currency": "",
        "maximum_value": "4680000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "fa-wo-rc",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3492511",
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3492511"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/298895-2024/pdf"
}