{
  "notice_publication_id": "299498-2024",
  "buyer": {
    "official_name": "Mary Immaculate College",
    "email": "Michael.Keane@mic.ul.ie",
    "legal_type": "body-pl-cga",
    "activity": "education",
    "address": {
      "street": "South Circular Road",
      "city": "Limerick",
      "postal_code": "V94 VN26",
      "country": "IRL"
    },
    "website": "https://www.mic.ul.ie/",
    "company_id": "0000",
    "phone": "0035361204300"
  },
  "procedure": {
    "title": "Establishment of Term Maintenance and Refurbishment Contract for Mechanical Maintenance and Call Out Services at Mary Immaculate College",
    "description": "**Title: Establishment of Term Maintenance and Refurbishment Contract for Mechanical Maintenance and Call Out Services at Mary Immaculate College**\n\n**Description:**\nThe purpose of this tender competition is to appoint a Term Maintenance Contractor for Mechanical Services Maintenance Works, for a period of up to 4 years, to cover all Mary Immaculate College (MIC) buildings across two campuses, the main MIC campus, South Circular Road, Limerick, and the MIC Thurles Campus. The initial award will be for a period of 2 years, and may be extended by a further one-year period up to twice, so the overall maximum contract duration is 4 years.\n\n**Key Requirements:**\n- **Scope of Work:** The successful bidder will be responsible for providing comprehensive mechanical maintenance services, including routine maintenance, repairs, and call-out services for all MIC buildings.\n- **Campus Coverage:** The contract will cover both the main MIC campus in Limerick and the MIC Thurles Campus.\n- **Duration:** The initial contract period will be 2 years, with the option to extend for an additional year up to twice, resulting in a maximum contract duration of 4 years.\n- **Service Standards:** The contractor must ensure that all maintenance works are carried out to the highest standards, minimizing disruptions to academic and administrative activities.\n- **Health and Safety:** The contractor must adhere to all relevant health and safety regulations, ensuring a safe working environment for both their personnel and MIC staff.\n- **Environmental Considerations:** The contractor should implement sustainable practices and minimize environmental impact during the execution of maintenance works.\n- **Communication:** Regular communication with MIC's facilities management team is essential to ensure that all maintenance needs are addressed promptly and efficiently.\n- **Quality Assurance:** The contractor must provide a quality assurance plan to ensure that all works meet the required standards and are documented accordingly.\n\n**Evaluation Criteria:**\n- **Technical Competence:** The bidder's experience in providing mechanical maintenance services, particularly in educational institutions.\n- **Financial Proposals:** The cost of the services, including any additional fees or charges.\n- **Health and Safety Record:** The bidder's track record in maintaining a safe working environment.\n- **Environmental Sustainability:** The bidder's commitment to sustainable practices.\n- **Communication and Coordination:** The bidder's ability to communicate effectively and coordinate with MIC's facilities management team.\n- **Quality Assurance Plan:** The bidder's plan for ensuring the quality of all maintenance works.\n\n**Submission Requirements:**\n- **Bidder Information:** Detailed information about the bidder, including their company profile, experience, and relevant certifications.\n- **Technical Proposal:** A comprehensive technical proposal outlining the bidder's approach to the maintenance works, including methodologies, timelines, and resource allocation.\n- **Financial Proposal:** A detailed financial proposal including all costs associated with the maintenance services, payment terms, and any additional fees.\n- **Health and Safety Plan:** A detailed health and safety plan outlining the measures the bidder will take to ensure a safe working environment.\n- **Environmental Sustainability Plan:** A plan detailing the bidder's commitment to sustainable practices during the execution of maintenance works.\n- **Quality Assurance Plan:** A detailed quality assurance plan outlining the measures the bidder will take to ensure that all maintenance works meet the required standards.\n\nBy responding to this tender, bidders must demonstrate their ability to provide high-quality mechanical maintenance services that meet the specific needs of Mary Immaculate College, ensuring minimal disruptions to academic and administrative activities while maintaining a safe and sustainable working environment.",
    "identifier": "dd0528db-0598-4f2a-b1da-4256c9917367",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-06-18+01:00",
    "deadline_time": "16:30:00+01:00"
  },
  "purpose": {
    "main_nature": "works",
    "main_classification": "45259300",
    "additional_classifications": [],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "1500000",
    "currency": "",
    "maximum_value": "1500000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "false",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-06-18+01:00",
    "open_tender_time": "17:00:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3603976"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Establishment of Term Maintenance and Refurbishment Contract for Mechanical Maintenance and Call Out Services at Mary Immaculate College",
      "description": "**Title: Establishment of Term Maintenance and Refurbishment Contract for Mechanical Maintenance and Call Out Services at Mary Immaculate College**\n\n**Description:**\nThe purpose of this tender competition is to appoint a Term Maintenance Contractor for Mechanical Services Maintenance Works, for a period of up to 4 years, to cover all Mary Immaculate College (MIC) buildings across two campuses, the main MIC campus, South Circular Road, Limerick, and the MIC Thurles Campus. The initial award will be for a period of 2 years, and may be extended by a further one-year period up to twice, so the overall maximum contract duration is 4 years.\n\n**Key Requirements:**\n- **Scope of Work:** The successful bidder will be responsible for providing comprehensive mechanical maintenance services, including but not limited to, plumbing, HVAC, and electrical systems.\n- **Coverage:** The contract will cover all buildings on both campuses, ensuring that all facilities are maintained to a high standard.\n- **Duration:** The initial contract period will be 2 years, with the option to extend for an additional 2 years, making the maximum contract duration 4 years.\n- **Responsibilities:** The contractor will be required to perform routine maintenance, respond to call-outs, and undertake any necessary refurbishment works to ensure the optimal functioning of the college's mechanical systems.\n- **Quality Assurance:** The contractor must demonstrate a strong track record of delivering high-quality maintenance services, ensuring minimal disruption to the college's operations.\n- **Health and Safety:** The contractor must adhere to all relevant health and safety regulations, ensuring a safe working environment for both their personnel and MIC staff.\n- **Environmental Considerations:** The contractor should have a commitment to environmental sustainability and adhere to best practices in waste management and energy efficiency.\n- **Communication:** Regular communication with MIC's facilities management team is essential to ensure that all maintenance activities are coordinated effectively and that any issues are promptly addressed.\n\n**Evaluation Criteria:**\n- **Technical Competence:** The bidder's experience and expertise in providing mechanical maintenance services.\n- **Quality of Service:** The bidder's ability to deliver high-quality maintenance services.\n- **Health and Safety Record:** The bidder's compliance with health and safety regulations.\n- **Environmental Sustainability:** The bidder's commitment to environmental sustainability.\n- **Cost Effectiveness:** The bidder's proposed pricing structure and value for money.\n- **Reputation and References:** The bidder's reputation and references from previous clients.\n\n**Submission Requirements:**\n- **Tender Documents:** Bidders must submit a comprehensive tender document outlining their approach, methodology, and proposed pricing structure.\n- **Company Profile:** A detailed company profile, including relevant experience and qualifications.\n- **References:** Contact details of at least three previous clients who can verify the bidder's technical competence and quality of service.\n- **Health and Safety Policy:** A copy of the bidder's health and safety policy.\n- **Environmental Policy:** A copy of the bidder's environmental policy.\n\nBy appointing a suitable contractor, Mary Immaculate College aims to ensure that its mechanical systems are maintained to the highest standards, supporting the college's academic and operational activities effectively. The successful bidder will play a critical role in maintaining the college's facilities, ensuring a safe and sustainable environment for all students, staff, and visitors.",
      "main_nature": "works",
      "main_classification": "45259300",
      "additional_classifications": [],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "1500000",
        "currency": "",
        "maximum_value": "1500000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "sui-act",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "false",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3603976"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/299498-2024/pdf"
}