{
  "notice_publication_id": "305238-2024",
  "buyer": {
    "official_name": "Dublin Dental Hospital Board",
    "email": "peter.coughlan@dental.tcd.ie",
    "legal_type": "body-pl",
    "activity": "health",
    "address": {
      "street": "Four Courts, Inns Quay, Dublin 7",
      "city": "Dublin",
      "postal_code": "D07 WDX8",
      "country": "IRL"
    },
    "website": "https://www.dentalhospital.ie/",
    "company_id": "0053076I",
    "phone": "00353 1 6127391"
  },
  "procedure": {
    "title": "Provision of dental implants and associated materials",
    "description": "**Title: Provision of Dental Implants and Associated Materials**\n\n**Description:**\nThe Dublin Dental University Hospital, a centre of excellence in patient care, education, and research, is conducting this procurement to acquire high-quality dental implants and related materials. The hospital provides comprehensive training for all members of the dental team and offers a wide range of dental services, including specialist and tertiary referral care, emergency care, and general dental treatment.\n\nThe hospital's Accident and Emergency service is limited to pain relief for dental accidents or emergencies requiring immediate attention, such as bleeding, serious infection, visible swelling, or severe pain. However, patients are advised to contact their own dentist or Health Services Executive dentist in the first instance.\n\nThe procurement aims to support the hospital's mission by ensuring that the dental implants and associated materials meet the highest standards of quality and safety. The scope of services includes but is not limited to:\n\n- **Dental Implants:** High-quality dental implants suitable for various procedures, including single-tooth replacements, full-arch restorations, and implant-supported dentures.\n- **Related Materials:** All necessary components and accessories required for the successful placement and maintenance of dental implants, such as abutments, crowns, screws, and bone grafting materials.\n- **Supply Chain Management:** Efficient supply chain management to ensure timely delivery of materials to meet the hospital's operational needs.\n- **Quality Assurance:** Compliance with international standards and regulations, including ISO 13485, to ensure the highest level of quality and safety.\n- **Training and Support:** Provision of training and support for the dental team to ensure seamless integration of the new implants and materials into their practice.\n- **Documentation and Reporting:** Accurate documentation and reporting of all procurement activities, including inventory management and maintenance records.\n\nThe successful bidder will be expected to provide detailed information about their products, including technical specifications, clinical trials data, and any relevant certifications. The procurement process will prioritize bidders with a proven track record of supplying high-quality dental implants and related materials to reputable healthcare institutions.\n\n**Evaluation Criteria:**\n1. **Quality of Products:** The bidder's ability to provide high-quality dental implants and related materials that meet international standards.\n2. **Technical Specifications:** Detailed information about the technical specifications of the products, including material composition, durability, and compatibility.\n3. **Clinical Trials Data:** Availability of clinical trials data demonstrating the safety and efficacy of the products.\n4. **Certifications:** Relevant certifications such as ISO 13485 and CE marking.\n5. **Supply Chain Management:** Efficiency and reliability of the supply chain management process.\n6. **Training and Support:** Provision of comprehensive training and support for the dental team.\n7. **Documentation and Reporting:** Accuracy and completeness of documentation and reporting.\n\n**Submission Requirements:**\nBidders must submit a comprehensive proposal that includes:\n1. Detailed product information.\n2. Technical specifications.\n3. Clinical trials data.\n4. Certifications.\n5. Supply chain management plan.\n6. Training and support plan.\n7. Documentation and reporting procedures.\n\nThe proposal should be submitted in electronic format to the specified contact email. The deadline for submission will be clearly stated in the tender notice. The Dublin Dental University Hospital reserves the right to request additional information or clarification during the evaluation process.\n\nBy procuring high-quality dental implants and related materials, the hospital aims to enhance patient care, support ongoing research, and maintain its position as a centre of excellence in dental education and research.",
    "identifier": "f9e6da39-c64b-4425-be4a-7afaccff1776",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-06-28+01:00",
    "deadline_time": "14:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "33132000",
    "additional_classifications": [
      "33141850",
      "33141800",
      "33141810",
      "33131300",
      "33131600",
      "33141850",
      "33141800",
      "33141810",
      "33131300",
      "33131600"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "2500000",
    "currency": "",
    "maximum_value": "2500000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "not-allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-06-28+01:00",
    "open_tender_time": "14:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3640030"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Provision of dental implants and associated materials",
      "description": "**Title: Provision of Dental Implants and Associated Materials**\n\n**Description:**\nThe Dublin Dental University Hospital, a centre of excellence in patient care, education, and research, is conducting this procurement to secure high-quality dental implants and related materials. The hospital is Ireland's principal dental education institution, providing comprehensive training for all members of the dental team and offering a wide range of dental services, including specialist and tertiary referral care, emergency care, and general dental treatment.\n\n**Scope of Services:**\nThe procurement aims to acquire dental implants and associated materials that meet the highest standards of quality and safety. The successful bidder will be expected to provide products that are suitable for various dental procedures, including but not limited to, implant placement, restoration, and maintenance. The materials should be compatible with the hospital's existing clinical management system and electronic dental records.\n\n**Key Requirements:**\n1. **Quality Assurance:** The bidder must demonstrate a robust quality assurance process to ensure that the dental implants and related materials meet international standards.\n2. **Clinical Compatibility:** The products must be compatible with the hospital's clinical management system and electronic dental records.\n3. **Regulatory Compliance:** The bidder must ensure that all products comply with relevant Irish and European Union regulations.\n4. **Training and Support:** The bidder should provide comprehensive training and support to the hospital's staff on the use and maintenance of the dental implants and related materials.\n5. **Supply Chain Reliability:** The bidder must have a reliable supply chain to ensure timely delivery of the products.\n6. **Patient Safety:** The bidder must prioritize patient safety and provide products that are safe for use in a clinical setting.\n\n**Evaluation Criteria:**\nThe procurement will be evaluated based on the following criteria:\n1. **Technical Competence:** The bidder's technical expertise and experience in providing dental implants and related materials.\n2. **Quality of Products:** The quality and safety of the dental implants and related materials.\n3. **Price:** The cost of the products and services offered.\n4. **Supply Chain Reliability:** The bidder's ability to ensure timely delivery of the products.\n5. **Training and Support:** The comprehensiveness of the training and support provided to the hospital's staff.\n6. **Regulatory Compliance:** The bidder's ability to ensure that all products comply with relevant regulations.\n\n**Timeline:**\nThe procurement process will include the following key milestones:\n1. **Tender Submission:** Bidders must submit their proposals by [Insert Date].\n2. **Evaluation:** The proposals will be evaluated based on the criteria outlined above.\n3. **Shortlisting:** Shortlisted bidders will be notified and invited to present their proposals.\n4. **Contract Award:** The contract will be awarded to the bidder who best meets the evaluation criteria.\n\n**Contact Information:**\nFor any queries or additional information, please contact the procurement team at [Insert Contact Information].",
      "main_nature": "supplies",
      "main_classification": "33132000",
      "additional_classifications": [
        "33141850",
        "33141800",
        "33141810",
        "33131300",
        "33131600"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "2500000",
        "currency": "",
        "maximum_value": "2500000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "not-allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3640030"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/305238-2024/pdf"
}