{
  "notice_publication_id": "307950-2024",
  "buyer": {
    "official_name": "University College Dublin ( UCD )",
    "email": "procurement@ucd.ie",
    "legal_type": "body-pl",
    "activity": "education",
    "address": {
      "street": "Belfield, Dublin 4",
      "city": "Dublin",
      "postal_code": "Belfield, Dublin 4",
      "country": "IRL"
    },
    "website": "https://www.ucd.ie",
    "company_id": "IE6517386K",
    "phone": "+353 1 7167777"
  },
  "procedure": {
    "title": "UCDOPP5415 Audio Visual Services For Events to University College Dublin",
    "description": "**Title: UCDOPP5415 Audio Visual Services For Events to University College Dublin**\n\n**Description:**\nUniversity College Dublin (UCD) is seeking to appoint suitable, experienced, and qualified service providers to provide comprehensive Audio Visual (AV) services for various events held on campus throughout the year. These events range from small-scale indoor gatherings to large-scale outdoor events, including both routine and high-profile activities. The successful bidder will be responsible for providing high-quality AV equipment and technical expertise to ensure seamless event execution.\n\n**Event Types:**\n- **Turning on the Christmas Lights:** An annual festive event that requires precise AV setup and technical support.\n- **UCD Student Ball:** A significant annual event that demands robust AV infrastructure and expert technical management.\n- **Other Events:** Various academic, cultural, and social events that may include conferences, seminars, lectures, exhibitions, and more.\n\n**Requirements and Specifications:**\n- **Technical Expertise:** The service provider must possess advanced technical knowledge and experience in AV systems, including setup, operation, and troubleshooting.\n- **Equipment Provision:** The bidder must offer a comprehensive range of AV equipment suitable for indoor and outdoor events, including but not limited to, sound systems, projection equipment, lighting systems, and necessary cables and connectors.\n- **Event Coordination:** The service provider should be able to coordinate with UCD event organizers to ensure all AV requirements are met and that events run smoothly.\n- **Flexibility:** The ability to adapt to different event sizes and complexities is essential.\n- **Reliability:** High reliability and availability of equipment and technical support are crucial for maintaining the reputation of UCD.\n\n**Appendix 1: Requirements and Specifications**\nDetailed specifications outlining the exact requirements for each type of event will be provided in the tender documents. Bidders are expected to carefully review these specifications to ensure they can meet all the necessary criteria.\n\nBy appointing a reliable and experienced AV service provider, UCD aims to enhance the quality and efficiency of its events, providing an excellent experience for attendees and maintaining its reputation as a leading educational institution.",
    "identifier": "039e5d6d-79c7-4e83-af17-e0f9196de0b0",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-07-16+01:00",
    "deadline_time": "12:00:00+01:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "71356300",
    "additional_classifications": [
      "32321200",
      "32321200"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "2200000",
    "currency": "",
    "maximum_value": "2200000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "false",
    "open_tender_date": "2024-07-16+01:00",
    "open_tender_time": "12:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3606205"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Audio Visual Services for Events",
      "description": "**Title: Audio Visual Services for Events**\n\n**Description:**\nUniversity College Dublin (UCD) is seeking to appoint suitable, experienced, and qualified service providers to provide comprehensive Audio Visual (AV) services for various events held on campus throughout the year. These events range from small, indoor gatherings to large-scale outdoor events, including the annual UCD Student Ball and the festive \"Turning on the Christmas Lights\" ceremony. The successful bidder will be responsible for providing both the necessary equipment and technical expertise to ensure seamless event execution.\n\n**Key Requirements:**\n- **Event Types:** The AV services will be required for a variety of events, including but not limited to:\n  - Annual UCD Student Ball\n  - Turning on the Christmas Lights ceremony\n  - Academic conferences and seminars\n  - Cultural and social events\n  - Outdoor festivals and fairs\n\n- **Technical Expertise:** The service provider must possess the technical expertise to handle complex AV setups, including sound systems, lighting, projection, and video conferencing equipment.\n\n- **Equipment Provision:** The bidder must be able to supply a wide range of AV equipment, including but not limited to:\n  - High-quality sound systems\n  - Advanced lighting solutions\n  - State-of-the-art projection systems\n  - Video conferencing equipment\n\n- **Event Size and Complexity:** The events vary in size and complexity, requiring flexibility and adaptability from the service provider.\n\n- **Framework Agreement:** The successful bidder will be appointed under a Framework Agreement, which will detail the specific requirements and specifications for each type of event outlined in Appendix 1.\n\n**Appendix 1: Requirements and Specifications**\nFor detailed information on the specific requirements and specifications for each type of event, please refer to Appendix 1 of the tender notice. This document will provide a comprehensive breakdown of the technical and logistical needs for each event, ensuring that bidders fully understand the scope of work involved.\n\nBy selecting a service provider with a proven track record in delivering high-quality AV services for diverse events, UCD aims to enhance the overall experience for its students, staff, and guests. The successful bidder will be expected to demonstrate their ability to meet these varied demands while maintaining the highest standards of professionalism and reliability.",
      "main_nature": "services",
      "main_classification": "71356300",
      "additional_classifications": [
        "32321200"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "2200000",
        "currency": "",
        "maximum_value": "2200000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "fa-w-rc",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3606205"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/307950-2024/pdf"
}