{
  "notice_publication_id": "308931-2024",
  "buyer": {
    "official_name": "Louth and Meath Education and Training Board 1384",
    "email": "fsmith@lmetb.ie",
    "legal_type": "body-pl-cga",
    "activity": "education",
    "address": {
      "street": "Abbey Road",
      "city": "Navan",
      "postal_code": "C15 N6 7E",
      "country": "IRL"
    },
    "website": "https://www.lmetb.ie",
    "company_id": "3185062nh",
    "phone": "+353 46 9068200"
  },
  "procedure": {
    "title": "2024/02 Invitation to Tendre for the provision of Catering Services to Ó' Fiaich College and Ó Fiaich PLC College",
    "description": "**Title: 2024/02 Invitation to Tender for the Provision of Catering Services to Ó' Fiaich College and Ó Fiaich PLC College**\n\n**Description:**\nThe Louth Meath Education and Training Board (LMETB) proposes to engage in a competitive process for the award of a contract for the provision of concessionary catering services to Ó' Fiaich College and Ó Fiaich PLC College. Tenders are invited from competent food caterers who can deliver high-quality, responsive, and flexible catering services. The successful tenderer will be required to provide a comprehensive, healthy, balanced, and nutritious catering service to students, staff, and visitors at affordable prices on Monday to Friday each week of the school year.\n\n**Key Requirements:**\n- **Quality of Service:** The catering service must ensure high-quality food that is healthy, balanced, and nutritious.\n- **Responsiveness:** The service provider must be able to respond promptly to the needs of students, staff, and visitors.\n- **Flexibility:** The service provider should be able to adapt to changing requirements and schedules.\n- **Affordability:** The catering service must be offered at affordable prices.\n- **Site Visit:** Tenderers are required to visit the school premises to inspect the facilities and discuss requirements with the School Principal. Site visits must be completed by appointment only before 7th June 2024.\n\n**Additional Information:**\n- **LMETB Overview:** Louth Meath ETB is one of the largest Education and Training Boards in Ireland, employing over 2,400 staff and providing education for 11,700 students at Primary, Secondary, and Post Leaving Certificate levels, as well as 20,000 beneficiaries in Further Education and Training.\n- **School Environment:** The schools are part of a comprehensive education network that includes 18 second-level schools, 4 Community National Schools, 2 Post Leaving Certificate Colleges, and various other educational centers.\n- **Community Focus:** LMETB is committed to excellence and innovation in the education of young people and adults, with a focus on community engagement and student support.\n\n**Evaluation Criteria:**\nTenders will be evaluated based on the following criteria:\n1. **Quality of Service**\n2. **Responsiveness**\n3. **Flexibility**\n4. **Affordability**\n5. **Previous Experience in Similar Settings**\n6. **Ability to Meet Specific Requirements**\n\n**Submission Guidelines:**\nTenders must be submitted electronically through the LMETB website by the specified deadline. Late submissions will not be accepted. For further information or to schedule a site visit, please contact the LMETB procurement team at [procurement@lmetb.ie](mailto:procurement@lmetb.ie).\n\nBy submitting a tender, the bidder acknowledges that they have read and understood the terms and conditions outlined in this invitation to tender. The Louth Meath Education and Training Board reserves the right to reject any tender that does not meet the specified requirements or to cancel the tender process at any time.",
    "identifier": "01fdbaca-7c16-4539-9fa7-b265205e2285",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-06-14+01:00",
    "deadline_time": "12:00:00+01:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "55520000",
    "additional_classifications": [
      "55500000",
      "55524000",
      "55500000",
      "55524000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "450000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-06-14+01:00",
    "open_tender_time": "12:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3659239"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "2024/02 Invitation to Tendre for the provision of Catering Services to Ó' Fiaich College and Ó Fiaich PLC College",
      "description": "**Title: 2024/02 Invitation to Tender for the Provision of Catering Services to Ó' Fiaich College and Ó Fiaich PLC College**\n\n**Description:**\nThe Louth & Meath Education and Training Board (LMETB) proposes to engage in a competitive process for the award of a contract for the provision of concessionary catering services to Ó' Fiaich College and Ó Fiaich PLC College. Tenders are invited from competent food caterers who can provide a high-quality, responsive, and flexible service. The successful tenderer will be required to offer a comprehensive, healthy, balanced, and nutritious catering service to students, staff, and visitors at affordable prices on Monday to Friday each week of the school year.\n\n**Key Requirements:**\n- **Quality of Service:** The catering service must provide high-quality, nutritious meals that cater to diverse dietary needs.\n- **Responsiveness:** The service provider must be able to respond promptly to any special requests or dietary requirements.\n- **Flexibility:** The service provider should be able to adapt to changing circumstances, such as unexpected absences or special events.\n- **Affordability:** The catering service must be offered at prices that are affordable for students, staff, and visitors.\n- **Site Visit:** Tenderers planning to submit a tender are required to visit the school premises to inspect the facilities and discuss requirements with the School Principal. A compulsory site visit must be completed by appointment only before 7th June 2024.\n\n**Additional Considerations:**\n- **Student and Staff Wellbeing:** The catering service should prioritize student and staff wellbeing by providing healthy and balanced meals.\n- **Sustainability:** The service provider should consider sustainable practices in food sourcing and waste management.\n- **Compliance:** The service provider must comply with all relevant health and safety regulations, as well as any specific guidelines set by LMETB.\n\n**Submission Guidelines:**\nTenders should be submitted in accordance with the specified format and guidelines available on the LMETB website. All tender documents must be received by the designated deadline to be considered.\n\n**Contact Information:**\nFor further information or to arrange a site visit, please contact the LMETB procurement team at [procurement@lmetb.ie](mailto:procurement@lmetb.ie) or 046 906 8200.",
      "main_nature": "services",
      "main_classification": "55520000",
      "additional_classifications": [
        "55500000",
        "55524000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "450000",
        "currency": "",
        "maximum_value": "0000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3659239"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/308931-2024/pdf"
}