{
  "notice_publication_id": "314364-2024",
  "buyer": {
    "official_name": "Parteen National School",
    "email": "principal@parteenschool.ie",
    "legal_type": "body-pl",
    "activity": "education",
    "address": {
      "street": "Four Courts, Inns Quay, Dublin 7",
      "city": "Parteen",
      "postal_code": "D07 WDX8",
      "country": "IRL"
    },
    "website": "https://www.parteenschool.com",
    "company_id": "16946D",
    "phone": "061340457"
  },
  "procedure": {
    "title": "2412 Parteen National School Heating Upgrade Emergency Works 2024",
    "description": "**Title: 2412 Parteen National School Heating Upgrade Emergency Works 2024**\n\n**Description:**\nParteen National School, a primary educational institution located in Kilquane, Parteen, Co. Clare, is seeking a reliable and experienced contractor to undertake an urgent heating upgrade project. The scope of the project includes:\n\n1. **Conversion of Existing Oil Boiler to Natural Gas:**\n   - Replace the existing oil boiler with a new natural gas boiler to improve energy efficiency and reduce environmental impact.\n\n2. **Installation of New Gas Fired Burner:**\n   - Install a new gas fired burner to ensure efficient combustion and minimize emissions.\n\n3. **New Header Pipework:**\n   - Replace existing header pipework with new, durable, and leak-resistant pipes to ensure reliable heat distribution.\n\n4. **Pumps, Valves, Actuators, and Presurisation Unit:**\n   - Install new pumps, valves, actuators, and a presurisation unit to optimize the heating system's performance and safety.\n\n5. **Gas Safety System:**\n   - Implement a comprehensive gas safety system to ensure the safe operation of the new heating system.\n\n6. **New 2-Pipe Heating Distribution System:**\n   - Install a new 2-pipe heating distribution system to provide efficient and balanced heat distribution throughout the school.\n\n7. **Radiators and Radiant Panels:**\n   - Replace existing radiators and install new radiant panels to enhance heat distribution and comfort levels.\n\n8. **Heating Controls:**\n   - Install advanced heating controls to monitor and regulate the temperature, ensuring optimal comfort and energy efficiency.\n\n9. **Associated Electrical and Builder's Works:**\n   - Perform all necessary electrical and builder's works to integrate the new heating system seamlessly into the existing infrastructure.\n\n10. **Redecoration:**\n    - Undertake redecoration works to ensure the new heating system is fully integrated into the school's environment, maintaining a safe and comfortable learning space.\n\nThe successful bidder will be expected to demonstrate expertise in both heating system upgrades and educational facility maintenance, ensuring minimal disruption to the school's operations. The project timeline is urgent, requiring immediate attention to address the school's heating needs effectively. \n\n**Contact Information:**\nFor further details or to submit a proposal, please contact Parteen National School at office@parteenschool.ie or phone 061 - 340457. The office hours are Monday to Friday from 8:30 AM to 3 PM, with a daily closure from 1 PM to 1:30 PM.",
    "identifier": "bb4408fe-7b30-4342-bec7-c31bc3875357",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-06-10+01:00",
    "deadline_time": "15:00:00+01:00"
  },
  "purpose": {
    "main_nature": "works",
    "main_classification": "45000000",
    "additional_classifications": [
      "45214200",
      "45311000",
      "45351000",
      "45232141",
      "45331100",
      "45315000",
      "45331000",
      "45330000",
      "45332200",
      "45214200",
      "45311000",
      "45351000",
      "45232141",
      "45331100",
      "45315000",
      "45331000",
      "45330000",
      "45332200"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "200000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "false",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-06-10+01:00",
    "open_tender_time": "15:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3664037"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "2412 Parteen National School Heating Upgrade Emergency Works 2024",
      "description": "**Title: 2412 Parteen National School Heating Upgrade Emergency Works 2024**\n\n**Description:**\nParteen National School, a co-educational, mainstream, Catholic primary school located in Kilquane, Parteen, Co. Clare, is seeking a reliable and experienced contractor to undertake an urgent heating upgrade project. The scope of the works includes:\n\n1. **Conversion of Existing Oil Boiler to Natural Gas:**\n   - Replace the existing oil boiler with a new natural gas boiler to ensure a more efficient and environmentally friendly heating system.\n\n2. **Installation of New Gas Fired Burner:**\n   - Install a new gas fired burner that meets current safety standards and efficiency requirements.\n\n3. **New Header Pipework:**\n   - Lay new header pipework to ensure proper distribution of heat throughout the school building.\n\n4. **Pumps, Valves, Actuators, and Presurisation Unit:**\n   - Install new pumps, valves, actuators, and a presurisation unit to maintain optimal system pressure and performance.\n\n5. **Gas Safety System:**\n   - Implement a comprehensive gas safety system to ensure the safety of students, staff, and visitors.\n\n6. **New 2-Pipe Heating Distribution System:**\n   - Install a new 2-pipe heating distribution system to enhance the overall efficiency and reliability of the heating system.\n\n7. **Radiators and Radiant Panels:**\n   - Replace existing radiators and install new radiant panels to provide consistent and comfortable heating throughout the school.\n\n8. **Heating Controls:**\n   - Install advanced heating controls to optimize energy usage and maintain a comfortable indoor environment.\n\n9. **Associated Electrical and Builder’s Works:**\n   - Perform all necessary electrical and builder’s works required for the installation of the new heating system.\n\n10. **Redecoration:**\n    - Undertake any necessary redecoration to ensure the new heating system is integrated seamlessly into the existing school environment.\n\n**Key Considerations:**\n- The contractor must have experience in similar school projects, ensuring minimal disruption to the educational environment.\n- The project requires adherence to strict safety protocols, particularly regarding gas installations.\n- The contractor should be able to provide a detailed project timeline and ensure that all works are completed within the specified timeframe.\n- The proposal should include a comprehensive plan for waste management and site cleanup.\n- The contractor must be willing to collaborate with the school administration to address any unforeseen issues promptly.\n\n**Evaluation Criteria:**\n- Technical competence and experience in similar projects.\n- Ability to meet the project timeline and budget constraints.\n- Compliance with safety standards and regulations.\n- Quality of workmanship and materials.\n- Customer service and communication skills.\n- Ability to manage and mitigate potential disruptions to the school’s operations.\n\nBy selecting a contractor who meets these criteria, Parteen National School aims to ensure a safe, efficient, and reliable heating system that supports the educational environment and the well-being of its students and staff.",
      "main_nature": "works",
      "main_classification": "45000000",
      "additional_classifications": [
        "45214200",
        "45311000",
        "45351000",
        "45232141",
        "45331100",
        "45315000",
        "45331000",
        "45330000",
        "45332200"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "200000",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "false",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": "false"
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3664037"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/314364-2024/pdf"
}