{
  "notice_publication_id": "320673-2024",
  "buyer": {
    "official_name": "Office of Public Works (OPW)",
    "email": "lorraine.gantley@opw.ie",
    "legal_type": "cga",
    "activity": "gen-pub",
    "address": {
      "street": "Jonathan Swift Street",
      "city": "Trim",
      "postal_code": "C15 NX36",
      "country": "IRL"
    },
    "website": "https://www.opw.ie",
    "company_id": "4869268D",
    "phone": "353 469422088"
  },
  "procedure": {
    "title": "The provision of Security Awareness Software Services and Support",
    "description": "**Title: The Provision of Security Awareness Software Services and Support**\n\n**Description:**\nThe Office of Public Works (OPW) is seeking a comprehensive security awareness software solution to enhance the cybersecurity posture of its organization. With approximately 2,400 end users operating across 140 sites in Ireland, the OPW requires a robust and context-aware solution to address the evolving landscape of cybersecurity threats. The current email services are provided via Microsoft Office 365, and email security filtering is delivered via Fortra Clearswift. However, the OPW recognizes that users are often the weakest link in the cybersecurity chain, frequently serving as the initial point of contact for bad actors to bypass security controls and gain access to the organization's network.\n\nThe proposed solution should focus on providing real-time and context-based nudges within email, browsers, and other end-user services to assist users in making informed decisions about cybersecurity. This approach aims to augment traditional formal cybersecurity training programs, which can sometimes result in resistance or negative sentiment due to the lack of available time or procrastination in completing required training modules.\n\nKey requirements include:\n\n- **Context-Aware Solution:** The solution must be able to provide real-time and context-based nudges to users, ensuring they are informed and motivated to adopt good cyber hygiene practices.\n- **User Engagement:** The system should be designed to engage users effectively, encouraging them to participate actively in cybersecurity efforts without creating resistance or negative sentiment.\n- **Integration:** The solution must integrate seamlessly with existing email services (Microsoft Office 365) and email security filtering systems (Fortra Clearswift).\n- **Mobile Device Support:** The system should support mobile devices exclusively, as a substantial number of end users access email via MS-Office 365 running on Samsung/Android devices.\n- **Scalability:** The solution must be scalable to accommodate the OPW's large user base and diverse operational environment.\n- **Continuous Monitoring:** The system should continuously monitor and adapt to the evolving cybersecurity landscape, ensuring the OPW remains protected against emerging threats.\n\nBy providing a context-aware security awareness solution, the OPW aims to create a more informed and vigilant user base, thereby enhancing the overall cybersecurity posture of the organization. The successful bidder will be responsible for delivering a comprehensive and effective security awareness program that aligns with the OPW's strategic objectives in managing flood risk, heritage properties, and other critical public services.",
    "identifier": "c322b692-598a-4aa5-a2fc-39e099780fda",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-06-14+01:00",
    "deadline_time": "12:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "48730000",
    "additional_classifications": [
      "48900000",
      "48931000",
      "48900000",
      "48931000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "70000",
    "currency": "",
    "maximum_value": "70000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "false",
    "open_tender_date": "2024-06-14+01:00",
    "open_tender_time": "12:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3679321"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "The provision of Security Awareness Software Services and Support",
      "description": "**Title:** The Provision of Security Awareness Software Services and Support\n\n**Description:**\nThe Office of Public Works (OPW) is seeking a provider to deliver comprehensive Security Awareness Software Services and Support. The OPW is a major Irish government agency responsible for managing the country's property portfolio, including hundreds of government offices and police properties, overseeing National Monuments, and directly managing some heritage properties. It is also the lead State engineering agency, with a special focus on flood risk management.\n\nThe OPW has approximately 2,400 end users operating across 140 sites across Ireland. Email services are provided via Microsoft Office 365, and email security filtering is delivered via Fortra Clearswift. The majority of end users access email via an Outlook client or a browser, but a substantial number use mobile devices exclusively (Microsoft Office 365 running on Samsung/Android).\n\nGiven the evolving landscape of cybersecurity, the OPW recognizes the constant need to protect the organization from threats to people, data, and reputation. Effective cybersecurity is a chain involving ICT systems, software, networks, and most importantly, the people who interact with this technology. The general consensus is that users are considered one of the weakest links in the cybersecurity chain and are frequently the initial point of contact that can allow bad actors to bypass security controls and gain a foothold in the organization’s network.\n\nSecurity awareness training is a key element in preventing security incidents and mitigating risks associated with human behavior. Traditionally, this tends to focus on forcing people to adopt safer behaviors and requiring a determined effort to change their actions, often using fear as a motivating factor. However, this approach can result in resistance or negative sentiment towards the program itself, with users citing the lack of available time to participate in such programs and procrastination in completing required training modules.\n\nThe OPW seeks to augment traditional formal cybersecurity training programs with an alternative tactic of adjusting user behavior using more real-time and context-based nudges on devices, within email and browsers. This approach aims to assist users in making the right decisions when it matters, resulting in a more informed user and a better training program overall.\n\nThe OPW is looking for a context-aware solution to provide this functionality in respect of its Internet browsing, email, and other end-user services. The ideal solution should integrate seamlessly with existing systems, offer real-time and context-based nudges, and enhance user awareness to prevent security breaches. The provider must demonstrate a deep understanding of cybersecurity best practices, user behavior, and the ability to deliver a tailored solution that aligns with the OPW's specific needs and operational environment.\n\n**Key Requirements:**\n- **Context-Aware Solution:** The provider must offer a context-aware solution that integrates with Microsoft Office 365, Fortra Clearswift, and other existing email security systems.\n- **Real-Time Nudges:** The solution should provide real-time and context-based nudges to assist users in making informed decisions about cybersecurity.\n- **User Engagement:** The provider must demonstrate strategies to engage users effectively, ensuring high participation rates and positive sentiment towards the security awareness program.\n- **Integration:** The solution should integrate seamlessly with the OPW's existing ICT systems, including email clients and browsers.\n- **Customization:** The provider must be able to tailor the solution to meet the specific needs of the OPW, including its unique operational environment and user behaviors.\n- **Cybersecurity Expertise:** The provider should have extensive experience in cybersecurity and a deep understanding of best practices in security awareness training.\n- **Scalability:** The solution must be scalable to accommodate the OPW's large user base and diverse operational requirements.\n\nBy selecting a suitable bidder, the OPW aims to enhance its cybersecurity posture, improve user awareness, and mitigate risks associated with human behavior. The successful provider will play a critical role in supporting the OPW's mission to protect its assets and ensure the security of its operations.",
      "main_nature": "supplies",
      "main_classification": "48730000",
      "additional_classifications": [
        "48900000",
        "48931000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "70000",
        "currency": "",
        "maximum_value": "70000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3679321"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/320673-2024/pdf"
}