{
  "notice_publication_id": "326145-2024",
  "buyer": {
    "official_name": "Galway County Council",
    "email": "procurement@galwaycoco.ie",
    "legal_type": "body-pl-la",
    "activity": "gen-pub",
    "address": {
      "street": "Áras an Chontae",
      "city": "Galway",
      "postal_code": "H91 H6KX",
      "country": "IRL"
    },
    "website": "https://www.galway.ie/en/",
    "company_id": "0022194O",
    "phone": "+353 (0)91 509000"
  },
  "procedure": {
    "title": "Supply of Hazardous Materials Support Vehicle",
    "description": "**Enhanced Proposal Description:**\n\nGalway County Council, the local authority responsible for the administration of County Galway, is seeking tenders for the supply of one Hazardous Material Support Unit. The successful bidder will be required to provide a vehicle that meets the stringent specifications outlined in the attached document, ensuring it is equipped to handle and transport hazardous materials safely and efficiently. The vehicle must comply with all relevant health, safety, and environmental regulations.\n\n**Key Requirements:**\n\n1. **Vehicle Specifications:**\n   - The vehicle must be designed to handle hazardous materials, including chemicals, fuels, and other potentially dangerous substances.\n   - It should be equipped with appropriate containment systems to prevent leaks or spills.\n   - The vehicle must have a robust construction to withstand various environmental conditions.\n\n2. **Safety Features:**\n   - The vehicle should be fitted with advanced safety features such as emergency shut-off valves, pressure relief systems, and protective gear for operators.\n   - It must comply with all relevant safety standards and regulations, including those set by the European Union and Irish authorities.\n\n3. **Operational Capabilities:**\n   - The vehicle should be capable of operating in a variety of settings, including urban and rural areas.\n   - It must have sufficient storage capacity for the required hazardous materials and equipment.\n\n4. **Maintenance and Support:**\n   - The bidder should provide a comprehensive maintenance plan, including regular inspections and servicing.\n   - They must also offer technical support and training for the operators to ensure they are equipped to handle the vehicle safely.\n\n5. **Environmental Considerations:**\n   - The vehicle should be designed with environmental sustainability in mind, minimizing its carbon footprint and impact on the environment.\n   - It must adhere to all relevant environmental regulations, including those related to waste management and disposal.\n\n6. **Documentation and Compliance:**\n   - The bidder must provide detailed documentation of the vehicle's specifications, safety features, and operational capabilities.\n   - They should also demonstrate compliance with all relevant laws, regulations, and standards.\n\n7. **Warranty and After-Sales Service:**\n   - The bidder should offer a comprehensive warranty for the vehicle, covering all major components and systems.\n   - They must also provide reliable after-sales service, including prompt repair and replacement of parts.\n\n8. **Certifications and Qualifications:**\n   - The bidder should hold relevant certifications and qualifications, such as ISO 9001 for quality management and ISO 14001 for environmental management.\n   - They must demonstrate their expertise in handling hazardous materials and providing safe transportation solutions.\n\n9. **Pricing and Payment Terms:**\n   - The bidder should provide a detailed breakdown of the costs involved in supplying the Hazardous Material Support Unit.\n   - They must also specify their payment terms, including any discounts for early payment or bulk orders.\n\n10. **Timeline and Delivery:**\n    - The bidder should provide a clear timeline for the delivery of the vehicle, including any milestones and deadlines.\n    - They must ensure that the vehicle is delivered on time and in the specified condition.\n\nBy addressing these key requirements, bidders can demonstrate their ability to supply a vehicle that meets the stringent needs of Galway County Council for handling hazardous materials safely and efficiently.",
    "identifier": "c294eb6b-e7e8-4e93-8005-decb1be9015e",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-07-30+01:00",
    "deadline_time": "16:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "35000000",
    "additional_classifications": [
      "35100000",
      "35110000",
      "35111000",
      "35112000",
      "34000000",
      "34144210",
      "34144213",
      "35100000",
      "35110000",
      "35111000",
      "35112000",
      "34000000",
      "34144210",
      "34144213"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "215000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-08-06+01:00",
    "open_tender_time": "00:00:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3696972"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Supply of Hazardous Materials Support Vehicle",
      "description": "**Title: Supply of Hazardous Materials Support Vehicle**\n\n**Description:**\nGalway County Council, the local authority responsible for the administration of County Galway, seeks tenders for the supply of one Hazardous Material Support Unit. The vehicle must comply with the attached specification, which includes detailed requirements for safety, functionality, and operational efficiency. The successful bidder will be expected to provide a vehicle that is capable of handling hazardous materials in a manner that ensures the safety of both the public and the environment. The vehicle should be equipped with necessary safety features, such as containment systems, ventilation systems, and protective gear for the crew. Additionally, the bidder should demonstrate their ability to deliver the vehicle within the specified timeframe and provide comprehensive after-sales support, including maintenance and training services. The council is committed to ensuring that the selected vehicle meets all relevant regulatory standards and contributes to the overall safety and well-being of the community.\n\n**Key Requirements:**\n- **Safety Features:** The vehicle must be equipped with robust containment systems to prevent leakage or spillage of hazardous materials.\n- **Operational Efficiency:** The vehicle should be designed for easy operation and maintenance, ensuring minimal downtime.\n- **Regulatory Compliance:** The vehicle must comply with all relevant local, national, and international regulations regarding the handling of hazardous materials.\n- **After-Sales Support:** The bidder should provide comprehensive maintenance services, training for the crew, and any necessary updates to ensure the vehicle remains operational and compliant with regulations.\n- **Delivery Timeline:** The vehicle must be delivered within the specified timeframe to ensure minimal disruption to council operations.\n- **Environmental Considerations:** The vehicle should be designed with environmental sustainability in mind, minimizing its ecological footprint.\n\n**Evaluation Criteria:**\n1. **Technical Specifications:** Compliance with the attached specification.\n2. **Safety Record:** The bidder's history of supplying safe and reliable vehicles.\n3. **Operational Efficiency:** The vehicle's design for easy operation and maintenance.\n4. **Regulatory Compliance:** Adherence to all relevant regulations.\n5. **After-Sales Support:** Quality of maintenance services and training provided.\n6. **Delivery Timeline:** Ability to meet the specified delivery date.\n7. **Environmental Sustainability:** Measures taken to minimize the vehicle's ecological impact.\n\nBy responding to this tender, bidders will be demonstrating their capability to provide a safe, efficient, and environmentally responsible hazardous materials support vehicle that meets the needs of Galway County Council.",
      "main_nature": "supplies",
      "main_classification": "35000000",
      "additional_classifications": [
        "35100000",
        "35110000",
        "35111000",
        "35112000",
        "34000000",
        "34144210",
        "34144213"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "0",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "tp-abil",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3696972"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/326145-2024/pdf"
}