{
  "notice_publication_id": "327786-2024",
  "buyer": {
    "official_name": "Donegal County Council_1193",
    "email": "procurement@donegalcoco.ie",
    "legal_type": "la",
    "activity": "gen-pub",
    "address": {
      "street": "County House",
      "city": "Lifford",
      "postal_code": "F93 Y622",
      "country": "IRL"
    },
    "website": "https://www.donegalcoco.ie",
    "company_id": "1193",
    "phone": "+353 749153900"
  },
  "procedure": {
    "title": "Doengal Co. Co. Engineering Consultancy Services for Principal Inspection and Special Inspection of Harry Blaney (Mulroy Bay) Bridge",
    "description": "**Title:** Donegal County Council Engineering Consultancy Services for Principal Inspection and Special Inspection of Harry Blaney (Mulroy Bay) Bridge\n\n**Description:**\nDonegal County Council, the local authority responsible for the upkeep and improvement of roads, infrastructure, and public services in County Donegal, requires the services of a suitably qualified consultant engineer to carry out a repeat Principal Inspection of the Harry Blaney (Mulroy Bay) Bridge on the L1050 roadway near Carrigart. The Principal Inspection is a critical component of the bridge's maintenance schedule, ensuring the structural integrity and safety of the bridge for public use.\n\nIn addition to the Principal Inspection, the Council also requires a schedule of testing to be brought forward for a Special Inspection. This Special Inspection will involve detailed assessments and evaluations to identify any potential issues or defects that may require immediate attention. The consultant engineer must have extensive experience in bridge inspections, including the ability to conduct thorough visual examinations, structural assessments, and any necessary testing to ensure the bridge meets all safety standards.\n\nThe successful bidder will be expected to provide a comprehensive report detailing the findings of both the Principal and Special Inspections. This report should include recommendations for any necessary repairs or maintenance work, as well as a timeline for implementation. The consultant engineer must also demonstrate their ability to work collaboratively with the Council's engineering team and other stakeholders to ensure that the inspection process is efficient and effective.\n\n**Key Requirements:**\n- **Qualifications:** The consultant engineer must hold relevant qualifications in civil engineering or a related field.\n- **Experience:** The bidder should have extensive experience in conducting bridge inspections, including Principal and Special Inspections.\n- **Skills:** The consultant engineer must possess strong analytical and problem-solving skills, as well as the ability to communicate complex technical information clearly.\n- **Equipment:** The bidder should have access to the necessary equipment and technology for conducting thorough inspections, including cameras, drones, and other specialized tools.\n- **Report Submission:** The consultant engineer must be able to provide a detailed, well-structured report that meets the Council's requirements.\n\nBy submitting a proposal, the bidder should clearly outline their approach to the inspection, including the methodology they will use, the resources they will deploy, and the expected outcomes. The proposal should also include any relevant case studies or examples of previous work that demonstrate their expertise in bridge inspections.\n\nDonegal County Council is committed to ensuring the safety and integrity of its infrastructure, and the successful bidder will play a crucial role in maintaining the structural integrity of the Harry Blaney (Mulroy Bay) Bridge. The Council looks forward to receiving proposals from suitably qualified consultant engineers who can meet these critical requirements.",
    "identifier": "d94ec124-ccfe-4f70-aa2c-51403a5db645",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-07-01+01:00",
    "deadline_time": "16:00:00+01:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "71311000",
    "additional_classifications": [
      "71310000",
      "71312000",
      "71310000",
      "71312000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "1",
    "currency": "",
    "maximum_value": "1"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-07-01+01:00",
    "open_tender_time": "16:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3710448"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Doengal Co. Co. Engineering Consultancy Services for Principal Inspection and Special Inspection of Harry Blaney (Mulroy Bay) Bridge",
      "description": "**Title:** Donegal County Council Engineering Consultancy Services for Principal Inspection and Special Inspection of Harry Blaney (Mulroy Bay) Bridge\n\n**Description:**\nDonegal County Council, the local authority responsible for the maintenance and upkeep of public infrastructure in County Donegal, Ireland, requires the services of a suitably qualified consultant engineer to carry out a repeat Principal Inspection of the Harry Blaney (Mulroy Bay) Bridge on the L1050 roadway near Carrigart. The Principal Inspection is a critical component of ensuring the structural integrity and safety of the bridge, and the selected consultant must have extensive experience in bridge inspections and a deep understanding of relevant engineering standards and regulations.\n\nIn addition to the Principal Inspection, the successful bidder will also be required to develop and implement a schedule of testing for a Special Inspection of the bridge. This Special Inspection will involve detailed assessments of the bridge's condition, including but not limited to, structural analysis, material testing, and evaluation of any potential defects or vulnerabilities. The consultant must demonstrate expertise in specialized inspection techniques and methodologies to ensure comprehensive and accurate results.\n\nThe consultant engineer will be expected to provide detailed reports and recommendations following both the Principal and Special Inspections. These reports should include findings, conclusions, and any necessary repair or maintenance recommendations to ensure the continued safe operation of the bridge.\n\nDonegal County Council is committed to ensuring the highest standards of public safety and infrastructure maintenance. Therefore, the selected consultant must have a proven track record of delivering high-quality engineering services, adhering to all relevant safety protocols, and maintaining confidentiality in their assessments.\n\nThe tender process will evaluate bidders based on their technical competence, experience in similar projects, and ability to meet the specified requirements within the given timeframe. The successful bidder will be required to provide a comprehensive proposal outlining their approach, methodology, and timeline for completing the inspections and reporting on their findings.\n\n**Key Requirements:**\n- **Principal Inspection:** Conduct a thorough repeat Principal Inspection of the Harry Blaney (Mulroy Bay) Bridge.\n- **Special Inspection:** Develop and implement a detailed schedule of testing for a Special Inspection of the bridge.\n- **Reporting:** Provide detailed reports following both inspections, including findings, conclusions, and recommendations for any necessary repairs or maintenance.\n- **Technical Competence:** Demonstrate extensive experience in bridge inspections and adherence to relevant engineering standards and regulations.\n- **Methodology:** Outline a clear and comprehensive methodology for both inspections, including specialized inspection techniques and methodologies.\n- **Timeline:** Meet the specified requirements within the given timeframe.\n- **Safety Protocols:** Adhere to all relevant safety protocols during the inspections.\n- **Confidentiality:** Maintain confidentiality in their assessments.\n\nBy responding to this tender, bidders must demonstrate their ability to meet these critical requirements and contribute to the ongoing maintenance and safety of Donegal County Council's infrastructure.",
      "main_nature": "services",
      "main_classification": "71311000",
      "additional_classifications": [
        "71310000",
        "71312000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "1",
        "currency": "",
        "maximum_value": "1"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "tp-abil",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3710448"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/327786-2024/pdf"
}