{
  "notice_publication_id": "352717-2024",
  "buyer": {
    "official_name": "Kildare and Wicklow Education and Training Board",
    "email": "procurement@kwetb.ie",
    "legal_type": "body-pl-cga",
    "activity": "education",
    "address": {
      "street": "Level 5, Áras Chill Dara",
      "city": "Naas",
      "postal_code": "W91X77F",
      "country": "IRL"
    },
    "website": "https://kwetb.ie/",
    "company_id": "20083465",
    "phone": "45988000"
  },
  "procedure": {
    "title": "Invitation to Tender for Contractor for Blessington CC, EWS2024 Fire Alarm Installation upgrade",
    "description": "**Invitation to Tender for Contractor for Blessington CC, EWS2024 Fire Alarm Installation Upgrade**\n\nOn behalf of Blessington Community College and the Kildare and Wicklow Education and Training Board (KWETB), you are hereby invited to tender for the upgrade of the Fire Alarm System at Blessington Community College, Blessington, Co. Wicklow. This project involves the full site upgrade of the fire alarm installation as an addressable analogue system and the networking of the existing outbuildings to complete the integration of the system. The goal is to achieve a streamlined system for maintenance and operation, fully compliant with I.S.3218:2013+A1:2019.\n\nKWETB is a leading provider of education, training, and youth services in Kildare and Wicklow, supporting over 25,000 learners annually through various educational programs, including post-primary, post-leaving certificate, apprenticeships, and adult further education. Our commitment to excellence and safety is evident in our ongoing investments in infrastructure and services.\n\nThe successful bidder will be expected to demonstrate expertise in fire alarm system upgrades, adherence to relevant safety standards, and the ability to integrate the new system seamlessly with existing infrastructure. The contractor must also ensure that all work is carried out with minimal disruption to the educational activities of the college.\n\n**Key Requirements:**\n- Full site upgrade of the fire alarm installation as an addressable analogue system.\n- Networking of existing outbuildings for complete integration.\n- Compliance with I.S.3218:2013+A1:2019.\n- Streamlined system for maintenance and operation.\n- Minimal disruption to educational activities.\n- Demonstrated expertise in fire alarm system upgrades.\n- Ability to integrate the new system seamlessly with existing infrastructure.\n\n**Submission Guidelines:**\nPlease submit your tender proposal electronically to [KWETB's designated email address] by [specified deadline]. The proposal should include detailed information about your company, relevant experience, methodology, timeline, and any supporting documentation.\n\n**Evaluation Criteria:**\nProposals will be evaluated based on the contractor's experience in similar projects, their ability to meet the specified requirements, and their proposed methodology for ensuring compliance with safety standards and minimal disruption to college activities.\n\n**Contact Information:**\nFor any queries or additional information, please contact [KWETB's procurement department] at [designated contact email] or [designated contact phone number].\n\nBy participating in this tender process, you will be contributing to the enhancement of safety and educational facilities at Blessington Community College, aligning with KWETB's mission to provide high-quality and innovative education, training, and youth services.",
    "identifier": "4ec270b4-4952-4ecd-8655-84f9a51c1aa8",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-07-01+01:00",
    "deadline_time": "17:00:00+01:00"
  },
  "purpose": {
    "main_nature": "works",
    "main_classification": "45214220",
    "additional_classifications": [
      "45312100",
      "51700000",
      "31518200",
      "45312100",
      "51700000",
      "31518200"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "140000",
    "currency": "",
    "maximum_value": "140000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-07-01+01:00",
    "open_tender_time": "17:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3727680"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Invitation to Tender for Contractor for Blessington CC, EWS2024 Fire Alarm Installation upgrade",
      "description": "**Invitation to Tender for Contractor for Blessington CC, EWS2024 Fire Alarm Installation Upgrade**\n\n**On Behalf of Blessington Community College and Kildare and Wicklow Education and Training Board (KWETB)**\n\nYou are hereby invited to tender for the upgrade of the Fire Alarm System at Blessington Community College, Blessington, Co. Wicklow. This project involves the full site upgrade of the fire alarm installation as an addressable analogue system and the networking of the existing outbuildings to complete integration of the system, allowing for a streamlined system for maintenance and operation in full compliance with I.S.3218:2013+A1:2019.\n\n**Background and Context:**\nKWETB is a registered charity dedicated to providing high-quality and innovative education, training, and youth services in Kildare and Wicklow. We support over 25,000 learners across the communities of Kildare and Wicklow, employing over 2,200 people in various roles. Our mission is to provide accessible, responsive education and training that promotes excellence, equality, and social inclusion.\n\n**Project Requirements:**\n- **Scope of Work:** The successful bidder will be responsible for the full site upgrade of the fire alarm system at Blessington Community College, ensuring compliance with I.S.3218:2013+A1:2019.\n- **System Upgrade:** The upgrade will involve converting the existing fire alarm system to an addressable analogue system.\n- **Networking of Outbuildings:** The existing outbuildings will be networked to complete the integration of the system.\n- **Maintenance and Operation:** The system must be designed for streamlined maintenance and operation.\n- **Quality Assurance:** The contractor must demonstrate a proven track record in delivering high-quality fire alarm system upgrades, with a focus on safety and compliance.\n\n**Evaluation Criteria:**\n- **Technical Competence:** The bidder's experience in fire alarm system upgrades, particularly in educational settings.\n- **Safety Record:** The bidder's safety record and compliance with relevant standards.\n- **Project Management:** The bidder's ability to manage the project timeline, budget, and resources effectively.\n- **Quality Assurance:** The bidder's quality assurance processes and ability to deliver a high-quality system.\n- **Cost and Value for Money:** The overall cost of the project and value for money offered by the bidder.\n\n**Submission Requirements:**\n- **Tender Documents:** A detailed proposal outlining the bidder's approach, methodology, and timeline for the project.\n- **Technical Specifications:** A comprehensive technical specification detailing the proposed system and its compliance with I.S.3218:2013+A1:2019.\n- **Safety Plan:** A safety plan outlining the measures to be taken during the installation process.\n- **References:** References from previous clients, particularly in educational settings.\n- **Certifications:** Relevant certifications and qualifications demonstrating the bidder's competence in fire alarm system upgrades.\n\n**Timeline:**\n- **Tender Submission Deadline:** [Insert Date]\n- **Evaluation Period:** [Insert Date]\n- **Contract Award:** [Insert Date]\n\n**Contact Information:**\nFor any queries or additional information, please contact KWETB at [Insert Contact Information]. We look forward to receiving your proposal and working with a suitable bidder to ensure the successful completion of this project.",
      "main_nature": "works",
      "main_classification": "45214220",
      "additional_classifications": [
        "45312100",
        "51700000",
        "31518200"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "140000",
        "currency": "",
        "maximum_value": "140000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3727680"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/352717-2024/pdf"
}