{
  "notice_publication_id": "363049-2024",
  "buyer": {
    "official_name": "Maynooth University",
    "email": "procurement@mu.ie",
    "legal_type": "body-pl",
    "activity": "education",
    "address": {
      "street": "Maynooth University",
      "city": "Maynooth",
      "postal_code": "W23",
      "country": "IRL"
    },
    "website": "https://www.maynoothuniversity.ie/",
    "company_id": "01",
    "phone": "+35314747679"
  },
  "procedure": {
    "title": "Chromatography System",
    "description": "**Title:** Chromatography System for Advanced Research and Education\n\n**Description:**\nMaynooth University, a constituent university of the National University of Ireland, is seeking a comprehensive Chromatography System to support its cutting-edge research and educational activities. The system should comprise a computer-controlled chromatography unit, a multi-wavelength absorbance detector, an automated fraction collector, pH and conductivity monitors, all necessary column holders, switching valves, tubing, and associated chromatography columns. The system must have robust data processing and data presentation capabilities to facilitate seamless integration with existing laboratory equipment. Once installed, the system should enable ready-to-go protein purification, enhancing the university's capabilities in biochemistry, molecular biology, and related fields.\n\n**Key Requirements:**\n- **System Components:** Computer-controlled chromatography unit, multi-wavelength absorbance detector, automated fraction collector, pH and conductivity monitors, column holders, switching valves, tubing, and associated chromatography columns.\n- **Data Processing:** The system must have advanced data processing capabilities to handle complex chromatographic data.\n- **Data Presentation:** The system should provide intuitive data presentation tools for easy interpretation of results.\n- **Integration:** The system should be compatible with existing laboratory equipment to ensure smooth integration.\n- **Protein Purification:** The system should enable ready-to-go protein purification processes, supporting advanced research in biochemistry and molecular biology.\n- **Reliability and Durability:** The system must be designed for high reliability and durability to withstand frequent use in a research environment.\n\n**Additional Considerations:**\n- **User-Friendly Interface:** The system should have a user-friendly interface to facilitate easy operation by researchers and students.\n- **Maintenance and Support:** The bidder should provide comprehensive maintenance and support services to ensure the system operates at optimal levels throughout its lifespan.\n- **Training and Documentation:** The bidder should offer training sessions and detailed documentation to ensure that users can effectively utilize the system.\n\nBy selecting a bidder who meets these stringent requirements, Maynooth University aims to enhance its research capabilities, support advanced educational programs, and contribute to the advancement of scientific knowledge in the fields of biochemistry and molecular biology.",
    "identifier": "55ed9edf-6033-4511-bdc3-58dc60798937",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-07-22+01:00",
    "deadline_time": "12:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "38000000",
    "additional_classifications": [
      "38300000",
      "38340000",
      "38400000",
      "38430000",
      "38300000",
      "38340000",
      "38400000",
      "38430000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "100000",
    "currency": "",
    "maximum_value": "100000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-07-22+01:00",
    "open_tender_time": "12:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3774379"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Chromatography System",
      "description": "**Title: Chromatography System for Protein Purification at Maynooth University**\n\n**Description:**\nMaynooth University, a constituent university of the National University of Ireland, is seeking a comprehensive Chromatography System for its research and academic activities. The system should comprise of a computer-controlled chromatography unit, a multi-wavelength absorbance detector, an automated fraction collector, pH and conductivity monitors, all necessary column holders, switching valves, tubing, and associated chromatography columns. The system must have robust data processing and data presentation capabilities to facilitate efficient analysis and presentation of results. Once installed, the system should enable ready-to-go protein purification, supporting the university's research in various fields including life sciences, biochemistry, and molecular biology.\n\n**Key Requirements:**\n1. **Computer-Controlled Chromatography Unit:** The system should be equipped with a user-friendly interface for easy operation and control.\n2. **Multi-Wavelength Absorbance Detector:** Capable of detecting absorbance across multiple wavelengths to provide comprehensive data.\n3. **Automated Fraction Collector:** To efficiently collect and store fractions during the purification process.\n4. **pH and Conductivity Monitors:** To monitor and control the pH and conductivity levels during the purification process.\n5. **Column Holders and Switching Valves:** All necessary components for column management and switching.\n6. **Tubing and Associated Chromatography Columns:** High-quality tubing and columns compatible with the system.\n7. **Data Processing and Presentation Capability:** The system should be able to process and present data in a clear, user-friendly format.\n8. **Integration with Existing Infrastructure:** The system should be compatible with Maynooth University's existing laboratory equipment and software.\n\n**Installation and Support:**\nThe bidder should provide detailed installation instructions and ensure that the system is fully operational upon delivery. Additionally, the bidder should offer comprehensive support, including training for the research team, to ensure seamless integration into the university's research activities.\n\n**Delivery and Warranty:**\nThe bidder should provide a detailed delivery timeline and ensure that the system is delivered within the specified timeframe. A minimum warranty period of two years is required, covering parts and labor for any defects or malfunctions.\n\n**Evaluation Criteria:**\nThe proposal will be evaluated based on the following criteria:\n1. Technical Specifications: Alignment with the required specifications.\n2. Quality of Equipment: High-quality components and robust construction.\n3. Data Processing Capability: Efficiency and user-friendliness of data processing and presentation.\n4. Installation and Support: Comprehensive installation instructions and support services.\n5. Warranty and Maintenance: Length and coverage of the warranty, as well as maintenance requirements.\n6. Cost: Total cost of the system, including installation and support services.\n7. Bidder Experience: Previous experience in supplying similar chromatography systems to academic or research institutions.\n\nBy selecting a bidder who meets these criteria, Maynooth University aims to acquire a state-of-the-art Chromatography System that will significantly enhance its research capabilities in protein purification and related fields.",
      "main_nature": "supplies",
      "main_classification": "38000000",
      "additional_classifications": [
        "38300000",
        "38340000",
        "38400000",
        "38430000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "100000",
        "currency": "",
        "maximum_value": "100000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3774379"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/363049-2024/pdf"
}