{
  "notice_publication_id": "378798-2024",
  "buyer": {
    "official_name": "Commission for Communications Regulation",
    "email": "karen.cumiskey@comreg.ie",
    "legal_type": "body-pl",
    "activity": "gen-pub",
    "address": {
      "street": "ComReg One Dockland Central, Guild Street.",
      "city": "Dublin",
      "postal_code": "D01 E4X0",
      "country": "IRL"
    },
    "website": "https://www.comreg.ie/",
    "company_id": "9614619A",
    "phone": "0035318049600"
  },
  "procedure": {
    "title": "ComReg T20223 Request for Tenders (RFT) for the provision of Technical Process Lead for Nuisance Communications Industry Forum (NCIF) to Commission for Communications Regulation (ComReg).",
    "description": "**ComReg T20223 Request for Tenders (RFT) for the provision of Technical Process Lead for Nuisance Communications Industry Forum (NCIF) to Commission for Communications Regulation (ComReg).**\n\n**Description:**\nComReg, the statutory body responsible for the regulation of the electronic communications sector and the postal sector in Ireland, is seeking a Technical Process Lead for the Nuisance Communications Industry Forum (NCIF). The Services comprise assistance to ComReg, if required, in relation to the creation of a NCIF to facilitate the implementation of the Decision Instruments (DIs) published in response to Consultation 23/52. This role is crucial for ensuring effective regulation and management of nuisance communications, which includes activities such as spam, unwanted calls, and other forms of unsolicited communication.\n\n**Key Responsibilities:**\n- **Creation of NCIF:** Assist ComReg in establishing and managing the NCIF, ensuring it is a functional and effective platform for addressing nuisance communications.\n- **Implementation of DIs:** Provide technical support for the implementation of Decision Instruments (DIs) related to nuisance communications, as outlined in Consultation 23/52.\n- **Regulatory Compliance:** Ensure all activities and decisions made within the NCIF align with relevant Irish and EU legislation, including the Communications Regulation Act, 2002.\n- **Collaboration with Stakeholders:** Work closely with various stakeholders, including industry representatives, consumer groups, and regulatory bodies, to ensure a collaborative approach to addressing nuisance communications.\n- **Technical Expertise:** Provide specialized technical expertise to support the development and implementation of strategies to mitigate nuisance communications.\n\n**Submission Requirements:**\n- Tenderers must upload all Tender Application Documents into one ZIP folder, as recommended by eTenders.\n- The estimated value of the contract is approximately €187,200 for the initial one-year term, with an option to extend for an additional year, potentially reaching a total value of approximately €374,400. However, this figure is an estimate based on current and future expected usage.\n\n**Eligibility Criteria:**\n- Bidders should have extensive experience in managing and leading technical processes related to telecommunications and regulatory compliance.\n- Demonstrated expertise in creating and managing industry forums or similar regulatory bodies.\n- Strong understanding of Irish and EU telecommunications regulations, particularly those related to nuisance communications.\n- Ability to collaborate effectively with diverse stakeholders, including industry representatives and consumer groups.\n\n**Evaluation Criteria:**\n- Technical Competence: The bidder's ability to provide specialized technical expertise and manage the creation and implementation of the NCIF.\n- Regulatory Knowledge: The bidder's understanding of Irish and EU telecommunications regulations, particularly those related to nuisance communications.\n- Collaboration Skills: The bidder's ability to work effectively with various stakeholders to achieve regulatory goals.\n- Past Experience: The bidder's track record in managing similar technical processes and regulatory bodies.\n\nBy submitting a proposal, bidders must demonstrate their ability to meet these criteria and effectively support ComReg in its efforts to regulate and manage nuisance communications in Ireland. The successful bidder will play a crucial role in ensuring the effective implementation of regulatory decisions and strategies aimed at mitigating nuisance communications.",
    "identifier": "dd73a445-c646-4c9c-b511-d956ead7fa6e",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-07-26+01:00",
    "deadline_time": "17:00:00+01:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "98110000",
    "additional_classifications": [],
    "place_of_performance": "IRL"
  },
  "value": {
    "estimated_value": "374400",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-07-26+01:00",
    "open_tender_time": "17:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3839663"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "ComReg T20223 Request for Tenders (RFT) for the provision of Technical Process Lead for Nuisance Communications Industry Forum (NCIF) to Commission for Communications Regulation (ComReg).",
      "description": "**Enhanced Proposal Description:**\n\nThe Commission for Communications Regulation (ComReg) is the statutory body responsible for the regulation of the electronic communications sector in Ireland, including telecommunications, radiocommunications, broadcasting transmission, and the postal sector. Established on 1 December 2002, ComReg operates under Irish and EU legislation, facilitating competition, protecting consumers, and encouraging innovation in the communications industry.\n\nComReg is seeking a Technical Process Lead for the Nuisance Communications Industry Forum (NCIF) to assist in the implementation of Decision Instruments (DIs) published in response to Consultation 23/52. The successful bidder will provide technical assistance to ComReg, if required, in creating the NCIF. This role is crucial for facilitating the effective management and regulation of nuisance communications, ensuring compliance with regulatory standards, and promoting a fair and competitive environment for all stakeholders.\n\nKey responsibilities of the Technical Process Lead include:\n\n- Assisting ComReg in the creation and management of the NCIF.\n- Providing technical expertise to implement the DIs related to nuisance communications.\n- Collaborating with ComReg to ensure compliance with regulatory requirements.\n- Facilitating industry engagement and cooperation to address nuisance communications issues.\n- Supporting the development of strategies to mitigate nuisance communications.\n\nThe estimated value of the contract is approximately €187,200 for the initial one-year term, with an option to extend for an additional year, potentially reaching a total value of approximately €374,400. This contract is essential for ComReg's ongoing efforts to regulate and manage the electronic communications sector effectively.\n\nTo submit a tender application, bidders must upload all required documents into one ZIP folder as recommended by eTenders. The procurement documentation, including the RFT document, can be found on eTenders.gov.ie under reference CFT 3839663.\n\nComReg is committed to fostering a competitive and innovative environment in the communications sector. The successful bidder will play a critical role in supporting this mission by providing high-quality technical expertise and assistance in managing nuisance communications.",
      "main_nature": "services",
      "main_classification": "98110000",
      "additional_classifications": [],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "374400",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3839663"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/378798-2024/pdf"
}