{
  "notice_publication_id": "40037-2024",
  "buyer": {
    "official_name": "Health Service Executive (HSE)",
    "email": "procurement.helpdesk@hse.ie",
    "legal_type": "body-pl-cga",
    "activity": "health",
    "address": {
      "street": "Oak House, Millennium Park Naas Co. Kildare",
      "city": "Kildare",
      "postal_code": "RE",
      "country": "IRL"
    },
    "website": "https://www.hse.ie",
    "company_id": "0043024G",
    "phone": "01 15119700"
  },
  "procedure": {
    "title": "Delivery of Hyperbaric Oxygen Therapy (HBOT).",
    "description": "**Title:** Delivery of Hyperbaric Oxygen Therapy (HBOT) Services\n\n**Description:**\n\nThe Health Service Executive (HSE) hereby invites suitably qualified and experienced service providers to submit tenders for the provision of Hyperbaric Oxygen Therapy (HBOT) services in the greater Dublin area. The successful bidder will be responsible for delivering high-quality HBOT services to patients in need, ensuring compliance with the highest clinical and professional standards.\n\n**Key Requirements:**\n- **Service Delivery:** The bidder must have extensive experience in providing HBOT services, with a proven track record of delivering safe and effective treatments.\n- **Operational Capacity:** The bidder should have the necessary infrastructure and resources to operate in multiple locations, including St Luke’s Radiation Oncology Network (SLRON) sites at St Luke’s Hospital Rathgar, St James’s Hospital, and Beaumont Hospital.\n- **Collaboration:** The bidder is expected to work closely with SLRON, which operates from three Dublin locations and provides a comprehensive range of world-class treatments, including VMAT, SRS, SBRT, TBI, and brachytherapy services.\n- **Clinical Trials Involvement:** The bidder should be willing to participate in clinical trials and collaborate with Clinical Trials Ireland (formerly ICORG) and the Irish Radiation Oncology Radiation Group (IRORG).\n- **Patient Referrals:** The bidder should be prepared to serve patients primarily from the Dublin East, Dublin Midlands, and Dublin North East regions, with referrals also received from around the country for specialist services.\n- **Quality Assurance:** The bidder must adhere to strict quality assurance protocols, ensuring seamless transitions and continuous improvement in service delivery.\n- **Digital Health Integration:** The bidder should be open to utilizing digital health technologies to enhance service delivery, mitigate recruitment challenges, and modernize the provision of mental health care.\n\n**Evaluation Criteria:**\n- **Technical Competence:** The bidder’s technical expertise and experience in providing HBOT services.\n- **Operational Capacity:** The bidder’s ability to operate in multiple locations and manage complex service delivery.\n- **Collaboration and Integration:** The bidder’s willingness to collaborate with SLRON and other healthcare entities.\n- **Quality Assurance:** The bidder’s commitment to maintaining high clinical and professional standards.\n- **Digital Health Integration:** The bidder’s ability to leverage digital health technologies to improve service delivery.\n\n**Submission Requirements:**\n- **Tender Documents:** A comprehensive tender document outlining the bidder’s experience, operational capacity, and approach to service delivery.\n- **Service Plan:** A detailed service plan that includes the bidder’s strategy for delivering HBOT services, ensuring compliance with all relevant standards and regulations.\n- **References:** Contact information for at least two previous clients who can attest to the bidder’s technical competence and service quality.\n\nBy submitting a tender, the bidder acknowledges their understanding of the requirements outlined above and their commitment to delivering high-quality HBOT services that meet the needs of patients in the greater Dublin area. The HSE reserves the right to evaluate tenders based on the criteria outlined above and to select the most suitable bidder for this critical service.",
    "identifier": "3238babc-18b9-455c-88f7-0aa66848368f",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-02-23+00:00",
    "deadline_time": "12:00:00+00:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "33157500",
    "additional_classifications": [
      "33157810",
      "85111700",
      "33157810",
      "85111700"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "440",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-02-23+00:00",
    "open_tender_time": "12:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=2960817"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Delivery of Hyperbaric Oxygen Therapy (HBOT).",
      "description": "The Health Service Executive (HSE) hereby invites suitably qualified and experienced service providers to submit tenders for the provision of Hyperbaric Oxygen Therapy (HBOT) in the greater Dublin area. The HSE is the publicly funded healthcare system in Ireland, responsible for the provision of health and personal social services. It operates under the Department of Health and has a significant presence in Dublin, with various healthcare facilities and networks.\n\nThe tender specifically mentions St Luke’s Radiation Oncology Network (SLRON), which is established in 2010 and operates from three Dublin locations: St Luke’s Hospital Rathgar and St Luke’s Radiation Oncology Centres on the campuses of St James’s and Beaumont Hospitals. SLRON provides a full range of world-class treatments, including VMAT, Intra-cranial Stereotactic (SRS), Extra-cranial Stereotactic (SBRT), Total Body Irradiation (TBI), and the national paediatric radiation oncology service. Additionally, it offers a comprehensive brachytherapy service, including both prostate seeds and ocular brachytherapy. The network is equipped with 14 linear accelerators, 4 in each of the Beaumont Centre and St James’s Centre, and 6 on the Rathgar site. There are 2 CT scanners per centre, and both St. James and Beaumont centres have an MRI unit. St Luke’s hospital houses the brachytherapy and superficial units.\n\nSLRON has a long history of involvement in clinical trials, works closely with Clinical Trials Ireland (formerly ICORG), and is an integral part of the Irish Radiation Oncology Radiation Group (IRORG). The network serves patients primarily from the Dublin East, Dublin Midlands, and Dublin North East regions but also receives referrals from around the country for its specialist services.\n\nThe successful bidder will need to demonstrate experience in delivering HBOT services, particularly in a clinical setting. They should have a proven track record of providing high-quality, patient-centered care. The bidder should also be able to integrate their services seamlessly with existing healthcare networks in Dublin, ensuring continuity of care for patients.\n\nThe HSE is committed to delivering the best possible healthcare services to the Irish population. The successful bidder will be expected to adhere to the highest clinical and professional standards, ensuring that HBOT services are delivered safely and effectively. The bidder should also be able to provide detailed information about their experience, qualifications, and methodologies for delivering HBOT, as well as any relevant certifications or accreditations.\n\nIn addition to technical capabilities, the bidder should demonstrate a strong understanding of the healthcare landscape in Ireland and the specific needs of patients in the greater Dublin area. They should also be able to provide evidence of their ability to work collaboratively with healthcare professionals and organizations, ensuring that HBOT services are integrated into the broader healthcare system.\n\nThe HSE encourages bidders to review the detailed requirements outlined in the tender document and to submit their proposals in accordance with the specified guidelines. The successful bidder will be selected based on their technical capabilities, experience, and ability to meet the specific needs of the HSE and its patients.",
      "main_nature": "supplies",
      "main_classification": "33157500",
      "additional_classifications": [
        "33157810",
        "85111700"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "440",
        "currency": "",
        "maximum_value": "0000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=2960817"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/40037-2024/pdf"
}