{
  "notice_publication_id": "49230-2024",
  "buyer": {
    "official_name": "daa plc",
    "email": "lee.mozley.cw@daa.ie",
    "legal_type": "body-pl-cga",
    "activity": "econ-aff",
    "address": {
      "street": "DAC Three the Green",
      "city": "Dublin",
      "postal_code": "K67 X4X5",
      "country": "IRL"
    },
    "website": "https://daa.ie",
    "company_id": "daa plc",
    "phone": "353-1-944 1111"
  },
  "procedure": {
    "title": "P19740 Airfield Drainage Works - Dublin Airport",
    "description": "**Title: P19740 Airfield Drainage Works - Dublin Airport**\n\n**Description:**\nThe Airfield Drainage Works project, undertaken by daa, a global airport and travel retail group with operations in 15 countries, aims to provide source control for surface water contaminants such as pavement surface de-icing chemicals and aircraft de-icing/anti-icing glycols. Given daa's principal activities include operating and managing Dublin and Cork airports, this project seeks significant upgrades to the infrastructure through a series of drainage system enhancement measures. The project includes the upgrade of existing drainage systems and the construction of additional infrastructure throughout the airfield and wider campus at Dublin Airport. This initiative is crucial for ensuring sustainable and efficient surface water management, aligning with daa's vision of delivering excellence in a sustainable future. The successful bidder will be expected to collaborate with daa's experienced team of 2,800 employees, who are dedicated to ensuring the highest standards in airport management and operation. The project's objectives are to enhance safety, reduce environmental impact, and maintain operational efficiency at Dublin Airport.\n\n**Key Requirements:**\n- **Technical Expertise:** The bidder must demonstrate extensive experience in drainage system upgrades, particularly in airport environments.\n- **Environmental Considerations:** The proposal should highlight strategies for minimizing environmental impact and ensuring compliance with relevant regulations.\n- **Collaboration:** The bidder should be able to work effectively with daa's team, adhering to the company's values of respecting each other's value, being brilliant at the essentials, passing the baton not the buck, and always seeking ways to improve.\n- **Safety Standards:** The bidder must ensure that all work is conducted with the highest safety standards, aligning with daa's commitment to safeguarding civil aviation.\n- **Project Management:** The bidder should provide a comprehensive project management plan, detailing timelines, milestones, and risk mitigation strategies.\n\nBy addressing these key requirements, the bidder will be well-positioned to deliver a successful Airfield Drainage Works project that meets daa's stringent standards and contributes to the company's vision of excellence in a sustainable future.",
    "identifier": "a2a661e9-0248-41d2-ba58-e0ecb961db1f",
    "type": "neg-w-call",
    "accelerated": "false",
    "deadline_date": "2024-03-01+00:00",
    "deadline_time": "16:00:00+00:00"
  },
  "purpose": {
    "main_nature": "works",
    "main_classification": "45200000",
    "additional_classifications": [
      "45235100",
      "44163112",
      "90733500",
      "45111240",
      "45232450",
      "45232452",
      "45235100",
      "44163112",
      "90733500",
      "45111240",
      "45232450",
      "45232452"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "100000000",
    "currency": "",
    "maximum_value": ""
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "",
    "electronic_ordering": "",
    "electronic_payment": ""
  },
  "tendering_process": {
    "procedure_code": "neg-w-call",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "",
    "open_tender_time": "",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=2935093"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "6",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "P19740 Airfield Drainage Works - Dublin Airport",
      "description": "**Title:** P19740 Airfield Drainage Works - Dublin Airport\n\n**Description:**\nThe Airfield Drainage Works project aims to provide effective source control for surface water contaminants, specifically pavement surface de-icing chemicals and aircraft de-icing/anti-icing glycols. Given the current infrastructure shortfall in surface water management capacity at Dublin Airport, this project proposes significant upgrades to the drainage system through a series of enhancement measures. The project includes the upgrade of existing drainage infrastructure and the construction of additional infrastructure throughout the airfield and wider campus at Dublin Airport. This initiative is crucial for maintaining the operational efficiency and environmental sustainability of Dublin Airport, which is a state-owned global airport and travel retail group with businesses in 15 countries. The company, daa, is committed to delivering excellence in a sustainable future and enabling business and connecting lives across the world. The successful bidder will be expected to collaborate with daa's experienced team in airport management and operation, ensuring that the project aligns with daa's vision and purpose while adhering to the highest standards of quality and environmental responsibility. The project's scope includes but is not limited to:\n\n- Upgrading existing drainage systems to enhance their capacity and efficiency.\n- Constructing additional infrastructure to manage surface water contaminants effectively.\n- Ensuring compliance with all relevant environmental regulations and standards.\n- Collaborating with daa's data-driven culture to integrate analytics solutions for real-time monitoring and optimization.\n- Providing regular status updates and engaging with stakeholders to ensure project success.\n\nThe successful bidder should have a proven track record in similar infrastructure projects, particularly in airport environments, and demonstrate expertise in managing complex drainage systems while ensuring minimal disruption to airport operations. The project's timeline and milestones will be closely monitored to ensure timely completion, aligning with daa's commitment to excellence and sustainability.",
      "main_nature": "works",
      "main_classification": "45200000",
      "additional_classifications": [
        "45235100",
        "44163112",
        "90733500",
        "45111240",
        "45232450",
        "45232452"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "100000000",
        "currency": "",
        "maximum_value": ""
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "",
        "electronic_ordering": "",
        "electronic_payment": ""
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": "true"
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=2935093"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/49230-2024/pdf"
}