{
  "notice_publication_id": "495596-2024",
  "buyer": {
    "official_name": "National Disability Authority (NDA)",
    "email": "NDAProcurement@nda.ie",
    "legal_type": "body-pl-cga",
    "activity": "gen-pub",
    "address": {
      "street": "25 Clyde Road Dublin",
      "city": "Dublin",
      "postal_code": "D04 E409",
      "country": "IRL"
    },
    "website": "http://www.nda.ie",
    "company_id": "0000",
    "phone": "353 1 6080 400"
  },
  "procedure": {
    "title": "Web Accessibility Analysis and Monitoring Services",
    "description": "The National Disability Authority (NDA) is an independent statutory body in Ireland, responsible for providing advice on disability policy and practice, and promoting universal design. The NDA is committed to enhancing accessibility and equality, particularly in areas such as employment, health, education, and accessibility. They have published a public tender notice seeking a suitably qualified and experienced supplier to provide robust and transparent website and mobile app accessibility review and reporting services. The successful bidder must have experience in conducting accessibility reviews against all relevant clauses from EN 301 549 v.3.2.1 and/or Success Criteria for the Web Content Accessibility Guidelines 2.1 AA, or equivalent. The bidder must also have detailed knowledge of the EU Web Accessibility Directive and the obligations it places on public bodies. Additionally, knowledge of how monitoring is conducted in other member states/jurisdictions is desirable. The bidder may be asked to provide references from clients for whom they have conducted similar reviews and provided accessibility guidance and supports. The NDA requires a supplier with the technical and professional capacity to conduct reviews to a similar quantity, size, timeframes, and scale as required by the NDA for this contract. The full list of relevant clauses from EN 301 549 can be found on the European Commission website. This tender aims to ensure that the NDA's digital platforms meet the highest standards of accessibility, aligning with the UNCRPD and the rights-based perspective on disability. Suitable bidders should demonstrate a strong understanding of universal design principles and the ability to conduct comprehensive accessibility reviews that meet the EU's web accessibility standards.",
    "identifier": "f3bbb2ee-f18b-4e79-9177-80215e6340d0",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-09-30+01:00",
    "deadline_time": "17:00:00+01:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "72241000",
    "additional_classifications": [],
    "place_of_performance": "anyw-cou"
  },
  "value": {
    "estimated_value": "650000",
    "currency": "",
    "maximum_value": ""
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "false",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-09-30+01:00",
    "open_tender_time": "17:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=4130736"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Web Accessibility Analysis and Monitoring Services",
      "description": "**Enhanced Proposal Description:**\n\nThe National Disability Authority (NDA) is an independent statutory agency established under the Department of Justice, Equality & Law Reform by the National Disability Authority Act 1999. The NDA is responsible for providing policy advice to the Irish Government on disability issues and promoting universal design in Ireland. Their mission is to ensure that the rights and entitlements of people with disabilities are protected, and they undertake research and develop statistical information for the planning, delivery, and monitoring of programs and services for people with disabilities.\n\n**Key Requirements:**\n\n1. **Web Accessibility Analysis and Monitoring Services:**\n   - The NDA requires a suitably qualified and experienced supplier to provide a robust and transparent website and mobile app accessibility review and reporting process.\n   - The services must include conducting In-depth and Simplified Reviews of mobile apps and websites, as specified in Commission Implementing Decision (EU) 2018/1524 under the EU Web Accessibility Directive (WAD).\n   - Tenderers must have experience conducting accessibility reviews against all relevant clauses from EN 301 549 v.3.2.1 and/or Success Criteria for the Web Content Accessibility Guidelines 2.1 AA, or equivalent.\n   - The full list of relevant clauses from EN 301 549 are listed on the European Commission website.\n\n2. **Technical and Professional Capacity:**\n   - Tenderers must have the technical and professional capacity to conduct reviews to a similar quantity, size, timeframes, and scale as required by NDA for the purposes of this contract.\n   - Detailed knowledge of the EU Web Accessibility Directive and the obligations it places on public bodies is essential.\n   - Knowledge of how monitoring is conducted in other member states/jurisdictions is also desirable.\n\n3. **Experience and References:**\n   - Tenderers may be asked to provide references from clients for whom they have conducted reviews and provided accessibility guidance and supports on a similar scale to that set out in this Request for Tender (RFT).\n\n**Ideal Bidders:**\n\n- **Expertise:** The ideal bidder should have extensive experience in conducting web accessibility reviews and monitoring services, particularly against the standards specified in EN 301 549 v.3.2.1 and Web Content Accessibility Guidelines 2.1 AA.\n- **Technical Competence:** The bidder should possess the technical expertise to conduct comprehensive reviews of websites and mobile apps, ensuring compliance with EU regulations.\n- **Professional Capacity:** The bidder must demonstrate the professional capacity to manage large-scale accessibility reviews, meeting the required timeframes and scales.\n- **Knowledge of EU Directives:** The bidder should have a deep understanding of the EU Web Accessibility Directive and its implications for public bodies.\n- **International Experience:** Knowledge of how accessibility monitoring is conducted in other member states/jurisdictions can be an added advantage.\n- **Client References:** The bidder should be able to provide references from previous clients who have benefited from similar accessibility review and monitoring services.\n\nBy focusing on these key requirements and ideal bidder characteristics, you can effectively identify and select suitable bidders for the Web Accessibility Analysis and Monitoring Services tender.",
      "main_nature": "services",
      "main_classification": "72241000",
      "additional_classifications": [],
      "place_of_performance": "IRL",
      "country": "IRL",
      "value": {
        "estimated_value": "650000",
        "currency": "",
        "maximum_value": ""
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "tp-abil",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "false",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=4130736"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/495596-2024/pdf"
}