{
  "notice_publication_id": "520712-2024",
  "buyer": {
    "official_name": "St. Vincent's University Hospital",
    "email": "b.byrne@svuh.ie",
    "legal_type": "body-pl",
    "activity": "health",
    "address": {
      "street": "Elm Park",
      "city": "Dublin",
      "postal_code": "D04 T6F4",
      "country": "IRL"
    },
    "website": "https://www.stvincents.ie/",
    "company_id": "338585",
    "phone": "012214000"
  },
  "procedure": {
    "title": "Provision of a HbA1c Testing Solution with all Associated Consumables, Reagents, Maintenance and Support (on a Cost per Reportable Test basis)",
    "description": "**Title:** Provision of a HbA1c Testing Solution with all Associated Consumables, Reagents, Maintenance, and Support (on a Cost per Reportable Test basis)\n\n**Description:**\n\nSt. Vincent's University Hospital, a leading academic teaching hospital located in Dublin, Ireland, is seeking a comprehensive solution for Haemoglobin A1c (HbA1c) testing. The hospital serves as a regional centre for emergency medicine and medical care, providing inpatient and outpatient services. It is the national referral centre for liver transplantation and adult cystic fibrosis, and it is closely tied to University College Dublin (UCD), serving as a training ground for medical professionals.\n\nThe successful bidder will be required to provide a complete solution for HbA1c testing on a Cost per Reportable Test (CPR) basis. This includes all necessary supplies and services, such as reagents, equipment, maintenance, and support. The solution must cover any associated costs, including third-party reagents and equipment if the original ones do not meet acceptable performance standards. The scope of the solution should also include wash solutions, eluents, buffers, columns, capillaries, filters, calibrators, controls, PCs, printers, interfacing, consumables, spare parts, and other related items.\n\nThe public procurement competition will be conducted in accordance with the open procedure under the European Union (Award of Public Authority Contracts) Regulations 2016. The contract term is expected to be sixty (60) months, with the option to extend for up to twelve (12) months with a maximum of one (1) such extension on the same terms and conditions, subject to the Contracting Authority’s obligations at law.\n\n**Key Requirements:**\n- **Comprehensive Solution:** Provide a complete solution for HbA1c testing, including all necessary supplies and services.\n- **Cost per Reportable Test (CPR):** The solution must be priced on a CPR basis.\n- **Associated Costs:** Cover all associated costs, including third-party reagents and equipment if necessary.\n- **Maintenance and Support:** Include maintenance and support services to ensure continuous operation.\n- **Regulatory Compliance:** Adhere to the European Union (Award of Public Authority Contracts) Regulations 2016.\n- **Contract Term:** The contract term is sixty (60) months, with an option to extend for up to twelve (12) months.\n\nBy providing a robust and reliable HbA1c testing solution, the successful bidder will contribute to the high standard of medical care at St. Vincent's University Hospital, supporting the hospital's mission to provide front-line, acute, chronic, and emergency care.",
    "identifier": "1d43a664-2039-46d3-91ce-e1ba3347aa12",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-11-14+01:00",
    "deadline_time": "12:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "33000000",
    "additional_classifications": [
      "38000000",
      "38000000"
    ],
    "place_of_performance": "IRL"
  },
  "value": {
    "estimated_value": "1000000",
    "currency": "",
    "maximum_value": ""
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "false",
    "open_tender_date": "2024-11-14+01:00",
    "open_tender_time": "12:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=4218639"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Provision of a HbA1c Testing Solution with all Associated Consumables, Reagents, Maintenance and Support (on a Cost per Reportable Test basis)",
      "description": "Provision of a complete solution for Haemoglobin A1c (HbA1c) testing on a Cost per Reportable Test (CPR) basis; which will include all supplies and services, including any associated costs, that may be required i.e. reagents, equipment, maintenance, (including third party reagents and equipment if/when original reagents and/or equipment do not meet the acceptable performance standards), wash solutions, eluents, buffers, columns, capillaries, filters, calibrators, controls, PC’s, printers, interfacing, consumables, spare parts and so forth. This public procurement competition will be conducted in accordance with the open procedure under the European Union (Award of Public Authority Contracts) Regulations 2016 (Statutory Instrument 284 of 2016) (the “Regulations”). Any contract that may result from this Competition will be issued for a term of sixty (60) months. The Contracting Authority reserves the right to extend the Term for a period of up to twelve (12) months with a maximum of one (1) such extension on the same terms and conditions, subject to the Contracting Authority’s obligations at law.",
      "main_nature": "supplies",
      "main_classification": "33000000",
      "additional_classifications": [
        "38000000"
      ],
      "place_of_performance": "IRL",
      "country": "IRL",
      "value": {
        "estimated_value": "1000000",
        "currency": "",
        "maximum_value": ""
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=4218639"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/520712-2024/pdf"
}