{
  "notice_publication_id": "528638-2024",
  "buyer": {
    "official_name": "Dundalk Institute of Technology_1155",
    "email": "info@dkit.ie",
    "legal_type": "body-pl",
    "activity": "education",
    "address": {
      "street": "Dublin Road, Dundalk",
      "city": "DUNDALK",
      "postal_code": "A91 K584",
      "country": "IRL"
    },
    "website": "https://www.dkit.ie",
    "company_id": "IE 4598992U",
    "phone": "+353 429370200"
  },
  "procedure": {
    "title": "The Provision of vending machine services",
    "description": "**Title: The Provision of Vending Machine Services**\n\n**Description:**\nThe Dundalk Institute of Technology (DkIT) is seeking a reliable and efficient provider for the installation, maintenance, and management of vending machines on its campus. DkIT is a leading higher education institution in the North Leinster South Ulster Region, known for its excellent facilities and services. The institute is committed to providing a conducive learning environment that supports the well-being and convenience of its students, staff, and visitors.\n\nThe successful bidder will be responsible for ensuring that the vending machines are stocked with a variety of healthy snacks and beverages, including options for students with dietary restrictions. The provider must also ensure that the machines are regularly maintained to prevent malfunctions and minimize downtime. Additionally, the bidder should propose a system for monitoring and reporting on machine performance, including inventory levels and any issues that may arise.\n\nDkIT values reliability, customer service, and sustainability in its vendors. The chosen provider should demonstrate a commitment to these values and propose innovative solutions that align with the institute's mission to deliver health and happiness to its community. The contract will be awarded to the bidder that offers the best combination of quality, reliability, and value for money.\n\n**Key Requirements:**\n- **Installation:** The provider must ensure that the vending machines are installed in strategic locations across the campus to maximize accessibility.\n- **Maintenance:** Regular maintenance schedules should be proposed to prevent machine malfunctions and ensure continuous operation.\n- **Inventory Management:** A system for monitoring and reporting on inventory levels should be provided to ensure that machines are always stocked with a variety of options.\n- **Customer Service:** The provider must demonstrate a commitment to excellent customer service, including prompt responses to any issues that may arise.\n- **Sustainability:** The bidder should propose sustainable practices for the operation and maintenance of the vending machines, aligning with DkIT's commitment to environmental responsibility.\n\nBy selecting a vendor that meets these requirements, DkIT aims to enhance the overall experience of its students, staff, and visitors by providing convenient and healthy snack options while maintaining a high level of service and sustainability.",
    "identifier": "6adcc7ad-629b-47b3-87d9-12f982549531",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-10-07+01:00",
    "deadline_time": "17:00:00+01:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "42933000",
    "additional_classifications": [
      "42933300",
      "42933300"
    ],
    "place_of_performance": "anyw-cou"
  },
  "value": {
    "estimated_value": "0",
    "currency": "",
    "maximum_value": ""
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-10-09+01:00",
    "open_tender_time": "00:00:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=4230532"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "The Provision of vending machine services",
      "description": "**Title: The Provision of Vending Machine Services**\n\n**Description:**\nDundalk Institute of Technology (DkIT) is seeking a reliable and efficient provider for vending machine services to support the daily operations of its expansive campus. The successful bidder will be responsible for the installation, maintenance, and restocking of vending machines across various locations on the DkIT campus, ensuring a continuous supply of healthy and convenient snack options for students, staff, and visitors.\n\n**Key Requirements:**\n- **Installation and Maintenance:** The provider must ensure that vending machines are installed in high-traffic areas and are fully operational at all times. Regular maintenance, including machine cleaning and software updates, is essential to prevent downtime.\n- **Product Variety:** The vending machines should offer a diverse range of healthy snacks, including fresh fruits, nuts, and energy bars, as well as beverages such as water, juice, and coffee.\n- **Customer Convenience:** The provider should ensure that vending machines are easily accessible and user-friendly, with clear instructions and a secure payment system.\n- **Environmental Sustainability:** DkIT is committed to sustainability; therefore, the provider should offer eco-friendly packaging options and consider the environmental impact of their products.\n- **Reliability and Customer Service:** The provider must have a strong track record of reliability and excellent customer service, with a dedicated team available to address any issues promptly.\n- **Compliance with Health and Safety Standards:** The provider must comply with all relevant health and safety standards to ensure the vending machines do not pose any risk to users.\n\n**Additional Considerations:**\n- **Integration with Campus Systems:** The provider should be able to integrate their vending machine services with DkIT's existing campus systems for efficient payment processing and inventory management.\n- **Data Analytics:** The provider should be able to provide data analytics on vending machine usage to help DkIT optimize its snack offerings and improve customer satisfaction.\n- **Sustainability Reporting:** The provider should be willing to provide regular sustainability reports to demonstrate their commitment to environmental responsibility.\n\nBy selecting a bidder who meets these requirements, DkIT aims to enhance the overall student experience and maintain its reputation as a leader in higher education and research.",
      "main_nature": "supplies",
      "main_classification": "42933000",
      "additional_classifications": [
        "42933300"
      ],
      "place_of_performance": "anyw-cou",
      "country": "IRL",
      "value": {
        "estimated_value": "",
        "currency": "",
        "maximum_value": ""
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "tp-abil",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=4230532"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/528638-2024/pdf"
}