{
  "notice_publication_id": "563255-2024",
  "buyer": {
    "official_name": "Health Service Executive (HSE)",
    "email": "procurement.helpdesk@hse.ie",
    "legal_type": "body-pl",
    "activity": "health",
    "address": {
      "street": "Oak House, Millennium Park Naas Co. Kildare",
      "city": "Kildare",
      "postal_code": "RE",
      "country": "IRL"
    },
    "website": "https://www.hse.ie",
    "company_id": "Health Service Executive (HSE)",
    "phone": "0000"
  },
  "procedure": {
    "title": "HSE Decarbonisation Pilot Pathfinder Programme for Clonalkilty Community Hospital, Scartagh, Clonakilty, Co. Cork",
    "description": "**Title:** HSE Decarbonisation Pilot Pathfinder Programme for Clonakilty Community Hospital, Scartagh, Clonakilty, Co. Cork\n\n**Description:** The Health Service Executive (HSE) is seeking to pre-qualify suitable Mechanical and Electrical contractors for the decarbonisation and thermal energy upgrade works at Clonakilty Community Hospital. This project aims to reduce the carbon footprint of the hospital by implementing energy-efficient solutions. The scope of the project includes:\n\n1. **Energy Centre Redevelopment and Extension:** Demolition of a disused boiler chimney and associated ancillary structures to facilitate heat pump and geothermal energy installations, along with the construction of associated plant enclosures, site services, and site works.\n\n2. **Window Replacement and External Insulation:** Replacement of windows and external insulation of some buildings to enhance energy efficiency.\n\n3. **Roof Upgrade Works:** Upgrades to the roofs of some buildings to improve insulation and reduce energy consumption.\n\n4. **PV Panel Installation:** Installation of photovoltaic (PV) panels on some roofs, excluding protected structures, to harness solar energy.\n\n5. **Ground Mounted PV Panel Installation:** Installation of ground-mounted PV panels along with associated site services and site works to maximize renewable energy generation.\n\n6. **Conservation Works:** Masonry and roofing repairs and replacements to heritage buildings and protected structures within the curtilage of a protected structure (RPS 01668).\n\n**Objective:** The successful contractors will be appointed as domestic sub-contractors by the main contractor and will be responsible for executing the specified works to ensure a sustainable and energy-efficient environment at Clonakilty Community Hospital. The project is part of the HSE's broader initiative to decarbonize its facilities and reduce carbon emissions, aligning with Ireland's National Recovery and Resilience Plan (NRRP) and the EU's REPowerEU programme.\n\n**Eligibility Criteria:** Suitably qualified Mechanical and Electrical contractors who wish to bid for the main contract must complete this pre-qualification submission to pre-qualify as specialist Mechanical/Electrical contractors. The selected contractors will be expected to demonstrate expertise in energy efficiency, thermal energy upgrades, and sustainable building practices.",
    "identifier": "d7e5d0cb-686b-431a-ba57-d2c30a617bc2",
    "type": "restricted",
    "accelerated": "false",
    "deadline_date": "2024-10-11+01:00",
    "deadline_time": "12:00:00+01:00"
  },
  "purpose": {
    "main_nature": "works",
    "main_classification": "45210000",
    "additional_classifications": [
      "45310000",
      "45350000",
      "45310000",
      "45350000",
      "45310000",
      "45350000"
    ],
    "place_of_performance": "IRL"
  },
  "value": {
    "estimated_value": "0000",
    "currency": "",
    "maximum_value": ""
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "restricted",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "",
    "open_tender_time": "",
    "open_tender_location": ""
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Main Contractor",
      "description": "**Title: Main Contractor**\n\n**Description:**\nThe Health Service Executive (HSE) is seeking a Main Contractor for the Decarbonisation and Thermal Energy Upgrade works at Clonakilty Community Hospital, Scartagh, Clonakilty, Co. Cork. This competition aims to pre-qualify suitable Mechanical and Electrical contractors who will be appointed as domestic Sub-contractors. The project scope includes:\n\n1. **Energy Centre Redevelopment and Extension:**\n   - Demolition of a disused boiler chimney and associated ancillary structures to facilitate heat pump and geothermal energy installations.\n   - Construction of associated plant enclosures, site services, and site works.\n\n2. **Window Replacement, External Insulation, and Render:**\n   - Replacement of windows in some buildings.\n   - Application of external insulation and render to certain buildings.\n\n3. **Roof Upgrade Works:**\n   - Upgrades to the roofs of some buildings.\n\n4. **PV Panel Installation:**\n   - Installation of photovoltaic (PV) panels on some roofs, excluding protected structures.\n   - Ground-mounted PV panel installation and associated site services and site works.\n\n5. **Conservation Works:**\n   - Masonry and roofing repairs and replacements to Heritage Buildings and Protected Structures within the curtilage of a protected structure (RPS 01668).\n\n**Key Requirements:**\n- The successful bidder must be a specialist Mechanical and Electrical contractor.\n- The contractor must have experience in similar decarbonisation and thermal energy upgrade projects.\n- The contractor should demonstrate expertise in managing complex construction projects, particularly those involving heritage buildings and protected structures.\n- The contractor should have a proven track record of delivering projects on time, within budget, and to the required quality standards.\n- The contractor must comply with all relevant health and safety regulations and environmental standards.\n- The contractor should be able to provide a comprehensive project plan, including timelines, budgets, and risk assessments.\n\n**Submission Requirements:**\n- Bidders must complete the pre-qualification questionnaire (PQQ) submission to demonstrate their suitability for the project.\n- Suitably qualified Mechanical and Electrical contractors who wish to bid for the Main Contract must also complete this PQQ submission to pre-qualify as specialist Mechanical/Electrical contractors.\n\n**Evaluation Criteria:**\n- Technical competence and experience in similar projects.\n- Financial stability and capability to manage the project budget.\n- Health and safety record and compliance with relevant regulations.\n- Environmental sustainability practices and commitment to decarbonization.\n- Project management skills and ability to deliver the project on time and within budget.\n- Quality of previous work and references from previous clients.\n\nBy selecting a suitable Main Contractor, the HSE aims to ensure that the decarbonisation and thermal energy upgrade works at Clonakilty Community Hospital are executed efficiently, effectively, and in compliance with all relevant standards and regulations. The successful bidder will be responsible for managing the project, appointing suitable Sub-contractors, and ensuring that the works are completed to the highest standards of quality and safety.",
      "main_nature": "works",
      "main_classification": "45210000",
      "additional_classifications": [
        "45310000",
        "45350000"
      ],
      "place_of_performance": "IRL",
      "country": "IRL",
      "value": {
        "estimated_value": "",
        "currency": "",
        "maximum_value": ""
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    },
    {
      "lot": "LOT-0002",
      "title": "MEP",
      "description": "**Title: MEP - Decarbonisation and Thermal Energy Upgrade Works at Clonakilty Community Hospital, Scartagh, Clonakilty, Co. Cork**\n\n**Description:**\nThe Health Service Executive (HSE) is seeking suitable Mechanical and Electrical (MEP) contractors to pre-qualify for the decarbonisation and thermal energy upgrade works at Clonakilty Community Hospital. This project aims to transform the hospital's energy infrastructure to reduce carbon emissions and enhance sustainability. The scope of the project includes:\n\n1. **Energy Centre Redevelopment and Extension:**\n   - Demolition of a disused boiler chimney and associated ancillary structures to facilitate heat pump and geothermal energy installations.\n   - Construction of associated plant enclosures, site services, and site works.\n\n2. **Window Replacement and Insulation:**\n   - Replacement of windows in some buildings.\n   - External insulation and render to improve energy efficiency.\n\n3. **Roof Upgrade Works:**\n   - Upgrades to roofs in some buildings to enhance insulation and reduce energy consumption.\n\n4. **PV Panel Installation:**\n   - Installation of photovoltaic (PV) panels on some roofs, excluding protected structures.\n\n5. **Ground Mounted PV Panel Installation:**\n   - Installation of ground-mounted PV panels along with associated site services and site works.\n\n6. **Conservation Works:**\n   - Masonry and roofing repairs and replacements to Heritage Buildings and Protected Structures within the curtilage of a protected structure (RPS 01668).\n\n**Pre-Qualification Requirements:**\nSuitably qualified Mechanical and Electrical contractors who wish to bid for the Main Contract must complete this pre-qualification submission to be considered as specialist MEP contractors. This is not a Reserved Specialist nor Novated appointment. The successful Main Contractor will procure and appoint these pre-qualified contractors as domestic Sub-contractors.\n\n**Project Timeline:**\n- Tenders submission deadline: 25/10/2024 12:00.\n- Tenders opening date: 25/10/2024 12:30.\n- Contract duration: 14 months.\n- Validity of tender: 180 days.\n\n**Evaluation Mechanism:**\nThe evaluation will be based on the best price-quality ratio.\n\n**Procurement Type:**\nThis is a public contract under the 2014/24/EU directive, with a restricted procedure.\n\n**CPV Codes:**\n45210000 - Building construction work, 45310000 - Electrical installation work, 45350000 - Mechanical installations.\n\n**Number of Lots:**\nTwo lots: Main Contractor and MEP.\n\n**Contract Award:**\nThe contract will be awarded in lots, with one lot only available for tender.\n\n**EU Funding:**\nNo EU funding is involved in this project.\n\n**Multiple Tenders:**\nOnly one tender will be accepted for each lot.\n\n**Date of Publication/Invitation:**\n19/09/2024 07:50.\n\n**Language of Publication:**\nEnglish.\n\n**Number of Openers:**\nTwo.",
      "main_nature": "works",
      "main_classification": "45210000",
      "additional_classifications": [
        "45310000",
        "45350000"
      ],
      "place_of_performance": "IRL",
      "country": "IRL",
      "value": {
        "estimated_value": "",
        "currency": "",
        "maximum_value": ""
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=4340273",
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=4340273"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/563255-2024/pdf"
}