{
  "notice_publication_id": "568147-2024",
  "buyer": {
    "official_name": "Department of Justice",
    "email": "cpu@justice.ie",
    "legal_type": "cga",
    "activity": "pub-os",
    "address": {
      "street": "51 St Stephen's Green",
      "city": "Dublin",
      "postal_code": "D02 HK52",
      "country": "IRL"
    },
    "website": "https://www.gov.ie/en/organisation/department-of-justice/",
    "company_id": "Department of Justice",
    "phone": "016028202"
  },
  "procedure": {
    "title": "Request for Tenders dated 19/09/2024 for the provision of FormIO and Alfresco Licence Subscription Services",
    "description": "The Department of Justice, Ireland, is the Contracting Authority for the Request for Tenders (RFT) dated 19/09/2024 for the provision of FormIO and Alfresco Licence Subscription Services. The Department of Justice is responsible for advancing community and national security, promoting justice and equality, and safeguarding human rights to achieve its vision of a safe, fair, and inclusive Ireland. This tender aims to secure licencing of the FormIO and Alfresco software products for a 12-month period to support the department's ongoing efforts in ensuring efficient and secure data management systems.\n\nSuitable bidders should have expertise in software licencing, specifically in FormIO and Alfresco, with a proven track record of providing reliable and secure subscription services. The tenderers should demonstrate their ability to manage and maintain complex software systems, ensuring high levels of data security and compliance with relevant regulations. Additionally, they should provide detailed information on their experience in delivering similar services to government agencies or similar high-security environments.\n\nThe successful bidder will be expected to provide comprehensive support, including technical assistance, maintenance, and updates, to ensure the smooth operation of the software products throughout the 12-month period. The proposal should include detailed cost estimates, service level agreements, and a clear plan for managing and resolving any technical issues that may arise.\n\nGiven the Department of Justice's commitment to safeguarding human rights and promoting justice, it is essential that the selected bidder demonstrates a strong understanding of these principles and how they will be integrated into the provision of the FormIO and Alfresco Licence Subscription Services. The proposal should also highlight any measures the bidder will take to ensure data protection and compliance with relevant Irish and EU regulations.",
    "identifier": "047eacc0-d86a-4673-8f7a-d5a772fcedc1",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-10-21+01:00",
    "deadline_time": "16:00:00+01:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "72212218",
    "additional_classifications": [],
    "place_of_performance": "IRL"
  },
  "value": {
    "estimated_value": "1000000",
    "currency": "",
    "maximum_value": ""
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-10-21+01:00",
    "open_tender_time": "16:30:00+01:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=4345671"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Request for Tenders dated 19/09/2024 for the provision of FormIO and Alfresco Licence Subscription Services",
      "description": "**Enhanced Proposal Description:**\n\nThe Department of Justice, Ireland, is seeking tenders for the provision of FormIO and Alfresco Licence Subscription Services. As the primary organization responsible for advancing community and national security, promoting justice and equality, and safeguarding human rights in Ireland, the Department requires reliable and secure software solutions to support its operations.\n\nThe successful bidder will be responsible for providing a 12-month subscription service for the FormIO and Alfresco software products. These solutions are critical for managing and processing various types of data, ensuring compliance with data protection regulations, and enhancing the overall efficiency of the Department's administrative processes.\n\nKey requirements for the tender include:\n\n- **Technical Competence:** The bidder must demonstrate expertise in licensing and managing FormIO and Alfresco software products.\n- **Security Measures:** The bidder must ensure that the provided solutions meet the highest standards of data security and compliance with relevant Irish and EU regulations.\n- **Reliability and Uptime:** The bidder must guarantee a high level of service availability and reliability to support the Department's continuous operations.\n- **Customer Support:** The bidder must provide comprehensive customer support, including technical assistance, training, and maintenance services.\n- **Scalability:** The bidder must be able to adapt the solutions to meet the evolving needs of the Department, ensuring scalability and flexibility.\n- **Compliance with FOI Acts:** The bidder must be aware of and comply with the Freedom of Information Acts (FOI Acts) in Ireland, ensuring that all data management practices are transparent and accessible.\n\nThe Department of Justice is committed to achieving its vision of a safe, fair, and inclusive Ireland. The successful bidder will contribute to this vision by providing robust and efficient software solutions that support the Department's mission.\n\n**Contact Information:**\nFor further information or to submit a tender, please contact the Department of Justice at:\n- Address: 51 St Stephen's Green, Dublin 2, D02 HK52\n- Website: www.gov.ie/justice/\n- Email: info@justice.ie\n\n**Submission Guidelines:**\nTenders should be submitted in accordance with the guidelines outlined in the request for tenders document. All submissions should include a detailed proposal outlining the bidder's technical capabilities, service offerings, and compliance with the specified requirements. The Department of Justice reserves the right to evaluate tenders based on the criteria outlined in the request for tenders document.",
      "main_nature": "services",
      "main_classification": "72212218",
      "additional_classifications": [],
      "place_of_performance": "IRL",
      "country": "IRL",
      "value": {
        "estimated_value": "",
        "currency": "",
        "maximum_value": ""
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=4345671"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/568147-2024/pdf"
}