{
  "notice_publication_id": "665921-2023",
  "buyer": {
    "official_name": "Department of Justice",
    "email": "cpu@justice.ie",
    "legal_type": "cga",
    "activity": "gen-pub",
    "address": {
      "street": "51 St Stephen's Green",
      "city": "Dublin",
      "postal_code": "Dublin 2, D02 HK52",
      "country": "IRL"
    },
    "website": "https://www.gov.ie/en/organisation/department-of-justice/",
    "company_id": "Department of Justice",
    "phone": "+353 1 6028202"
  },
  "procedure": {
    "title": "Framework for the supply and support of IBM and HCL Licence Reseller Services to the Department of Justice",
    "description": "**Enhanced Proposal Description:**\n\nThe Department of Justice, Ireland, is seeking a reliable and experienced provider to establish a framework for the supply and support of IBM and HCL Licence Reseller Services. The Department is responsible for public policy and administration in areas including justice, public safety, civil law, national security, and immigration. The Information Management and Technology (IM and T) Division within the Department operates a shared service with approximately 3,200 users on a centralized build-to-share platform.\n\nThe Department has been utilizing IBM software since the early 1990s, with IBM software remaining central to its IT network operations. In 2023, an in-depth audit of the IBM and HCL licensing estate was conducted, and the results form the basis for the requirements in this Request for Tender. The Department is now seeking a framework to manage the following services:\n\n1. **Purchase of New Licences:** Procurement of new IBM and HCL software licences.\n2. **Reinstatement of Licences:** Reinstatement of expired or terminated IBM and HCL software licences.\n3. **Renewal of Subscription and Support:** Annual renewal and support for the current suite of IBM and HCL software licences under existing licensing agreements.\n\nTenderers must demonstrate expertise in managing complex IT licensing agreements, providing comprehensive support services, and ensuring compliance with all relevant regulations. The successful bidder will need to associate themselves with this competition to access the tender documents, ask and receive queries, and submit a tender response in a ZIP-FILE format.\n\n**Key Requirements:**\n- Proven experience in managing large-scale IT licensing agreements.\n- Comprehensive understanding of IBM and HCL software solutions.\n- Ability to provide detailed audit reports and compliance documentation.\n- Strong customer support and service delivery capabilities.\n- Familiarity with the Irish public sector's IT procurement processes.\n- Capacity to handle a centralized build-to-share platform with 3,200 users.\n- Ability to submit responses in a ZIP-FILE format.\n\n**Evaluation Criteria:**\n- Technical Competence\n- Financial Stability\n- Customer Support and Service Delivery\n- Compliance with Regulations\n- Experience in Public Sector IT Procurement\n\nBy selecting a bidder with these qualifications, the Department of Justice aims to establish a reliable and efficient framework for managing its IBM and HCL software licences, ensuring seamless operation of its IT network and supporting its mission to advance community and national security, promote justice and equality, and safeguard human rights.",
    "identifier": "9e8219f8-96d8-412e-964f-1264a4a5b87b",
    "type": "open",
    "accelerated": "true",
    "deadline_date": "2023-11-27+00:00",
    "deadline_time": "12:00:00+00:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "48000000",
    "additional_classifications": [
      "72268000",
      "48218000",
      "48400000",
      "48100000",
      "72250000",
      "72260000",
      "72261000",
      "72267100",
      "72268000",
      "48218000",
      "48400000",
      "48100000",
      "72250000",
      "72260000",
      "72261000",
      "72267100"
    ],
    "place_of_performance": "anyw-cou"
  },
  "value": {
    "estimated_value": "2500000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2023-11-27+00:00",
    "open_tender_time": "12:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=2629261"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "12",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Framework for the supply and support of IBM and HCL Licence Reseller Services to the Department of Justice",
      "description": "**Title:** Framework for the Supply and Support of IBM and HCL Licence Reseller Services to the Department of Justice\n\n**Description:**\nThe Department of Justice, a state department responsible for public policy and administration in areas including justice, public safety, civil law, national security, and immigration, is seeking a framework for the provision of IBM and HCL reseller services. The IM and T Division within the DOJ operates a shared service with approximately 3,200 users on a centralized build-to-share platform. The department has utilized IBM software since the early 1990s, with IBM software remaining central to its IT network operations. In 2023, an in-depth audit of the IBM and HCL licensing estate was conducted, and the results form the basis for the requirements in this Request for Tender.\n\nThe Department of Justice is seeking a reseller service to:\n1. Purchase new licenses.\n2. Reinstate licenses.\n3. Renew subscription and support on its current suite of IBM and HCL software licenses under its licensing agreements.\n\nTenderers must associate themselves with this competition to access the tender documents, ask and receive queries, and submit a tender response. All responses must be submitted in a ZIP-FILE format.\n\n**Key Requirements:**\n- **Licensing Management:** The ability to manage and purchase new licenses, reinstate existing ones, and renew subscription and support for IBM and HCL software.\n- **Audit Compliance:** Alignment with the results of the 2023 licensing estate audit.\n- **IT Infrastructure:** Experience in supporting centralized IT infrastructure with a large user base.\n- **Compliance:** Familiarity with the Department of Justice's specific needs and compliance requirements.\n- **Documentation:** Submission of tender responses in a ZIP-FILE format.\n\n**Ideal Bidders:**\n- Companies with extensive experience in managing and reselling IBM and HCL software licenses.\n- Providers with a proven track record in supporting large-scale IT infrastructure projects.\n- Organizations that have conducted similar audits and can align their services with the Department of Justice's specific requirements.\n- Bidders with a strong understanding of the Department's compliance needs and ability to manage complex licensing agreements.\n\nBy selecting a suitable bidder, the Department of Justice aims to establish a reliable framework for the continued operation and support of its critical IT systems, ensuring the efficient management of its licensing estate and compliance with all relevant regulations.",
      "main_nature": "supplies",
      "main_classification": "48000000",
      "additional_classifications": [
        "72268000",
        "48218000",
        "48400000",
        "48100000",
        "72250000",
        "72260000",
        "72261000",
        "72267100"
      ],
      "place_of_performance": "anyw-cou",
      "country": "IRL",
      "value": {
        "estimated_value": "2500000",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "false",
        "framework_agreement": "fa-w-rc",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=2629261"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/665921-2023/pdf"
}