{
  "notice_publication_id": "695567-2023",
  "buyer": {
    "official_name": "Sacred Heart SNS",
    "email": "principal@sacredheartsns.net",
    "legal_type": "body-pl",
    "activity": "education",
    "address": {
      "street": "Killinarden, Tallaght, D24",
      "city": "Tallaght",
      "postal_code": "D24FY81",
      "country": "IRL"
    },
    "website": "https://www.sacredheartsns.net",
    "company_id": "19543T",
    "phone": "+35314524811"
  },
  "procedure": {
    "title": "2023 Sacred Heart Senior NS, Mechanical and Electrical Engineering Services for additional accommodation for Sacred Heart Senior National School, 13 Whitestone Drive, Tallaght Business Park, Dublin",
    "description": "**Title:** 2023 Sacred Heart Senior NS, Mechanical and Electrical Engineering Services for Additional Accommodation\n\n**Description:**\nSacred Heart Senior National School, located at 13 Whitestone Drive, Tallaght Business Park, Dublin, is under the patronage of the Archdiocese of Dublin, led by Archbishop Dermot Farrell. The project aims to enhance the school's facilities by providing additional accommodation to support the educational needs of its students. The scope of the project includes:\n\n1. **Classroom and SEN Base:**\n   - Two classrooms with a Special Educational Needs (SEN) base, including washrooms, with a total floor area including circulation and internal walls of 473 square meters.\n\n2. **Secure and Soft Play Area:**\n   - A secure play area of 100 square meters to ensure student safety.\n   - A soft play area of 100 square meters for recreational activities.\n\n3. **Sensory Garden:**\n   - A sensory garden of 100 square meters designed to promote sensory learning and well-being.\n\n4. **Parking Spaces:**\n   - Six parking spaces to accommodate staff and visitors.\n\n5. **Interim Temporary Accommodation:**\n   - Provision of interim temporary accommodation (100 square meters) including all required statutory approvals and compliances. This temporary structure will be used by the school until the permanent additional accommodation is completed. The Design Team (DT) must ensure that the location of the interim temporary accommodation does not impede the development of the permanent structure. All interim temporary accommodation will be removed from the school site upon completion of the permanent structure. Associated substructures, underground services, etc., shall be removed, and the site shall be reinstated.\n\n**Key Requirements:**\n- The bidder must have experience in mechanical and electrical engineering services for educational institutions.\n- The bidder should demonstrate expertise in designing and implementing temporary and permanent structures that meet educational and safety standards.\n- The bidder must ensure compliance with all relevant statutory approvals and regulations.\n- The bidder should provide a detailed project schedule and timeline for completion.\n- The bidder must guarantee the removal of all temporary structures and reinstatement of the site upon completion of the permanent structure.\n\n**Evaluation Criteria:**\n- Technical competence and experience in similar projects.\n- Ability to meet project timelines and deadlines.\n- Compliance with statutory regulations and approvals.\n- Quality of design and construction materials.\n- Cost-effectiveness and value for money.\n- Ability to provide interim temporary accommodation without disrupting ongoing school activities.\n\nBy responding to this public tender, bidders will contribute to enhancing the educational environment at Sacred Heart Senior National School, ensuring a safe, inclusive, and supportive learning space for all students.",
    "identifier": "db6ce52e-9570-445a-b493-59adcc09eaef",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2023-12-15+00:00",
    "deadline_time": "13:00:00+00:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "51100000",
    "additional_classifications": [
      "71321000",
      "71321000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "0",
    "currency": "",
    "maximum_value": "1730000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2023-12-15+00:00",
    "open_tender_time": "13:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=2706649"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "2023 Sacred Heart Senior NS, Mechanical and Electrical Engineering Services for additional accommodation for Sacred Heart Senior National School, 13 Whitestone Drive, Tallaght Business Park, Dublin",
      "description": "**Title:** 2023 Sacred Heart Senior NS, Mechanical and Electrical Engineering Services for Additional Accommodation\n\n**Description:**\nSacred Heart Senior National School, located at 13 Whitestone Drive, Tallaght Business Park, Dublin, is under the patronage of the Archdiocese of Dublin, led by Archbishop Dermot Farrell. The project aims to enhance the school's facilities by adding additional accommodation to support the growing student population. The scope of the project includes:\n\n1. **Classroom and SEN Base:** Two classrooms with a Special Educational Needs (SEN) base, including washrooms, with a total floor area including circulation and internal walls of 473m².\n2. **Secure and Soft Play Area:** A secure and soft play area of 100m² to ensure a safe environment for students.\n3. **Sensory Garden:** A sensory garden of 100m² designed to promote sensory learning and well-being.\n4. **Parking Spaces:** Six parking spaces to accommodate staff and visitors.\n5. **Interim Temporary Accommodation:** Provision of interim temporary accommodation (100m²) until the permanent structure is completed. The Design Team (DT) must ensure that the location of the interim temporary accommodation does not impede the development of the permanent additional accommodation. All interim temporary accommodations must be removed from the site upon completion of the permanent structure. Associated substructures, underground services, etc., shall be removed and the site shall be reinstated.\n\nThe successful bidder will be responsible for providing comprehensive mechanical and electrical engineering services, including all required statutory approvals and compliances. The project requires a team that can deliver high-quality, safe, and functional facilities that meet the educational needs of the students. The bidder should have experience in educational facility design and construction, with a focus on sustainability and accessibility.\n\n**Key Requirements:**\n- **Design and Planning:** Detailed design and planning to ensure the project meets all educational and safety standards.\n- **Statutory Approvals:** Compliance with all relevant statutory approvals and regulations.\n- **Interim Temporary Accommodation:** Provision of interim temporary accommodation that does not interfere with the permanent structure's development.\n- **Site Reinstatement:** Removal of all interim temporary accommodations and associated substructures upon completion of the permanent structure.\n- **Sustainability:** Incorporation of sustainable practices in the design and construction of the facilities.\n- **Accessibility:** Ensuring that the new facilities are accessible and inclusive for all students.\n\nBy bidding on this project, you will be contributing to the enhancement of educational facilities at Sacred Heart Senior National School, supporting the growth and development of its students. The successful bidder will have the opportunity to work with a dedicated team committed to providing high-quality educational environments.",
      "main_nature": "services",
      "main_classification": "51100000",
      "additional_classifications": [
        "71321000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "0",
        "currency": "",
        "maximum_value": "1730000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=2706649"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/695567-2023/pdf"
}