{
  "notice_publication_id": "752255-2023",
  "buyer": {
    "official_name": "Teagasc - the Agriculture and Food Development Authority",
    "email": "procurement@teagasc.ie",
    "legal_type": "body-pl",
    "activity": "gen-pub",
    "address": {
      "street": "Head Office, Oak Park",
      "city": "Carlow",
      "postal_code": "R93 XE12",
      "country": "IRL"
    },
    "website": "https://www.teagasc.ie",
    "company_id": "000",
    "phone": "0599183150"
  },
  "procedure": {
    "title": "Single-Party Framework Agreement for Supply, Delivery, Installation and Commissioning of Climate Control Units for Teagasc",
    "description": "**Enhanced Proposal Description:**\n\nTeagasc, the Agriculture and Food Development Authority in Ireland, is seeking a Single-Party Framework Agreement for the Supply, Delivery, Installation, and Commissioning of Climate Control Units. This agreement is crucial for maintaining optimal conditions in the glasshouse at Teagasc Research Centre, Oak Park, Carlow, Ireland. The initial contract involves the installation of two climate-controlled units in bays 3 and 5 of the existing glasshouse. There is a potential for a phased replacement of the existing climate control units across all 5 bays of the glasshouse in the future.\n\nTeagasc is Ireland's leading national organization in agriculture and food research, employing over 1,100 staff across 52 locations, including 6 research centers. The organization is dedicated to supporting science-based innovation in the agri-food sector and broader bio-economy to ensure profitability, competitiveness, and sustainability. This tender aligns with Teagasc's mission to facilitate the exchange of knowledge between farmers, advisors, researchers, educators, and industry.\n\nThe successful bidder will need to demonstrate expertise in providing high-quality climate control units that meet the specific requirements of a research environment. The units must be capable of maintaining precise temperature and humidity levels to support various agricultural and horticultural research projects. The bidder should also have experience with the installation and commissioning of such systems, ensuring minimal disruption to ongoing research activities.\n\nThe tender documents provide detailed specifications and requirements for the climate control units, including technical specifications, installation procedures, and commissioning protocols. Potential bidders should carefully review these documents to ensure they meet all the necessary criteria.\n\nBy partnering with Teagasc, the successful bidder will contribute to advancing Ireland's agricultural and food research, supporting sustainable farming practices, and enhancing the overall efficiency of the research facilities. The bidder should be prepared to provide ongoing support and maintenance services to ensure the continued optimal performance of the climate control units.\n\n**Key Requirements:**\n- **Technical Specifications:** Detailed specifications for the climate control units, including temperature and humidity control capabilities.\n- **Installation Procedures:** Clear guidelines for the installation process to minimize disruption to ongoing research activities.\n- **Commissioning Protocols:** Protocols for ensuring the units are fully functional and meet the required standards.\n- **Ongoing Support:** Commitment to providing ongoing support and maintenance services to ensure the continued optimal performance of the units.\n- **Experience:** Demonstrated experience in providing climate control systems for similar research environments.\n- **Quality Assurance:** High-quality units that meet the specific requirements of a research environment.\n\nBy addressing these key requirements, potential bidders can effectively demonstrate their suitability for this critical project, contributing to the advancement of Ireland's agricultural and food research.",
    "identifier": "849be84b-457b-4ce1-b075-57dae0c4b069",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-01-15+00:00",
    "deadline_time": "14:00:00+00:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "38000000",
    "additional_classifications": [
      "38400000",
      "38100000",
      "38800000",
      "42131130",
      "38400000",
      "38100000",
      "38800000",
      "42131130"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "210000",
    "currency": "",
    "maximum_value": "210000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "false",
    "open_tender_date": "2024-01-15+00:00",
    "open_tender_time": "14:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=2827519"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "allowed",
    "esignature_submission": "",
    "ecatalog_submission": "allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Single-Party Framework Agreement for Supply, Delivery, Installation and Commissioning of Climate Control Units for Teagasc",
      "description": "Teagasc, the Irish Agriculture and Food Development Authority, is seeking tenders for the establishment of a Single-Party Framework Agreement for the Supply, Delivery, Installation, and Commissioning of Climate Control Units. The initial contract involves the provision of two climate-controlled units to bays 3 and 5 in the existing glasshouse located at the Teagasc Research Centre, Oak Park, Carlow, Ireland. This project aligns with Teagasc's mission to support science-based innovation in the agri-food sector, enhancing the sustainability and competitiveness of Irish agriculture. The optional phased replacement of existing climate control units across all 5 bays of the glasshouse underscores the need for reliable and efficient climate control systems. Suitable bidders should have experience in providing high-quality climate control solutions for agricultural research facilities, with a proven track record in installation and commissioning. The successful bidder will need to demonstrate expertise in maintaining and upgrading complex environmental control systems, ensuring minimal disruption to ongoing research activities. Additionally, bidders should be able to provide comprehensive after-sales support and maintenance services to ensure the optimal performance of the climate control units. The attached documents will provide further details on the technical specifications, timelines, and any additional requirements for this project.",
      "main_nature": "supplies",
      "main_classification": "38000000",
      "additional_classifications": [
        "38400000",
        "38100000",
        "38800000",
        "42131130"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "210000",
        "currency": "",
        "maximum_value": "210000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "fa-wo-rc",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=2827519"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/752255-2023/pdf"
}