{
  "notice_publication_id": "783995-2023",
  "buyer": {
    "official_name": "Sustainable HRM Skillnet",
    "email": "sustainablehrmskillnet@cipd.ie",
    "legal_type": "body-pl",
    "activity": "education",
    "address": {
      "street": "A3, The Locks, Charlotte Quay Dock, Grand Canal, D4",
      "city": "Dublin",
      "postal_code": "D04 WY91",
      "country": "IRL"
    },
    "website": "https://www.cipd.org/ie/",
    "company_id": "688082",
    "phone": "0876116952"
  },
  "procedure": {
    "title": "Sustainable HRM Skillnet - CFT - Co-Creation 2024 - Services - Trainer/consultant for the development of new programme development /Toolkit",
    "description": "**Enhanced Proposal Description:**\n\nThe Chartered Institute of Personnel and Development (CIPD) is the professional body for HR and Learning and Development, championing better work and working lives for over 100 years. With almost 160,000 members globally, the CIPD supports organisations by focusing on their people, thereby enhancing economies and societies. The institute provides thought leadership through independent research on the world of work and offers professional training and accreditation for those working in HR and Learning and Development.\n\nThe CIPD is seeking tenders for the development of training programs in the areas of HRM and related services. Specifically, the Sustainable HRM Skillnet initiative aims to address the pressing need for sustainable and responsible business practices within the HR profession and wider business. This involves aligning talent development and people practices with broader sustainable business practices.\n\nThe proposed programs for \"Future Dynamics Co-Creation\" aim to expand the Sustainable HRM Framework, a practitioner's toolkit developed in 2023. This framework was created through a strategic approach to sustainable people practices, involving member companies and project partners. In 2024, the CIPD seeks to further develop and expand this framework, ensuring that it remains a leading resource for HR professionals and business leaders.\n\nKey areas of focus include:\n\n- **Sustainable HRM Framework Development:** The CIPD is looking for bidders who can contribute to the further development of the Sustainable HRM Framework, ensuring it remains a comprehensive and practical toolkit for practitioners.\n- **Training Programmes:** The institute requires bidders to design and deliver training programs that address the need for sustainable and responsible business practices within HR.\n- **Co-Creation Approach:** The CIPD emphasizes the importance of a co-creation approach, where bidders must collaborate with HR professionals and business leaders to ensure the programs and toolkit are aligned with real-world needs.\n- **Expertise in HRM:** Bidders should possess expertise in HRM, including knowledge of current trends and best practices in sustainable people management.\n- **Evidence-Based Practice:** The CIPD values evidence-based practice, so bidders must demonstrate the ability to apply research and data to inform their proposals and deliverables.\n- **Technology Integration:** The use of technology to enhance people practices is crucial, and bidders should be able to integrate technology solutions into their training programs and toolkit development.\n\nBy partnering with the CIPD, successful bidders will contribute to shaping the future of HRM and supporting the development of sustainable business practices. The CIPD is committed to working with bidders who share its vision of creating a more inclusive, responsible, and sustainable work environment.",
    "identifier": "50dddaab-4d90-4ab7-9975-8e1715980e03",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-02-01+00:00",
    "deadline_time": "12:00:00+00:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "80000000",
    "additional_classifications": [
      "79632000",
      "80570000",
      "80532000",
      "80510000",
      "80511000",
      "80500000",
      "79632000",
      "80570000",
      "80532000",
      "80510000",
      "80511000",
      "80500000"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "97200",
    "currency": "",
    "maximum_value": "97200"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-02-02+00:00",
    "open_tender_time": "00:00:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=2883520"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Sustainable HRM Skillnet - CFT - Co-Creation 2024 - Services - Trainer/consultant for the development of new programme development /Toolkit",
      "description": "Sustainable HRM Skillnet is seeking tenders related to development of training programmes in the areas of HRM and related services. The network is also seeking submissions related to the further development of Sustainable HRM Framework, a practitioners toolkit. Our proposed programs for \"Future Dynamics Co-Creation,\" aim to address the pressing need for sustainable and responsible business practices within the HR profession and wider business. HR professionals and business leaders must now consider how to align talent development and people practices with broader sustainable business practices. In 2023 Sustainable HRM Skillnet along with our member companies and project partners led a more strategic approach to sustainable people practices, which led to the development of a sustainable HRM Framework. In 2024 Sustainable HRM Skillnet seeks to expand programme and Framework development.",
      "main_nature": "services",
      "main_classification": "80000000",
      "additional_classifications": [
        "79632000",
        "80570000",
        "80532000",
        "80510000",
        "80511000",
        "80500000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "97200",
        "currency": "",
        "maximum_value": "60000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "sui-act",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=2883520"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/783995-2023/pdf"
}