{
  "notice_publication_id": "789222-2023",
  "buyer": {
    "official_name": "University of Galway (ID 1400)",
    "email": "procure@universityofgalway.ie",
    "legal_type": "body-pl",
    "activity": "education",
    "address": {
      "street": "University Road, Galway",
      "city": "Galway",
      "postal_code": "H91TK33",
      "country": "IRL"
    },
    "website": "https://www.universityofgalway.ie/",
    "company_id": "0022578J",
    "phone": "+35391493970"
  },
  "procedure": {
    "title": "Establishment of a Single Operator Framework Agreement for an Electronic Trial Master File (eTMF) and Associated Services (GALW/CON1646/2023)",
    "description": "The University of Galway, a public research university located in the city of Galway, Ireland, is seeking to establish a Single Operator Framework Agreement for an Electronic Trial Master File (eTMF) and associated services. The Clinical Trials Institute at the University of Galway is responsible for managing and documenting clinical trials, and it is imperative to procure an eTMF system that can efficiently handle the documentation and management requirements of these trials. The selected bidder should have extensive experience in providing eTMF systems and associated services, ensuring high levels of data security, compliance with regulatory standards, and robust functionality to support the complex documentation needs of clinical trials. The bidder should also demonstrate a proven track record of collaboration with academic institutions and research organizations, particularly in the context of clinical trials management. Additionally, the bidder should be able to provide flexible and scalable solutions that can accommodate the evolving needs of the university's research activities. The successful bidder will be expected to provide comprehensive support, including training, maintenance, and updates to the eTMF system, ensuring seamless integration with existing systems and processes. The agreement should also include provisions for ongoing monitoring and evaluation to ensure the system meets the evolving requirements of the Clinical Trials Institute.",
    "identifier": "3fe4e711-3a51-4e83-8758-10076cb7fc94",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-02-01+00:00",
    "deadline_time": "16:00:00+00:00"
  },
  "purpose": {
    "main_nature": "supplies",
    "main_classification": "48331000",
    "additional_classifications": [
      "48311000",
      "48170000",
      "73110000",
      "73000000",
      "48311000",
      "48170000",
      "73110000",
      "73000000"
    ],
    "place_of_performance": "anyw-cou"
  },
  "value": {
    "estimated_value": "800000",
    "currency": "",
    "maximum_value": "800000"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "required",
    "electronic_ordering": "false",
    "electronic_payment": "false"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-02-01+00:00",
    "open_tender_time": "16:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=2889832"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Establishment of a Single Operator Framework Agreement for an Electronic Trial Master File (eTMF) and Associated Services (GALW/CON1646/2023)",
      "description": "The University of Galway, a public research university located in the city of Galway, Ireland, is seeking a Single Operator Framework Agreement for an Electronic Trial Master File (eTMF) and associated services. The Clinical Trials Institute at the University of Galway is responsible for managing and documenting clinical trials, and they require an eTMF system that can efficiently handle the documentation and management needs of their research activities.\n\nThe eTMF system should be capable of integrating with existing clinical trial management systems, ensuring seamless data flow and compliance with regulatory requirements. The system must also provide robust security measures to protect sensitive clinical trial data, including data encryption and access controls. Additionally, the eTMF system should offer advanced search functionalities, reporting capabilities, and audit trails to facilitate efficient data retrieval and compliance monitoring.\n\nThe selected bidder should have extensive experience in implementing eTMF solutions in a research-intensive environment, with a proven track record of delivering high-quality services that meet the stringent requirements of clinical trials. The bidder should also demonstrate a strong understanding of regulatory compliance, particularly in relation to Good Clinical Practice (GCP) and other relevant standards.\n\nThe University of Galway is committed to advancing public health through innovative research, and the eTMF system will play a critical role in supporting this mission. The successful bidder will contribute to the university's goal of maintaining the highest standards of clinical trial management, ensuring the integrity and reliability of research data, and facilitating the efficient conduct of clinical trials.",
      "main_nature": "supplies",
      "main_classification": "48331000",
      "additional_classifications": [
        "48311000",
        "48170000",
        "73110000",
        "73000000"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "800000",
        "currency": "",
        "maximum_value": "800000"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "other",
        "variant_submissions": "",
        "electronic_invoicing": "required",
        "electronic_ordering": "false",
        "electronic_payment": "false"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "fa-wo-rc",
        "dps_usage": "none",
        "reserved_execution": "not-known",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=2889832"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/789222-2023/pdf"
}