{
  "notice_publication_id": "89463-2024",
  "buyer": {
    "official_name": "Office of Public Works (OPW)",
    "email": "floodprocurement@opw.ie",
    "legal_type": "body-pl",
    "activity": "gen-pub",
    "address": {
      "street": "Jonathan Swift Street",
      "city": "Trim",
      "postal_code": "C15 NX36",
      "country": "IRL"
    },
    "website": "https://www.opw.ie",
    "company_id": "2109",
    "phone": "0469422000"
  },
  "procedure": {
    "title": "Nenagh River Catchment Topographical Survey for the Office of Public Works",
    "description": "**Title: Nenagh River Catchment Topographical Survey for the Office of Public Works**\n\n**Description:**\nThe Office of Public Works (OPW) is seeking a comprehensive topographical survey of the Nenagh River Catchment to support its strategic initiatives in flood risk management and environmental conservation. The successful bidder will be responsible for conducting a detailed survey that includes:\n\n1. **Geospatial Mapping:** Accurate mapping of the river catchment area using advanced geospatial technologies to identify critical flood zones, drainage patterns, and potential hazards.\n2. **Hydrological Data Collection:** Gathering and analyzing hydrological data such as water flow rates, water levels, and sedimentation patterns to understand the river's dynamics.\n3. **Topographical Features:** Documenting all topographical features including elevation profiles, landforms, and vegetation cover to provide a holistic view of the catchment.\n4. **Environmental Assessment:** Conducting an environmental assessment to identify sensitive habitats and ecosystems that may be impacted by the survey activities.\n5. **Data Integration:** Integrating the collected data into a comprehensive database that can be used for future planning, monitoring, and management of the Nenagh River Catchment.\n6. **Deliverables:** Providing detailed survey reports, maps, and datasets that meet the OPW's standards for accuracy and completeness.\n\nThe successful bidder should have extensive experience in conducting similar topographical surveys, particularly in river catchment areas. They must demonstrate expertise in geospatial technologies, hydrological data collection, and environmental assessments. The proposal should include a detailed methodology, timelines, and a clear plan for data delivery and integration.\n\n**Additional Requirements:**\n- The bidder must comply with all relevant Irish environmental and health and safety regulations.\n- The survey should be conducted in a manner that minimizes environmental impact and respects local communities.\n- The bidder should provide a comprehensive risk assessment and mitigation plan.\n- The final report should be submitted in both digital and printed formats.\n\nBy selecting a qualified bidder with the necessary expertise and experience, the OPW aims to enhance its capabilities in managing flood risks and protecting the environment in the Nenagh River Catchment.",
    "identifier": "95120621-1cc9-4ca4-ac84-be03c87b7954",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-03-01+00:00",
    "deadline_time": "15:00:00+00:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "71351810",
    "additional_classifications": [
      "71250000",
      "71353000",
      "71355000",
      "71353100",
      "71250000",
      "71353000",
      "71355000",
      "71353100"
    ],
    "place_of_performance": ""
  },
  "value": {
    "estimated_value": "50000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "required",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "true",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "required",
    "government_agreement_constraint": "true",
    "open_tender_date": "2024-03-01+00:00",
    "open_tender_time": "15:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3072852"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "not-allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Nenagh River Catchment Topographical Survey for the Office of Public Works",
      "description": "**Title:** Nenagh River Catchment Topographical Survey for the Office of Public Works\n\n**Description:**\nThe Office of Public Works (OPW) is seeking a qualified and experienced contractor to conduct a comprehensive topographical survey of the Nenagh River Catchment. The OPW is a government agency responsible for managing Ireland's property portfolio, including heritage properties, and is the lead agency for flood risk management in Ireland. This project is crucial for enhancing flood protection measures and ensuring sustainable planning in the region.\n\nThe successful bidder will be required to provide detailed topographical mapping of the Nenagh River Catchment, including but not limited to:\n\n- Accurate measurement and documentation of land elevations and contours.\n- Identification of potential flood risk areas and mitigation strategies.\n- Integration with existing flood risk management plans.\n- Compliance with OPW's environmental and safety standards.\n- Delivery of high-quality survey data in a format suitable for further analysis and planning.\n\nThe contractor should have extensive experience in topographical surveys, particularly in river catchment areas, and demonstrate a strong understanding of flood risk management principles. The project will involve collaboration with OPW's flood risk management team to ensure that the survey data aligns with the agency's broader objectives.\n\nThe successful bidder will be expected to provide a detailed methodology, timeline, and budget for the project. The OPW is committed to supporting the implementation of government policy and ensuring that public services are delivered efficiently and effectively. This project is a critical component of OPW's ongoing efforts to minimize the impacts of flooding and protect Ireland's natural heritage.\n\n**Key Requirements:**\n- Proven experience in conducting topographical surveys in river catchment areas.\n- Strong understanding of flood risk management principles and practices.\n- Ability to integrate survey data with existing flood risk management plans.\n- Compliance with OPW's environmental and safety standards.\n- High-quality data delivery in a format suitable for further analysis and planning.\n- Detailed methodology, timeline, and budget for the project.\n\n**Submission Guidelines:**\nBidders should submit their proposals electronically to the specified contact email address, including all required documentation and supporting evidence. The proposal should clearly outline the bidder's experience, methodology, timeline, budget, and any other relevant information. The OPW will evaluate proposals based on the bidder's qualifications, experience, and ability to meet the project requirements.",
      "main_nature": "services",
      "main_classification": "71351810",
      "additional_classifications": [
        "71250000",
        "71353000",
        "71355000",
        "71353100"
      ],
      "place_of_performance": "",
      "country": "",
      "value": {
        "estimated_value": "50000",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "ef-stand",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "true",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3072852"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/89463-2024/pdf"
}