{
  "notice_publication_id": "93594-2024",
  "buyer": {
    "official_name": "Department of Foreign Affairs/An Roinn Gnóthaí Eachtracha",
    "email": "consultant.tenders@dfa.ie",
    "legal_type": "cga",
    "activity": "gen-pub",
    "address": {
      "street": "Iveagh House. 80 St Stephen's Green. Dublin 2.",
      "city": "Dublin",
      "postal_code": "D02 VY53",
      "country": "IRL"
    },
    "website": "https://www.dfa.ie/",
    "company_id": "Department of Foreign Affairs",
    "phone": "+353 14082000"
  },
  "procedure": {
    "title": "Architect or Project Manager-led Design Team Services for the Full Office Fit-Out of the Consulate General of Ireland, Lyon, France.",
    "description": "**Title: Architect or Project Manager-led Design Team Services for the Full Office Fit-Out of the Consulate General of Ireland, Lyon, France.**\n\n**Description:**\nThe Department of Foreign Affairs, Ireland, is seeking a professional service provider to lead the design team for the full office fit-out of the Consulate General of Ireland in Lyon, France. The Consulate General will be leasing a permanent office of 555 m² of rentable space (444m² usable space) on the third floor of an eight-storey mixed-use building located in the centre of Lyon. The purpose of this office is to provide representational and consular services on behalf of the Irish State, specifically in the regions of Auvergne-Rhône-Alpes and Bourgogne-Franche-Comté.\n\nThe successful bidder will be required to coordinate and project manage the Design Team to complete the design and procurement of the building works from inception, planning, and construction to completion and handover of the project. The professional service provider will need to develop, administer, and coordinate all works contracts on behalf of the Department of Foreign Affairs within agreed budgets. Additionally, the provider must certify that the works are completed in full compliance with the design and all statutory obligations as they apply in Lyon, France.\n\nThe fit-out requires the highest quality design solution that reflects Ireland as a modern nation and aligns with the Consulate General’s purpose. The successful tenderer should demonstrate expertise in creating an environment that showcases Ireland's values and promotes its interests in the region. The project's success will be measured by its ability to provide a functional, aesthetically pleasing, and compliant workspace that effectively represents Ireland in the region.\n\n**Key Requirements:**\n- **Design Excellence:** The design should reflect Ireland's modern nation status and align with the Consulate General’s purpose.\n- **Project Management:** The provider must coordinate and project manage the Design Team from inception to completion.\n- **Budget Compliance:** All works contracts must be administered within agreed budgets.\n- **Statutory Compliance:** The works must be completed in full compliance with the design and all statutory obligations in Lyon, France.\n- **Representation:** The final workspace should effectively represent Ireland in the region of Auvergne-Rhône-Alpes and Bourgogne-Franche-Comté.\n\nBy engaging a suitable bidder, the Department of Foreign Affairs aims to ensure that the Consulate General of Ireland in Lyon is equipped with a high-quality, functional, and compliant workspace that supports its representational and consular services effectively.",
    "identifier": "03d4dd87-217e-41da-bc8e-9d41684816eb",
    "type": "open",
    "accelerated": "false",
    "deadline_date": "2024-03-22+00:00",
    "deadline_time": "18:00:00+00:00"
  },
  "purpose": {
    "main_nature": "services",
    "main_classification": "71221000",
    "additional_classifications": [
      "71220000",
      "71000000",
      "72224000",
      "71541000",
      "71220000",
      "71000000",
      "72224000",
      "71541000"
    ],
    "place_of_performance": "anyw-cou"
  },
  "value": {
    "estimated_value": "384000",
    "currency": "",
    "maximum_value": "0"
  },
  "general_information": {
    "terms_of_submission": "not-allowed",
    "variant_submissions": "",
    "electronic_invoicing": "allowed",
    "electronic_ordering": "false",
    "electronic_payment": "true"
  },
  "tendering_process": {
    "procedure_code": "open",
    "submission_method": "not-allowed",
    "government_agreement_constraint": "false",
    "open_tender_date": "2024-03-22+00:00",
    "open_tender_time": "18:30:00+00:00",
    "open_tender_location": "https://www.etenders.gov.ie/epps/cft/prepareViewCfTWS.do?resourceId=3086551"
  },
  "tendering_terms": {
    "variant_constraint": "",
    "funding_program": "no-eu-funds",
    "recurring_procurement": "",
    "multiple_tenders": "allowed",
    "esignature_submission": "",
    "ecatalog_submission": "not-allowed",
    "tender_validity_period": "",
    "tender_validity_period_unit": "",
    "security_clearance": ""
  },
  "lots": [
    {
      "lot": "LOT-0001",
      "title": "Architect or Project Manager-led Design Team Services for the Full Office Fit-Out of the Consulate General of Ireland, Lyon, France.",
      "description": "**Title:** Architect or Project Manager-led Design Team Services for the Full Office Fit-Out of the Consulate General of Ireland, Lyon, France.\n\n**Description:**\n\nThe Department of Foreign Affairs, Ireland, is seeking a professional service provider to lead the design team for the full office fit-out of the Consulate General of Ireland in Lyon, France. The Consulate General will be leasing a permanent office of 555 m² of rentable space (444m² usable space) on the third floor of an eight-storey mixed-use building located in the centre of Lyon. The purpose of this fit-out is to provide representational and consular services on behalf of the Irish State, reflecting Ireland as a modern nation with a strong sense of purpose.\n\nThe successfully engaged Tenderer will be required to coordinate and project manage the Design Team to complete the design and procurement of the building works from inception, planning, and construction to completion and handover of the project. The professional service provider will be responsible for developing, administering, and coordinating all works contracts on behalf of the Department of Foreign Affairs within agreed budgets. Additionally, the service provider must certify that the works are completed in full compliance with the design and all statutory obligations as they apply in Lyon, France.\n\nThis project aims to enhance the Consulate General's ability to represent Ireland in the regions of Auvergne-Rhône-Alpes and Bourgogne-Franche-Comté, ensuring that the office space reflects Ireland's values and promotes its interests effectively. The successful bidder should have a proven track record in delivering high-quality design solutions for diplomatic missions, with expertise in coordinating complex projects and managing budgets within tight timelines.\n\n**Key Requirements:**\n- **Design Expertise:** The service provider must have extensive experience in designing diplomatic missions and high-quality office spaces.\n- **Project Management:** The ability to coordinate and manage a design team from inception to completion is crucial.\n- **Budget Management:** The provider must be able to administer and coordinate all works contracts within agreed budgets.\n- **Compliance:** The works must be completed in full compliance with the design and all statutory obligations applicable in Lyon, France.\n- **Representation:** The design should reflect Ireland as a modern nation and align with the Consulate General’s purpose of representing Ireland in the region.\n\nBy engaging a suitable bidder, the Department of Foreign Affairs aims to ensure that the Consulate General of Ireland in Lyon is equipped with a modern, functional, and representative office space that enhances its ability to serve the Irish community and promote Ireland's interests in the region.",
      "main_nature": "services",
      "main_classification": "71221000",
      "additional_classifications": [
        "71220000",
        "71000000",
        "72224000",
        "71541000"
      ],
      "place_of_performance": "FRA",
      "country": "FRA",
      "value": {
        "estimated_value": "384000",
        "currency": "",
        "maximum_value": "0"
      },
      "general_information": {
        "reserved_participation": "none",
        "selection_criteria": "sui-act",
        "variant_submissions": "",
        "electronic_invoicing": "allowed",
        "electronic_ordering": "false",
        "electronic_payment": "true"
      },
      "specific_information": {
        "procedure_relaunch": "",
        "framework_agreement": "none",
        "dps_usage": "none",
        "reserved_execution": "no",
        "second_stage_indicator": ""
      }
    }
  ],
  "useful_links": [
    "https://www.etenders.gov.ie/epps/cft/listContractDocuments.do?resourceId=3086551"
  ],
  "pdf_link": "https://ted.europa.eu/en/notice/93594-2024/pdf"
}